{"publicApplicationId":"com.kalemsoft.ksmplayerpre3","description":"KalemSoft Media Player is the first powerful native media player application for WebOS that can play media formats such as divx, xvid, avi, flv, mp3, mp4, mkv, wmv, wma and many more. It can play media stored locally on the device or can stream media from a remote PC. Note that copy protected content such as Digital Copies will not play. Furthermore, if played locally (i.e., not streamed), high resolution (e.g., 720p or 1080p) content or content with advanced codecs such as h264 high profile or beyond will not play smooth in this version.\n\nIn order to play remote content, a free simple to setup streaming server application, KalemSoft Media Streamer, MUST BE SEPARATELY DOWNLOADED from KalemSoft website, www.kalemsoft.com\/site\/downloads2.html, and installed on a remote Windows PC. The content is streamed from the remote PC to the device directly in a secure way without no relay server in the middle. KalemSoft Media Player can also play live content streamed from a webcam or any other DirectShow compatible capture device attached to a remote computer.\n\nKalemSoft Media Player has the following features: support for all common codecs, external SRT, embedded SSA, embedded plain text subtitles, favorites list, playback in landscape and portrait modes, ability to change aspect ratio on the fly, recording of streamed content on the device, progressive download mode, secure connection to the streaming server and many more.","version":"0.3.5","homeURL":"http:\/\/www.kalemsoft.com\/support","supportURL":"http:\/\/www.kalemsoft.com\/support","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2003-2012 KalemSoft","licenseURL":"http:\/\/www.kalemsoft.com\/support","locale":null,"appSize":"6371036","installSize":"6371036","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"6.99","currency":"USD","filename":"com.kalemsoft.ksmplayerpre3_0.3.5_all.ipk","free":false,"images":[{"thumbnail":"1000724\/icon\/S\/icon_0_3_5.png","screenshot":"1000724\/icon\/S\/icon_0_3_5.png","orientation":"P","device":"P"}]}