{"publicApplicationId":"com.handmark.eu.otoe","description":"Developed using evidence from the Oxford English Corpus, this fully revised text offers more up-to-date and complete coverage of synonyms and antonyms than any other A-Z thesaurus.\n\nIncreased coverage now includes hundreds of new phrases and idioms, and newly selected examples of real English showing how words are used, and helping to guide you to the right meaning.\n\nNew features include the Word Toolkit which helps you choose the best word matches based on evidence from the Oxford English Corpus.\n\nIn addition, the popular Word Link feature points you to related words. Look up 'sleep' and find the words 'sedative', 'hypnotic', and 'soporific', and find related prefixes.\n\nThe Oxford Thesaurus of English is ideal for anyone who wants a comprehensive and authoritative thesaurus of current English, for use by writers and editors, students, and crossword and puzzle solvers at work or at home.\n\nFully revised text with over 600,000 synonyms and antonyms: more than any other A-Z thesaurus\n\nFeatures\n+ More than 35,000 examples of real English to help you find the meaning you need\n+ New phrases and idioms and new example sentences added using the latest from the Oxford English Corpus \n+ New Word Toolkit feature helps you choose the best word matches based on evidence of the usage from Oxford English Corpus\n+ Easy to use, with synonyms given in order of usefulness, and related words listed in a handy Word Link feature: look up 'ear' and find related words 'otic', 'auditory', and 'otoplasty'\n+ Redesigned centre section includes useful lists of words by topic, from society and religion, to fashion and technology\nNew to this edition\n+ Updated text including hundreds of additional phrases\n+ New Word Toolkit created using the Oxford English Corpus shows most common related words\n+ Redesigned text, Word Links, and Wordfinder section make the thesaurus even more accessible","version":"1.0.0","homeURL":"http:\/\/www.handmark.com\/support","supportURL":"http:\/\/www.handmark.com\/support","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2011 Handmark, Inc.","licenseURL":"http:\/\/www.handmark.com\/support","locale":null,"appSize":"75893464","installSize":"75893464","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"24.99","currency":"USD","filename":"com.handmark.eu.otoe_1.0.0_all.ipk","free":false,"images":[{"thumbnail":"1000167\/icon\/S\/icon_1_0_0.png","screenshot":"1000167\/icon\/S\/icon_1_0_0.png","orientation":"P","device":"P"}]}