{"publicApplicationId":"com.sven-ziegler.readontouch-phone","description":"No time for surfing? You would like to read everything later, even offline? The solution is ReadOnTouch PHONE! With ReadOnTouch PHONE you have all saved content neatly arranged for later reading on your web-OS-based gadget. With ReadOnTouch PHONE everything is made ready for later reading on your webOS-based gadget. Simple in use the app fits all saved web-content for a pleasant later reading experience. If en route to work, or different places without internet connection, once transferred the saved content from your favorite websites follow you with this app wherever you go!\n\nNot convinced yet? The saved articles come without annoying extras: No commercials, no disruptive pictures, only the important: The content comes perfectly prepared via ReadOnTouch PHONE to your web-OS device. Our special article-mode was especially created for a perfect reading experience on your web-OS gadget. Read fast, read efficient, read relaxed! Wherever you are! The app is developed continuously with your feedback, send wishes and problems to the contact-email filed under \"About\". This features are already made for you:\n\n- With active internet connection you can open your saved websites also conventionally in your external browser\n- On Demand you are able to synchronize automaticly in the background with different time intervals, you only need to supply new content while the app is adding the new stuff automaticly in the background\n- Add new content via the app itself, or with a patched standard browser\n- Nice content? Share it via facebook, twitter, google+, email or web-OS-messaging with your friends and colleagues\n\nSome changes for this version:\n\nNew features:\n- double-tapping inside article view snaps to fullscreen view and back\n\nBugfix:\n- much improved performance\n\nAll you need is an account for the free of charge service from www.readitlater.com. ReadOnTouch PHONE helps you with creating a free of charge account, integrate \"ReadItLater\" to your favorite browser and you are ready!","version":"1.0.3","homeURL":"http:\/\/sven-ziegler.com","supportURL":"http:\/\/sven-ziegler.com","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2011 Sven Ziegler","licenseURL":"http:\/\/sven-ziegler.com","locale":null,"appSize":"476432","installSize":"476432","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.99","currency":"USD","filename":"com.sven-ziegler.readontouch-phone_1.0.3_all.ipk","free":false,"images":[{"thumbnail":"com.sven-ziegler.readontouch-phone\/1.0.3\/en\/images\/1\/L\/ph_1.png","screenshot":"com.sven-ziegler.readontouch-phone\/1.0.3\/en\/images\/1\/L\/ph_1.png","orientation":"P","device":"P"},{"thumbnail":"com.sven-ziegler.readontouch-phone\/1.0.3\/en\/images\/2\/L\/ph_2.png","screenshot":"com.sven-ziegler.readontouch-phone\/1.0.3\/en\/images\/2\/L\/ph_2.png","orientation":"P","device":"P"},{"thumbnail":"com.sven-ziegler.readontouch-phone\/1.0.3\/en\/images\/3\/L\/ph_3.png","screenshot":"com.sven-ziegler.readontouch-phone\/1.0.3\/en\/images\/3\/L\/ph_3.png","orientation":"P","device":"P"},{"thumbnail":"com.sven-ziegler.readontouch-phone\/1.0.3\/en\/images\/4\/L\/ph_4.png","screenshot":"com.sven-ziegler.readontouch-phone\/1.0.3\/en\/images\/4\/L\/ph_4.png","orientation":"P","device":"P"},{"thumbnail":"com.sven-ziegler.readontouch-phone\/1.0.3\/en\/images\/5\/L\/ph_5.png","screenshot":"com.sven-ziegler.readontouch-phone\/1.0.3\/en\/images\/5\/L\/ph_5.png","orientation":"P","device":"P"}]}