{"publicApplicationId":"com.handmark.poadat","description":"Powered by Handmark, this all-in-one reference provides convenience, value, and the authority of Oxford dictionaries optimized for your Touchpad. \n\nThe Pocket Oxford American Dictionary & Thesaurus is the ideal, all-in-one reference, with a dictionary and a thesaurus combined in a single handy, integrated application. A word's meanings, synonyms, and antonyms are given in the same entry, allowing the user access to all this information at a glance.\n\nThe text is fully updated with the latest lexical content, informed by Oxford's extensive language research program including the Oxford English Corpus, a unique electronic database of more than two billion words that allows us to offer the fullest, most accurate picture of the English language today. Hundreds of new words cover computing, ecology, technology, and many other subjects.\n\nThe Dictionary & Thesaurus includes helpful extra features. Within the text, usage tip boxes help users write more effective English.\n\nFeatures\n•\tOptimized for the Touchpad\n•\t150,000 entries, synonyms, and senses\n•\tBrand-new integrated design is accessible, clear, and easy to use.\n•\tOffline access, so no wireless connection is necessary.\n•\tIntegrated dictionary and thesaurus texts\n•\tHelpful in-text features and extra reference information\n•\tPowered by Oxford's extensive language research program and the 2-billion-word Oxford English Corpus\n\nReadership: Anyone who wants an all-in-one reference combining a dictionary and thesaurus. It will appeal to puzzle solvers, people seeking to improve their writing style, and anyone who wants a comprehensive language resource.","version":"1.0.0","homeURL":"http:\/\/www.handmark.com\/support","supportURL":"http:\/\/www.handmark.com\/support","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2011 Handmark, Inc.","licenseURL":"http:\/\/www.handmark.com\/support","locale":null,"appSize":"47794540","installSize":"47794540","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"4.99","currency":"USD","filename":"com.handmark.poadat_1.0.0_all.ipk","free":false,"images":[{"thumbnail":"1000013\/icon\/S\/icon_1_0_0.png","screenshot":"1000013\/icon\/S\/icon_1_0_0.png","orientation":"P","device":"P"}]}