{"publicApplicationId":"com.angrygoat.sqzplayer","description":"(THIS IS NOT A FINISHED APP. USE AT YOUR OWN RISK)\n\nA software Squeezebox player. If you've never heard of Squeezebox please do a Google search before downloading. This is a companion for my other apps Squeeze Control and Squeeze Control XL, so there are no playback controls.  You will have to control this app with your Squeezebox Server's web interface or the above mentioned apps. \n\nThis app is still in the beta stage of development, but it should be stable enough for normal use. The existing design of the app is meant for debugging and does NOT reflect what the final design will be.  \n\n- Works with a local Squeezebox Server, with preliminary support for MySqueezebox.com. There's currently no way to directly register the app with your MySqueezebox account. You'll first have to connect to a local server and then use a controller(or Squeeze Control) to tell the app to switch to using MySqueezebox.com. After doing this once, you should be able to connect directly the next time.\n- Native decoding of FLAC, AAC, ALAC, ogg, mp3, aif, & PCM formats. Your local server will automatically convert all other formats.\n- Internet Streams: Only http and Shoutcast protocols are supported, which should be most streams. This includes apps like AccuRadio, Slacker, MP3tunes.\n- The free version of Pandora doesn't work. Logitech restricts it from working with software players. The paid version may work but untested, Rhapsody doesn't work.\n- Streams using unsupported formats or protocols should still work if the app is connected to a local server.   \n- Sychronization works, but will never be perfect. A software player on a low power device is just not accurate enough.\n\nv0.7.1\n-Added support for replay gain.","version":"0.7.1","versionNote":"","homeURL":"http:\/\/angrygoatapps.com","supportURL":"http:\/\/angrygoatapps.com","custsupportemail":"info@angrygoatapps.com","custsupportphonenum":"","copyright":"Copyright 2012 Wayne Tam","licenseURL":"","locale":"en_US","appSize":1985198,"installSize":4489216,"isEncrypted":false,"adultRating":false,"islocationbased":false,"lastModifiedTime":"2012-04-23T18:24:33.000+0000","mediaLink":null,"mediaIcon":null,"attributes":{"provides":{"noApp":false,"dockMode":false,"universalSearch":false,"connectors":["null"],"services":[],"optimizedUserExperience":true}},"price":0,"currency":"USD","isAdvertized":false,"filename":"com.angrygoat.sqzplayer_0.7.1_all.ipk","free":false,"touchpad_exclusive":true,"images":{"1":{"screenshot":"com.angrygoat.sqzplayer\/0.7.1\/en\/images\/1\/L\/1024x768_1024x768_tb_01.jpg","thumbnail":"com.angrygoat.sqzplayer\/0.7.1\/en\/images\/1\/S\/1024x768_480x320_tb_01.jpg","orientation":"L","device":"T"},"2":{"screenshot":"com.angrygoat.sqzplayer\/0.7.1\/en\/images\/2\/L\/1024x768_1024x768_tb_02.jpg","thumbnail":"com.angrygoat.sqzplayer\/0.7.1\/en\/images\/2\/S\/1024x768_480x320_tb_02.jpg","orientation":"L","device":"T"},"3":{"screenshot":"com.angrygoat.sqzplayer\/0.7.1\/en\/images\/3\/L\/1024x768_1024x768_tb_03.jpg","thumbnail":"com.angrygoat.sqzplayer\/0.7.1\/en\/images\/3\/S\/1024x768_480x320_tb_03.jpg","orientation":"L","device":"T"}}}