{"publicApplicationId":"com.webrich.uklvgtheorytest","description":"Prepare your theory test for Large Goods Vehicle (LGV or Lorry) with latest and official DSA question bank which has over 1000 questions.\nFor more screenshots and video demo, please visit our website:\nwww.uktheorytest.com\n\nPREPARE BY TOPICS:\nYou can study the highway code by topic. All questions are sorted by topic. It also tells you the areas that each topic covers.\n\n1) Accident Handling\n2) Braking Systems\n3) Documents\n4) Drivers' Hours and Rest Periods\n5) Environmental Issues\n6) Leaving the Vehicle\n7) Other Road Users\n8) Restricted View\n9) The Driver\n10) The Road\n11) Traffic Signs\n12) Vehicle Condition\n13) Vehicle Loading\n14) Vehicle Weights and Dimensions\n\nMOCK TEST MODE:\nMock test simulates the real test format. Questions are presented randomly from all the topics.\n\nPROGRESS METER:\nThe app records your progress as you start giving practice tests.\nIt shows you a beautiful bar chart so that you can track your weak areas and give more focus on them.\n\nFEATURE LIST:\nOver 1000 multiple-choice questions.\n1) Choose number of questions you would like in each test.\n2) Shows test results in HTML format with explanation for each question.\n3) E-mail yourself the test results and track your progress.\n4) A new module, “Progress Meter” keeps track of how you are performing in a particular topic or mock test.\n5) Special algorithm that randomizes questions every time you take a test.\n6) Mock test has exactly similar format as in real test.\n\nCopyright Info:\n- Crown copyright material reproduced under licence from the Driving Standards Agency and the controller of HMSO which does not accept any responsibility for the accuracy of the reproduction.\n\n- The questions are valid for theory tests taken after September 2011\n- LGV Test is also known as Heavy Goods Vehicle or HGV theory test.","version":"1.0.0","homeURL":"http:\/\/www.uktheorytest.com","supportURL":"http:\/\/www.uktheorytest.com","custsupportemail":"","custsupportphonenum":"","copyright":"copyright 2011 Driving Standards","licenseURL":"http:\/\/www.uktheorytest.com","locale":null,"appSize":"3467192","installSize":"3467192","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"2.99","currency":"USD","filename":"com.webrich.uklvgtheorytest_1.0.0_all.ipk","free":false,"images":[{"thumbnail":"1000010\/icon\/S\/icon_1_0_0.png","screenshot":"1000010\/icon\/S\/icon_1_0_0.png","orientation":"P","device":"P"}]}