{"publicApplicationId":"tlh.roneyii.tat","description":"Make the call, save lives. Use this simple app to help you identify and report instances of human trafficking.\nHuman trafficking, a term for modern-day slavery, is a $32 billion worldwide industry with more than 27 million people enslaved. It has been reported in all 50 states and the number of victims in the U.S. is estimated in hundreds of thousands.\n\nWhile illegal, human trafficking is a booming business, second only to drug trafficking. Most of the people trafficked are women and children. Many of them are used in the sex industry. They are the prostituted people on the street, at truck stops & in motels. They need help. They need to be identified and rescued.\n\nThis is where you come in! Truckers Against Trafficking recognizes that members of the trucking industry and individual truckers are invaluable in the fight against this heinous crime.\n\nThe goal of Truckers Against Trafficking (TAT) is to educate, equip, empower and mobilize members of the trucking and travel plaza industry to combat domestic sex trafficking by: \n- helping us put either our wallet cards or this app in the hands of every trucker in America; \n- have our trucking-industry-specific training DVD made part of orientation for all truck stop and travel plaza employees, all students of private and public trucking driving schools, all truck drivers employed via major carriers or owner\/operators; and\n-have TAT posters posted in all truck stops, rest areas and truck carrier break rooms across the United States. And then, once equipped with both awareness of the problem and education, when human trafficking is suspected, call the national hotline number of 1-888-373-7888.","version":"1.0.0","versionNote":"","homeURL":"http:\/\/tinyurl.com\/roneyii","supportURL":"http:\/\/tinuurl.com\/roneyii","custsupportemail":"naHQun@gmail.com","custsupportphonenum":"","copyright":"Copyright 2013 Michael Roney, Jr.","licenseURL":"","locale":"en_US","appSize":351726,"installSize":1474560,"isEncrypted":false,"adultRating":false,"islocationbased":false,"lastModifiedTime":"2012-12-03T22:03:19.000+0000","mediaLink":null,"mediaIcon":null,"attributes":{"provides":{"noApp":false,"dockMode":false,"universalSearch":false,"connectors":["null"],"services":[],"optimizedUserExperience":true}},"price":0,"currency":"USD","isAdvertized":false,"filename":"tlh.roneyii.tat_1.0.0_all.ipk","free":false,"touchpad_exclusive":true,"images":{"1":{"screenshot":"tlh.roneyii.tat\/1.0.0\/en\/images\/1\/L\/320x480_320x480_1_tat_2012-19-11_021320.png","thumbnail":"tlh.roneyii.tat\/1.0.0\/en\/images\/1\/S\/768x1024_320x480_2_tat_2012-19-11_024338.png","orientation":"P","device":"P"},"2":{"screenshot":"tlh.roneyii.tat\/1.0.0\/en\/images\/2\/L\/320x480_320x480_1_tat_2012-19-11_021327.png","thumbnail":"tlh.roneyii.tat\/1.0.0\/en\/images\/2\/S\/768x1024_320x480_2_tat_2012-19-11_024342.png","orientation":"P","device":"P"},"3":{"screenshot":"tlh.roneyii.tat\/1.0.0\/en\/images\/3\/L\/320x480_320x480_1_tat_2012-19-11_021331.png","thumbnail":"tlh.roneyii.tat\/1.0.0\/en\/images\/3\/S\/768x1024_320x480_2_tat_2012-19-11_024347.png","orientation":"P","device":"P"}}}