{"publicApplicationId":"com.britannica.kids.solarsystem","description":"Smart apps + Smart learning = Smarter kids\n\nThis is the perfect app for exploring the secrets of the Solar System in a fun and engaging way. Learn and play at the same time through a variety of games like Memory Match, Jigsaw Puzzles, and the Magic Square among others. Explore the solar system through a wealth of amazing images and informative articles. And as it’s from Encyclopædia Britannica, you can be sure it’s appropriate and safe for the whole family. \n\nBritannica Kids Solar System app is perfect for getting the facts right and exploring the eight major planets and their moons, the sun, comets, asteroids, gravity, and space in a really cool way. \n\nLearning about the solar system has never been more fun with this interactive and educational app based on the school curriculum. Ideal for homework help, the app features: \n\nExclusive Encyclopædia Britannica curriculum-based content with high quality pictures and captions written specifically for children. \n\nJigsaw Puzzles, created from beautiful images of the Solar System. Break apart the puzzle and have some fun by sliding the pieces back into place to complete the puzzle - it’s not as easy as it looks! \n\nScramble images of the Solar System in The Magic Square game and challenge yourself by rearranging the squares to unscramble the image. \n\nBrush Off - brush the layers to reveal images of the major planets and then try to guess what it is - how many can you answer correctly? \n\nTest your knowledge of the Solar System with the Quiz feature - how much have you learned? But hurry: you must answer quickly as the quiz is timed!  \n\nTest your memory with the popular Memory Match game and match up the pairs! \n\nWhy not take your exploration into the Solar System a step further and link to Britannica’s online services – Britannica Online for Kids or Britannica Online – to continue your discoveries.","version":"1.1.2","homeURL":"http:\/\/www.concentricsky.com\/contact\/","supportURL":"http:\/\/www.concentricsky.com\/contact\/","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright Encyclopædia Britannica, Inc.","licenseURL":"http:\/\/www.concentricsky.com\/contact\/","locale":null,"appSize":"152548444","installSize":"152548444","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"5.99","currency":"USD","filename":"com.britannica.kids.solarsystem_1.1.2_all.ipk","free":false,"images":[{"thumbnail":"10027\/icon\/S\/icon_1_1_2.png","screenshot":"10027\/icon\/S\/icon_1_1_2.png","orientation":"P","device":"P"}]}