{"publicApplicationId":"com.paradiseware.routeplanner","description":"When you have several appointments to hit in a day, or,  need to make deliveries to several locations, or have repetitive routes, or, need to pick up from multiple addresses, or, in my wife’s case have 15 yard sales to hit in one morning, you need the help of RoutePlanner to help you choose the best route.\nRoutePlanner provides for speedy entry of multiple addresses, or “waypoints”. It maintains a list of those waypoints and plots each waypoint on a road map. As you see on the map where the addresses are situated, you can rearrange the list of waypoints to correspond to the best driving route. If your itinerary changes, you can delete waypoints and your map plot is automatically adjusted.\n\nWhen your route is ready, take your HP webOS device and the RoutePlanner driving route with you. As you go, pinch-to-zoom in on the map for a closer look at cross street names.  If you like, swipe to delete addresses as you complete each step of the route.\n\nFor each waypoint, you can optionally enter a name or note for each waypoint. For example, a note of “arrive between 3:00 and 4:00″ or “Pick-up at side door” or, “sale begins at 9:00″ etc., can be entered to help you remember details for each waypoint.\n\nRoutePlanner helps to speed up address entry:  you don't re-enter the city and input is re-focused for the next name\/note so you can continue entering quickly.\n\nEach waypoint on the map is assigned a sequence number. As you plot several unfamiliar addresses, you may see, for example, that it would save time if waypoint 6 were moved to the 4th waypoint. RoutePlanner gives you a simple way to do this. Just tap waypoint 6 and tap the “up” arrow twice!\n\nAs I hinted, the idea for this app came from my wife. She loves going to yard sales. She would spend hours with a paper map figuring out where sales were. This app makes that job a breeze.\n**NOTE: This app uses Bing Maps so a data connection is needed.","version":"1.0.5","versionNote":"","homeURL":"http:\/\/paradiseware.com","supportURL":"http:\/\/paradiseware.com\/routeplanner","custsupportemail":"paradiseware@gmail.com","custsupportphonenum":"9892771694","copyright":"copyright 2011 Paradiseware LLC","licenseURL":"","locale":"en_US","appSize":36988,"installSize":491520,"isEncrypted":false,"adultRating":false,"islocationbased":false,"lastModifiedTime":"2012-06-02T03:52:53.000+0000","mediaLink":null,"mediaIcon":null,"attributes":{"provides":{"noApp":false,"dockMode":false,"universalSearch":false,"connectors":["null"],"services":[],"optimizedUserExperience":true}},"price":2.99,"currency":"USD","isAdvertized":false,"filename":"com.paradiseware.routeplanner_1.0.5_all.ipk","free":false,"touchpad_exclusive":true,"images":{"1":{"screenshot":"10208\/1.0.5\/en\/images\/1\/L\/tb_routeplanner_1.png","thumbnail":"10208\/1.0.5\/en\/images\/1\/S\/tb_routeplanner_1.png","orientation":"L","device":"T"},"2":{"screenshot":"10208\/1.0.5\/en\/images\/2\/L\/tb_routeplanner_2annotated.png","thumbnail":"10208\/1.0.5\/en\/images\/2\/S\/tb_routeplanner_2annotated.png","orientation":"L","device":"T"},"3":{"screenshot":"10208\/1.0.5\/en\/images\/3\/L\/tb_routeplanner_3.png","thumbnail":"10208\/1.0.5\/en\/images\/3\/S\/tb_routeplanner_3.png","orientation":"L","device":"T"},"4":{"screenshot":"10208\/1.0.5\/en\/images\/4\/L\/tb_routeplanner_4.png","thumbnail":"10208\/1.0.5\/en\/images\/4\/S\/tb_routeplanner_4.png","orientation":"L","device":"T"}}}