{"publicApplicationId":"com.infomarvel.istorybooks.trial","description":"This is the FREE version of iStoryBooks with 2 free books.  Download and try it today for free. \n\niSTORYBOOKS IS A COLLECTION OF 19 CHILDREN'S PICTURE BOOKS WITH PROFESSIONAL VOICE OVER. \n\nInteractive Childrens Books for the new generation! We release a new book every two weeks. Books that read itself to your little ones! Yes the books include text and audio. Kids can enjoy these books on their own or you can read to them. We welcome your valuable comments and suggests. Please post your comments and suggestions, play games, puzzles and download coloring pages at facebook.com\/iStoryBooks. \n\nType of books include childrens books, story books, bedtime stories, toddler books, preschool books, nursery school books, kindergarten books and picture books with accompanying audio of the text in each page. Some of our popular books include: \nFairy Tales \n* Cinderella, the classic story about a beautiful girl named Cinderella who always hoped for the best even during hard times and eventually, her wishes come true! \n* Little Red Hiding Hood, the story of a little girl who went for an adventure in the forest. \n* Cenicienta, the spanish (espanol) version our most popular book Cinderella. \n\nAnimal Story Books: \n* The Blue Fox \n* The Crow the Doves and the Mouse Educational Books \n* A to Z Animals, A fun book to learn alphabets with pictures of animals.\n* A to Z Fruits and Vegetables - Junior\/Preschool\/Yummy Riddles - A set of three books to learn alphabets with pictures of fruits and vegetables. \n\n* The World of Trucks - Big and Small - A fun book with pictures and engine sounds of Trucks of various sizes and shapes. Includes Fire Truck with siren and horn, Crane Truck, Garbage Truck, Tow Truck, Picukup Truck, Dump Truck, Road Train etc. \n\n* The World of Dinosaurs - Big and Small \n\nEnjoy these books and others with your kids on your nook or download games, puzzles and coloring pages from facebook.com\/iStoryBooks.","version":"1.0.16","versionNote":"Fixed the issue with blank images and audio.","homeURL":"http:\/\/istorybooks.getacustomsite.com","supportURL":"http:\/\/facebook.com\/iStoryBooks","custsupportemail":"apps@infomarvel.com","custsupportphonenum":"5086448445","copyright":"Copyright 2010 Infomarvel Business Solutions, Inc.","licenseURL":"","locale":"en_US","appSize":304316,"installSize":1179648,"isEncrypted":false,"adultRating":false,"islocationbased":false,"lastModifiedTime":"2011-10-18T09:42:13.000+0000","mediaLink":null,"mediaIcon":null,"attributes":{"provides":{"noApp":false,"dockMode":false,"universalSearch":false,"connectors":["null"],"services":[],"optimizedUserExperience":true}},"price":0,"currency":"USD","isAdvertized":false,"filename":"com.infomarvel.istorybooks.trial_1.0.16_all.ipk","free":false,"touchpad_exclusive":true,"images":{"1":{"screenshot":"10204\/1.0.16\/en\/images\/1\/L\/tb_screenshot-03.png","thumbnail":"10204\/1.0.16\/en\/images\/1\/S\/tb_screenshot-03.png","orientation":"L","device":"T"},"2":{"screenshot":"10204\/1.0.16\/en\/images\/2\/L\/tb_screenshot-02.png","thumbnail":"10204\/1.0.16\/en\/images\/2\/S\/tb_screenshot-02.png","orientation":"L","device":"T"},"3":{"screenshot":"10204\/1.0.16\/en\/images\/3\/L\/tb_screenshot-01.png","thumbnail":"10204\/1.0.16\/en\/images\/3\/S\/tb_screenshot-01.png","orientation":"L","device":"T"}}}