{"publicApplicationId":"com.yuza.hg2","description":"41 guides, 1 app. Welcome to Hg2 - the city guide series coveted by travellers who value both style and substance when it comes to soaking up a city. We're not about the most expensive shops, bars, restaurants and hotels - we're about the best. All our guides are compiled by writers who have lived in each city, with content that is packed with insider knowledge and a voice that is irreverent, inspired, and, above all, intelligent. All Hg2 travel content is stored on your TouchPad - only using data connections for features such as maps, check-in and sound track to the city to minimise data roaming costs. This is the ultimate Hg2 app – packed with destination information on 41 cities and ski resorts around the world – it is the perfect companion to any trip away. This master application has taken 5 years to research and photograph – and includes over 10,000 hand-picked and tested hotels, restaurants, bars, cafés, clubs, spas, shops, sights and things to do. We eat and drink in every single venue we review incognito and this is a filtered collection of the best places to guarantee an amazing time, both home and away. The 2011 edition is constantly updated with new openings, closures and relevant information – the master edition will also include three new cities due to come online over the first half of 2011. “Hg2 is about foreign life as art” – Vanity Fair “The new travel must-haves” – The Daily Telegraph “A minor bible” – The New York Times “Excellent guides for stylish travellers” – Harper’s Bazaar “Insight into what’s really going on” - Tatler","version":"1.0.2","versionNote":"","homeURL":"http:\/\/yuza.com","supportURL":"http:\/\/yuza.com\/support","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2011 Hg2, Copyright 2011 YUZA","licenseURL":"","locale":"en_US","appSize":364717794,"installSize":493486080,"isEncrypted":false,"adultRating":false,"islocationbased":false,"lastModifiedTime":"2012-06-02T02:13:55.000+0000","mediaLink":null,"mediaIcon":null,"attributes":{"provides":{"noApp":false,"dockMode":false,"universalSearch":false,"connectors":["null"],"services":[],"optimizedUserExperience":true}},"price":12.51,"currency":"USD","isAdvertized":false,"filename":"com.yuza.hg2_1.0.2_all.ipk","free":false,"touchpad_exclusive":true,"images":{"1":{"thumbnail":"10230\/1.0.2\/en\/images\/1\/S\/tb_ImageProxy.png","screenshot":"10230\/1.0.2\/en\/images\/1\/L\/tb_ImageProxy.png","orientation":"P","device":"T"},"2":{"thumbnail":"10230\/1.0.2\/en\/images\/2\/S\/tb_ImageProxy-1.png","screenshot":"10230\/1.0.2\/en\/images\/2\/L\/tb_ImageProxy-1.png","orientation":"P","device":"T"},"3":{"thumbnail":"10230\/1.0.2\/en\/images\/3\/S\/tb_ImageProxy-2.png","screenshot":"10230\/1.0.2\/en\/images\/3\/L\/tb_ImageProxy-2.png","orientation":"P","device":"T"}}}