{"publicApplicationId":"com.ewacsoftware.trial.winer","description":"This is a trial version which lasts for 14 days.\n\nMaintain your wine cellar from the palm of your hand. Winer allows you to track the wines you own, the wines you like, and the wines you drink.\n\nFeatures:\n* Separate screens for vintners and wines means you enter them only once; you need only add a new vintage.\n* Easily create a new vintage by duplicating an existing one and making the necessary changes.\n* Vintaged and non-vintaged wines supported.\n* Easily view the wines in your cellar or the wines which are out-of-stock.\n* Sort your wines by name, vintner, or type (red, white, etc.).\n* Sommelier helps you find wines based on your search criteria.\n* Guides help you learn about wines, such as storing, tasting, pairing, etc.\n* Archiving and restoring keeps your collection safe.\n* Works in portrait and landscape mode.\n\nSupport:\nEmail: support@ewacsoftware.com\nPlease do NOT enter problems in the Reviews section of the App Catalog. We cannot help you this way, please contact support with any issues you may find.\n\nWebsite: www.ewacsoftware.com\nComments & feedback are always welcome via the website.\n\nRelease 1.1.4:\n* Fixed bug where some wines with multiple vintages and a quantity of 1 or more would show up incorrectly as out-of-stock.\nRelease 1.1.3:\n* Fixed All\/Cellared\/Out of Stock button in Cellar scene to display the correct icon when changing modes.\nRelease 1.1.2:\n* Fixed splash icon when launching Winer on the TouchPad.\nRelease 1.1.1:\n* Updated Winer to run full-screen on the TouchPad and Pre3.","version":"1.1.4","homeURL":"http:\/\/www.ewacsoftware.com\/contact.html","supportURL":"http:\/\/www.ewacsoftware.com\/contact.html","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2012 EWAC Software","licenseURL":"http:\/\/www.ewacsoftware.com\/contact.html","locale":null,"appSize":"667860","installSize":"667860","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":0,"currency":"USD","filename":"com.ewacsoftware.trial.winer_1.1.4_all.ipk","free":true,"images":[{"thumbnail":"10354\/icon\/S\/icon_1_1_4.png","screenshot":"10354\/icon\/S\/icon_1_1_4.png","orientation":"P","device":"P"}]}