{"publicApplicationId":"com.britannica.kids.egypt-uk","description":"Smart apps + Smart learning = Smarter kids\n\nAncient Egypt is the perfect app for exploring the secrets of hieroglyphics, mummification, the Pyramids, Tutankhamen, Cleopatra, and other popular Egyptian topics. \n\nLearn and play at the same time through a variety of games like Memory Match, Jigsaw Puzzles, and the Magic Square among others.\n \nLearning about ancient Egypt has never been more fun with this quick, interactive, and educational app based on the school curriculum. And as it’s from Britannica you can be sure it’s appropriate and safe for the whole family and is ideal for homework help.\n \nThen the fun starts: \n\nMap – With this amazing tool you can locate where you are anywhere in the world. Want to see the Pyramids? It’s easy with our map tool; use the zoom feature to see one of the largest structures ever built up close and personal! \n\nJigsaw Puzzles, created from amazing graphics of ancient Egypt. Break apart the puzzle and have some fun by sliding the pieces back into place to complete the puzzle - it’s not as easy as it looks! \n\nBrush Off: brush the layers to reveal images of ancient Egypt and then try to guess what it is – how many can you answer correctly? \n\nTest your knowledge of ancient Egypt with the Quiz feature - how much have you learned? But hurry: you must answer quickly as the quiz is timed! \n\nTestimonials:\n\n“Plenty of ancient Egyptian fun and replay value for tweens… A lot of the learning will be incidental to the game play, but so what?” – Best Kids Apps (www.bestkidsapps.com) \n\n“…I have been seriously impressed with both the content and design.” – The iPhone Mom (www.iphonemom.com) \n\nTry it today!\n\nEncyclopædia Britannica, Inc.","version":"1.1.1","homeURL":"http:\/\/www.concentricsky.com\/contact\/","supportURL":"http:\/\/www.concentricsky.com\/contact\/","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright Encyclopædia Britannica, Inc.","licenseURL":"http:\/\/www.concentricsky.com\/contact\/","locale":null,"appSize":"349526106","installSize":"349526106","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"5.99","currency":"USD","filename":"com.britannica.kids.egypt-uk_1.1.1_all.ipk","free":false,"images":[{"thumbnail":"10409\/icon\/S\/icon_1_1_1.png","screenshot":"10409\/icon\/S\/icon_1_1_1.png","orientation":"P","device":"P"}]}