{"publicApplicationId":"com.jiyer.scorekeeper","description":"\/\/This release fixes a bug where longer games caused a crash.\/\/  Forget paper and pencil! Next time you want to keep track of scores, this app is all you need.   You don’t have to do the math anymore! Use this while playing games at home or when out playing with friends.   You can use this general purpose score tracking app for games like Scrabble, Boggle, Rummy, Euchre, Cribbage etc.  Features:  Keep track of the number of rounds each player or team has played and their latest score.  Simple user interface that shows all player scores in one screen.  Quickly view a player’s score in each of the previous rounds. Easily reset scores at the end of the game while retaining the list of players.   Made a mistake?  Just swipe to delete any specific round for a player.  The total scores will be adjusted automatically.  Keep track of running scores for as many players or teams as you please.   Pause the game at any time and resume later.   Reorder players in the list to match gameplay simply using drag and drop.  Tap on a user’s name or on the current score to enter new scores.      Tap on the blue round button to see the player’s score in each round.  Tap blue round button again to hide round scores.   Swipe to delete a particular player.   You can keep scores for many types of games including board games, card games and table games.  Ad-supported. Tags: Taboo, Yahtzee, Dominoes, Darts,  Uno, Hearts, board games, card games, table games , team sports, paper, pencil, score keeping, score tracking, strategy games, score tracker, , Eucker, Eucher , polls, points, text twist, deal or no deal, Disc Golf, Trivia, Trivial pursuit, Cornhole, Canasta,  Phase 10, Poker","version":"1.1.0","versionNote":"","homeURL":"http:\/\/www.jiyer.com\/scorekeeper","supportURL":"http:\/\/www.jiyer.com\/scorekeeper","custsupportemail":"scorekeeper@jiyer.com","custsupportphonenum":"..","copyright":"copyright 2010 SealsMedia","licenseURL":"","locale":"en_US","appSize":27254,"installSize":1659539,"isEncrypted":false,"adultRating":false,"islocationbased":false,"lastModifiedTime":"2010-07-24T04:38:33.000+0000","mediaLink":null,"mediaIcon":null,"attributes":{"provides":{"noApp":false,"dockMode":false,"universalSearch":false,"connectors":[],"services":[],"optimizedUserExperience":false}},"price":0,"currency":"USD","isAdvertized":false,"filename":"com.jiyer.scorekeeper_1.1.0_all.ipk","free":false,"touchpad_exclusive":false,"images":{"1":{"thumbnail":"1045\/en\/images\/1\/S\/scorekeeper_1.png","screenshot":"1045\/en\/images\/1\/L\/scorekeeper_1.png","orientation":"P","device":"P"},"2":{"thumbnail":"1045\/en\/images\/2\/S\/scorekeeper_2.png","screenshot":"1045\/en\/images\/2\/L\/scorekeeper_2.png","orientation":"P","device":"P"},"3":{"thumbnail":"1045\/en\/images\/3\/S\/scorekeeper_3.png","screenshot":"1045\/en\/images\/3\/L\/scorekeeper_3.png","orientation":"P","device":"P"},"4":{"thumbnail":"1045\/en\/images\/4\/S\/scorekeeper_4.png","screenshot":"1045\/en\/images\/4\/L\/scorekeeper_4.png","orientation":"P","device":"P"},"5":{"thumbnail":"1045\/en\/images\/5\/S\/scorekeeper_5.png","screenshot":"1045\/en\/images\/5\/L\/scorekeeper_5.png","orientation":"P","device":"P"}}}