{"publicApplicationId":"com.discipleskies.gpsoutbackpro","description":"GPS Outback Pro is the top of the line navigation product from Disciple Skies.\n\nIt includes a location tracker with a GPS controlled directional compass and a Waypoint Finding Compass that always points to your target.  Also get speed, total distance traveled, altitude, total ascent\/descent, heading, latitude & longitude.\n\nWhen a carrier signal is available, GPS functions may be correlated with an interactive map that shows your position and is linked to a waypoint keeper that stores and manages your waypoints. You may view your coordinates or the coordinates of any of your saved waypoints in any of the standard formats for coordinate reporting.  \n\nYour trail is stored so you can review your path at anytime.  \n\nThe waypoint manager allows you to save a waypoint as either your current location, a specified coordinate pair or from a tapped position on the interactive map.   Coordinates may be entered in any of the accepted formats (ie degrees, degrees\/minutes\/seconds or any combination of the above with legal north\/south\/east\/west designation).   \n\nYou can add an unlimited number of waypoints and delete the ones you no longer use. \n\nGet estimated time of arrival and updated distance to waypoint.\n\n**New:  Somebody meeting you?  Email your position and address directly from the app with the tap of a button.\n\nThe palm phone with this software is technology you do not want to miss out on!","version":"6.3.0","homeURL":"http:\/\/www.discipleskies.com","supportURL":"http:\/\/www.discipleskies.com","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2012 Disciple Skies Software","licenseURL":"http:\/\/www.discipleskies.com","locale":null,"appSize":"3673356","installSize":"3673356","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"2.99","currency":"USD","filename":"com.discipleskies.gpsoutbackpro_6.3.0_all.ipk","free":false,"images":[{"thumbnail":"10511\/icon\/S\/icon_6_3_0.png","screenshot":"10511\/icon\/S\/icon_6_3_0.png","orientation":"P","device":"P"}]}