{"publicApplicationId":"com.britannica.kids.knights-uk","description":"Smart apps + Smart learning = Smarter kids\n\nKnights and Castles looks at the rise of the chivalric knight and knightly orders, life inside a medieval castle and further medieval legends all in a really cool and interactive way. This app has been designed to help with homework, projects and exams, but at the same time children get fun and excitement while learning. Plus, as it’s from Britannica you can be sure it’s appropriate and safe for the whole family!\n\nBritannica Kids Knights and Castles is suitable for children and has been developed around Britannica’s exclusive curriculum-based content, with high-quality images and interactive learning games. \n \nThen the fun starts:\n \nMap – with this amazing tool you can locate where you are anywhere in the world. Want to see a castle ruin? It’s easy with our map tool, and you can use the zoom feature to see the location up close.\n  \nJigsaw Puzzles – created from stunning scenes from the apps image library. Break apart the puzzle and have some fun by sliding the pieces back into place to complete the jigsaw – it’s not as easy as it looks! \n\nBrush Off – brush the layers to reveal parts of a castle structure and then try to guess what they are. How many can you answer correctly? \n \nTest your knowledge of knights and castles with the Quiz feature – how much have you learned? But hurry: you must answer quickly as the quiz is timed!\n \nTestimonials:\n \n“Encyclopædia Britannica launches new educational apps what a BRILLIANT idea!!!” – Positive Parents (www.positive-parents.com)\n \n“… I have been seriously impressed with both the content and design.” – The iPhone Mom (www.iphonemom.com)\n\nTry it today!\n \nEncyclopædia Britannica, Inc.","version":"1.1.1","homeURL":"http:\/\/www.concentricsky.com\/contact\/","supportURL":"http:\/\/www.concentricsky.com\/contact\/","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright Encyclopædia Britannica, Inc.","licenseURL":"http:\/\/www.concentricsky.com\/contact\/","locale":null,"appSize":"250841148","installSize":"250841148","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"5.99","currency":"USD","filename":"com.britannica.kids.knights-uk_1.1.1_all.ipk","free":false,"images":[{"thumbnail":"10603\/icon\/S\/icon_1_1_1.png","screenshot":"10603\/icon\/S\/icon_1_1_1.png","orientation":"P","device":"P"}]}