{"publicApplicationId":"com.britannica.kids.snakes-uk","description":"Smart apps + Smart learning = Smarter kids\n\nSnakes is the perfect app for getting the facts right. It looks at the characteristics, feeding habits, life cycle, types of snakes and much more in a really cool and interactive way. This app has been designed to help with homework, projects and exams, but at the same time children get fun and excitement while learning. Plus, as it’s from Britannica you can be sure it’s appropriate and safe for the whole family! \n\nBritannica Kids Snakes app is suitable for children and has been developed around Britannica’s exclusive curriculum-based content, with high-quality images and interactive learning games.\n\nThen the fun starts:\n\nMap – with this amazing tool you can locate where you are anywhere in the world. Want to see where a particular snake lives? It’s easy with our map tool, and you can use the zoom feature to see the location up close. \n \nJigsaw Puzzles – created from stunning images of snakes. Break apart the puzzle and have some fun by sliding the pieces back into place to complete the jigsaw. It’s not as easy as it looks! \n\nBrush Off – brush the layers to reveal different snakes and then try to guess what they are. How many can you answer correctly? \n\nTest your knowledge of snakes with the Quiz feature – how much have you learned? But hurry: you must answer quickly as the quiz is timed! \n\nTestimonials:\n\n“… outstanding quality that Encyclopædia Britannica is known for.” – Adam Curry, The Big App Show \n\n\n“Encyclopædia Britannica launches new educational apps what a BRILLIANT idea!!!” – Positive Parents (www.positive-parents.com)\n\n“… I have been seriously impressed with both the content and design.” – The iPhone Mom (www.iphonemom.com) \n\nTry it today!\n\nEncyclopædia Britannica, Inc.","version":"1.1.1","homeURL":"http:\/\/www.concentricsky.com\/contact\/","supportURL":"http:\/\/www.concentricsky.com\/contact\/","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright Encyclopædia Britannica, Inc.","licenseURL":"http:\/\/www.concentricsky.com\/contact\/","locale":null,"appSize":"232899450","installSize":"232899450","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"5.99","currency":"USD","filename":"com.britannica.kids.snakes-uk_1.1.1_all.ipk","free":false,"images":[{"thumbnail":"10636\/icon\/S\/icon_1_1_1.png","screenshot":"10636\/icon\/S\/icon_1_1_1.png","orientation":"P","device":"P"}]}