{"publicApplicationId":"com.britannica.kids.volcanoes-uk","description":"Smart apps + Smart learning = Smarter kids\n\nVolcanoes are an awesome display of the Earth’s power. Explore them interactively with this new app and learn about the world’s major volcanoes and their eruptions, lava, plate tectonics and much more. Learn and play at the same time through a variety of games like Memory Match, Jigsaw Puzzles and the Magic Square among others. Learning has never been more fun with this informative and educational app that is based on school curriculum. And as it’s from Britannica you can be sure it’s appropriate and safe for the whole family.\n\nThen the fun starts:\n\nMap – with this amazing tool you can locate where you are anywhere in the world and see how near you are to the most powerful volcanoes. Want to see your favourite volcano? It’s easy with our map tool, and you can use the zoom feature to see right into the craters!\n\nJigsaw Puzzles – created from amazing graphics of volcanoes. Break apart the puzzle and have some fun by sliding the pieces back into place to complete the jigsaw. It’s not as easy as it looks!\n\nBrush Off – brush off the lava, soot and dust from the eruption of Vesuvius to reveal an object in the city of Pompeii and then try to guess what it is. How many can you answer correctly? \n\nTest your knowledge of volcanoes with the Quiz feature – how much have you learned? But hurry: you must answer quickly as the quiz is timed!\n\nTestimonials:\n\n“… outstanding quality that Encyclopaedia Britannica is known for.” – Adam Curry, The Big App Show\n\n“A lot of the learning will be incidental to the game play, but so what?” – Best Kids Apps (www.bestkidsapps.com)\n\nTry it today!\n\nEncyclopædia Britannica, Inc.","version":"1.1.2","homeURL":"http:\/\/www.concentricsky.com\/contact\/","supportURL":"http:\/\/www.concentricsky.com\/contact\/","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright Encyclopædia Britannica, Inc.","licenseURL":"http:\/\/www.concentricsky.com\/contact\/","locale":null,"appSize":"251602798","installSize":"251602798","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"5.99","currency":"USD","filename":"com.britannica.kids.volcanoes-uk_1.1.2_all.ipk","free":false,"images":[{"thumbnail":"10772\/icon\/S\/icon_1_1_2.png","screenshot":"10772\/icon\/S\/icon_1_1_2.png","orientation":"P","device":"P"}]}