{"publicApplicationId":"com.orgorganization.app.timein","description":"Time In is a stopwatch application offering split and lap functionality.  Sets of splits\/laps can be saved, edited, and loaded for comparing recurring split\/lap activity.  Customizable notifications can be configured to alert on a passing or missed lap\/split.  Ringtones, default sound, extended vibration and banner messages can be individually enabled as notifications.  Optional start when launched functionality is great for anyone needing to start timing quickly.  A configurable countdown with notification at start allows for hands off starts.  Real time longest, shortest, average and current lap\/split stats are available as the timer is running.  Start, Stop, Lap\/Split, Reset, Total Time and Lap Time are all viewable in a dashboard view for control while working in another application.  The dashboard functionality is fully operational from the lock screen so you don't have to unlock your device to operate Time In.  Recorded stats and lap\/split details can be emailed in a report or CSV format for easy record keeping.  Adjustable precision of time up to thousandths of a second gives you flexibility with the accuracy as you desire.  Customizable time formats allow you to pick how you want the time to display.  Update frequency is adjustable to make better use of battery life for long running timing.  Fifteen themes to select from such as Track, Pool and Field.\n","version":"1.0.0","versionNote":"","homeURL":"http:\/\/www.orgorganization.com","supportURL":"http:\/\/www.orgorganization.com\/timein.html","custsupportemail":"timeinsupport@orgorganization.com","custsupportphonenum":"","copyright":"copyright 2010 OrgOrganization","licenseURL":"","locale":"en_US","appSize":1217982,"installSize":5281654,"isEncrypted":false,"adultRating":false,"islocationbased":false,"lastModifiedTime":"2012-05-31T23:44:19.000+0000","mediaLink":null,"mediaIcon":null,"attributes":{"provides":{"noApp":false,"dockMode":false,"universalSearch":false,"connectors":["null"],"services":[],"optimizedUserExperience":false}},"price":0.99,"currency":"USD","isAdvertized":false,"filename":"com.orgorganization.app.timein_1.0.0_all.ipk","free":false,"touchpad_exclusive":false,"images":[]}