{"publicApplicationId":"com.capcom.millionaire","description":"Who Wants To Be A Millionaire, challenges players to correctly answer 15 questions of increasing difficulty with the help of four lifelines - Ask the Audience, Phone a Friend and the newly added Double Dip and Ask the Expert. Ten experts provide answers to the mobile game's nearly 1,000 questions. Just like on TV, players must answer before the game clock runs out, and any time remaining on the clock is banked for the million-dollar question.        • Take the hot seat and test your knowledge with nearly 1,000 general knowledge questions. • Four different lifelines:  Phone a Friend, Ask the Audience, and the new Double Dip and Ask the Expert. • The new countdown clock gives you only seconds to come up with the correct answer.","version":"1.0.0","versionNote":"-initial UI review was performed by Tavares Ford.  He brought two issues to our attention:  1 - the in game screen that displays the question categories is not a selection screen.  It is called the money tree, and it is a feature of the TV show which we reflect in the game.  The user is able to see where they are on the money tree and see upcoming preselected question categories.  No actions can be performed except to proceed to the next question by tapping anywhere.  2 - a number of instances where we were asked to implement tap feedback.  Tap feedback is implemented throughout the application, and screenshots showing this were provided to Tavares.  Tavares asked me to note these two issues during the formal application submission and indicated that they would not be a problem. Radhika Sarang was copied on all correspondance with Tavares.  Thank you.","homeURL":"http:\/\/www.capcommobile.com","supportURL":"http:\/\/www.capcommobile.com","custsupportemail":"mobilesupport@capcom.com","custsupportphonenum":"..","copyright":"Game code © 2009 Capcom Interactive, Inc.","licenseURL":"","locale":"en_US","appSize":12105698,"installSize":13013250,"isEncrypted":false,"adultRating":false,"islocationbased":false,"lastModifiedTime":"2009-10-05T21:18:09.000+0000","mediaLink":null,"mediaIcon":null,"attributes":{"provides":{"noApp":false,"dockMode":false,"universalSearch":false,"connectors":[],"services":[],"optimizedUserExperience":false}},"price":4.99,"currency":"USD","isAdvertized":false,"filename":"com.capcom.millionaire_1.0.0_all.ipk","free":false,"touchpad_exclusive":false,"images":{"1":{"thumbnail":"108\/en\/images\/1\/S\/mainmenu.png","screenshot":"108\/en\/images\/1\/L\/mainmenu.png","orientation":"P","device":"P"},"2":{"thumbnail":"108\/en\/images\/2\/S\/correct.png","screenshot":"108\/en\/images\/2\/L\/correct.png","orientation":"P","device":"P"},"3":{"thumbnail":"108\/en\/images\/3\/S\/askaudience.png","screenshot":"108\/en\/images\/3\/L\/askaudience.png","orientation":"P","device":"P"}}}