{"publicApplicationId":"com.netframes.nfivvtrudiestyler","description":"With Trudie Styler’s Weight Loss Yoga Application, you’ll get four workouts to help you learn to use yoga to lose weight naturally. The stresses of daily life can lead to unhealthy habits, including poor nutrition, lack of exercise and inadequate rest. Trudie Styler’s Weight Loss Yoga helps you adopt a more balanced lifestyle to achieve your weight loss goals while creating a healthier body. “Yoga Conditioning for Weight Loss” (18 minutes) helps you to cleanse and strengthen. “Total Body Yoga” (24 minutes) adds extra challenge and builds strength. “Yoga Abs” (15 minutes) improves core strength and posture. “Chair Yoga” (35 minutes) is an easy-to-follow routine for people new to yoga or easing back into practice.\n  \n- 4 workouts to help you drop pounds and inches, quickly and safely\n- Bonus downloadable yoga practice\n- Includes weight loss recipes from Trudie and Sting’s personal chef\n- Trudie Styler interview on weight loss and healthy eating, from her English estate, Lake House\n- 15-minute meditation with Trudie\n- Interview with Dr. Alejandro Junger on his bestselling book, The CLEAN Diet\n\nTrudie Styler is an actress, film producer, director, human rights activist, environmentalist and organic farmer. Trudie’s charitable works for human rights and the environment have been recognized by many award-giving bodies, and through her work she is committed to working to improve the lives of impoverished and exploited children all over the world. In 1990, Trudie and Sting moved to Lake House in the English countryside and, determined to raise their children on a fresh and healthy diet, set about converting the 200 acres of farmland to organic status.\n\nApplication Features:\n- On-the-go video playback. No WIFI required after initial install for watching anywhere.\n- 2 week weight loss plan and recipes.\n- Chapter driven.","version":"2.2.1","versionNote":"","homeURL":"http:\/\/netframes.com","supportURL":"http:\/\/netframes.com","custsupportemail":"","custsupportphonenum":"2127271380","copyright":"Copyright (c) Netframes 2011","licenseURL":"","locale":"en_US","appSize":1362505570,"installSize":1374060544,"isEncrypted":false,"adultRating":false,"islocationbased":false,"lastModifiedTime":"2012-02-02T21:57:22.000+0000","mediaLink":null,"mediaIcon":null,"attributes":{"provides":{"noApp":false,"dockMode":false,"universalSearch":false,"connectors":["null"],"services":[],"optimizedUserExperience":true}},"price":14.99,"currency":"USD","isAdvertized":false,"filename":"com.netframes.nfivvtrudiestyler_2.2.1_all.ipk","free":false,"touchpad_exclusive":true,"images":{"1":{"screenshot":"10863\/2.2.1\/en\/images\/1\/L\/tb_screenshot01.png","thumbnail":"10863\/2.2.1\/en\/images\/1\/S\/tb_screenshot01.png","orientation":"L","device":"T"},"2":{"screenshot":"10863\/2.2.1\/en\/images\/2\/L\/tb_screenshot02.png","thumbnail":"10863\/2.2.1\/en\/images\/2\/S\/tb_screenshot02.png","orientation":"L","device":"T"},"3":{"screenshot":"10863\/2.2.1\/en\/images\/3\/L\/tb_screenshot03.png","thumbnail":"10863\/2.2.1\/en\/images\/3\/S\/tb_screenshot03.png","orientation":"L","device":"T"}}}