{"publicApplicationId":"com.laminar-research.app.xplane-default","description":"X-Plane for is the most powerful, flexible, and realistic flight simulator in the world for desktop and portable personal computers. It is the gold standard for accurate flight simulation, offering realism that is unmatched by any other simulator.  To get the flight-modeling accuracy that leaves all the other simulators behind, X-Plane uses blade element theory to predict the airflow over each bit of the airplane, determining the forces that will act on each bit of the plane, adding them all up, and using that huge amount of information to predict what the plane will do next... about 30 times per second! THIS is how X-Plane has the most powerful and accurate flight model available for personal computers. The flight model is so accurate, in fact, that X-Plane has earned FAA certification for pilots to log flight time towards actual pilot ratings (when used with the appropriate hardware), and is used by many aircraft companies to predict how their next-generation aircraft will fly.  As in the full desktop version, X-Plane for Palm lets you experiment with different times of day, weather, sky conditions, wind, turbulence, weights, aircraft configurations and centers of gravity, all while flying multiple different aircraft though many different scenery locales from the stunning terrain topography of Innsbruck, Austria, (home to some of the most challenging mountains and topography for aviation) to the deserts of the American southwest.  Fly the popular Cessna 172, the sleek Columbia-400, the speedy Piper Malibu, the revolutionary Cirrus VISION very light jet, the stunning and efficient 350-mile-per-hour Piaggio Avantu, the stout and strong King-Air, or the fascinating little Eclipse-500. Fly in various weather and times of day over Austria, Hawaii, Alaska, Desert Sky in the American south-west, San-Francisco, or the hotbed of general aviation in Southern California.","version":"9.5.2","versionNote":"","homeURL":"http:\/\/www.X-Plane.com","supportURL":"http:\/\/www.X-Plane.com","custsupportemail":"info@X-Plane.com","custsupportphonenum":"913.269.0976","copyright":"2010","licenseURL":"","locale":"en_US","appSize":20623330,"installSize":59128775,"isEncrypted":false,"adultRating":false,"islocationbased":false,"lastModifiedTime":"2010-04-06T14:59:08.000+0000","mediaLink":null,"mediaIcon":null,"attributes":{"provides":{"noApp":false,"dockMode":false,"universalSearch":false,"connectors":[],"services":[],"optimizedUserExperience":false}},"price":9.99,"currency":"USD","isAdvertized":false,"filename":"com.laminar-research.app.xplane-default_9.5.2_all.ipk","free":false,"touchpad_exclusive":false,"images":{"1":{"thumbnail":"1096\/en\/images\/1\/S\/IMG_0064.PNG","screenshot":"1096\/en\/images\/1\/L\/IMG_0064.PNG","orientation":"P","device":"P"},"2":{"thumbnail":"1096\/en\/images\/2\/S\/IMG_0065.PNG","screenshot":"1096\/en\/images\/2\/L\/IMG_0065.PNG","orientation":"P","device":"P"},"3":{"thumbnail":"1096\/en\/images\/3\/S\/IMG_0066.PNG","screenshot":"1096\/en\/images\/3\/L\/IMG_0066.PNG","orientation":"P","device":"P"},"4":{"thumbnail":"1096\/en\/images\/4\/S\/IMG_0067.PNG","screenshot":"1096\/en\/images\/4\/L\/IMG_0067.PNG","orientation":"P","device":"P"},"5":{"thumbnail":"1096\/en\/images\/5\/S\/IMG_0001.png","screenshot":"1096\/en\/images\/5\/L\/IMG_0001.png","orientation":"P","device":"P"}}}