{"publicApplicationId":"com.handmark.oawt","description":"Powered by Handmark, this edition of the Oxford American Writer's Thesaurus is more exceptional than ever, solidifying its place as the one thesaurus every writer (or aspiring writer) will want to have. It provides more than 300,000 synonyms and 10,000 antonyms, with copious real-life example sentences and careful selection and ordering of the most relevant synonyms. Additional features include notes on American English usage and word spectrums showing the shades of meaning between polar opposites. \n\nThe text is enhanced with thoughtful mini-essays on favorite words by ten noted contemporary writers--David Auburn, Michael Dirda, David Lehman, Erin McKean, Stephin Merritt, Francine Prose, Zadie Smith, Jean Strouse, David Foster Wallace, and Simon Winchester.\nThe second edition introduces new Word Toolkits, which use an exciting visual display of information to demonstrate the nuances in meaning and use of closely related words. \nThe Oxford American Writer's Thesaurus is truly (surely, certainly, unquestionably) the perfect tool for discriminating writers of all varieties looking for the perfect word.\n\nFeatures:\n+ Instant access to more than 300,000 synonyms and 10,000 antonyms\n+ Brand-new integrated design is accessible, clear, and easy to use.\n+ Offline access, so no wireless connection is necessary.\n+ $ 24.99 represents a 40% discount from the $40 MSRP for the Oxford American Writer’s Thesaurus hardcover version.","version":"1.0.0","homeURL":"http:\/\/www.handmark.com\/support","supportURL":"http:\/\/www.handmark.com\/support","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2011 Handmark, Inc.","licenseURL":"http:\/\/www.handmark.com\/support","locale":null,"appSize":"48519128","installSize":"48519128","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"24.99","currency":"USD","filename":"com.handmark.oawt_1.0.0_all.ipk","free":false,"images":[{"thumbnail":"10979\/icon\/S\/icon_1_0_0.png","screenshot":"10979\/icon\/S\/icon_1_0_0.png","orientation":"P","device":"P"}]}