{"publicApplicationId":"net.workout-tracker.workouttracker-trial","description":"Work Out Tracker is two applications in one!  It offers a combined GPS and stop-watch which allows you to utilize distance and time during your run or bike rides. Work Out Tracker will even notify you after you have completed another mile. It also enables you to keep track of all your exercises, reps, and weights at the gym, all on your Palm Pre device. Bored of the same old exercises, just give your phone a shake to suggest a new exercise. Work Out Tracker allows you to email all of results. All with a 14 Day Trial. New In this Version. In the main menu...           Under Exercise:              Edit Exercises - If you edit a exercise you can now Set up a Starting Weight, Ending Weight by entering in your own information.  Create Exercise - If you select create a exercise you can customize your own exercises by entering in the body area, minor body area, exercise name, instructions, starting and ending weight and the increment weight by.         Under History List of  Stopwatch Data : You can now view  the history of your Stop Watch Data. If you tap on the data you can view your data and email your results again if needed.  If you want to delete one of your stopwatch result, just swipe it to the right and press  delete .   List of Cardio WorkOuts: You can see  the history of  your Cardio WorkOut  information in date order (most recent to oldest). You can also delete any exercise by swiping the exercise to the right and pressing  delete   List of WorkOuts: This will show you  the history of  your workout information in Date order (most recent to oldest).   Here you also have an option of deleting any of your data by swiping the exercise to the right and pressing delete.  List of Stopwatch data:  Once you click\/view a selected exercise, click the GPX Data and send it to your e-mail.  You can then cut and paste  the GPX data into a file and load it into any website like Mapmyrun.com.  ","version":"0.6.3","versionNote":"","homeURL":"http:\/\/www.workout-tracker.net","supportURL":"http:\/\/m.workout-tracker.net","custsupportemail":"support@workout-tracker.net","custsupportphonenum":"..","copyright":"copyright  2009 OSG","licenseURL":"","locale":"en_US","appSize":1044168,"installSize":12635590,"isEncrypted":false,"adultRating":false,"islocationbased":true,"lastModifiedTime":"2010-07-07T23:21:20.000+0000","mediaLink":null,"mediaIcon":null,"attributes":{"provides":{"noApp":false,"dockMode":false,"universalSearch":false,"connectors":[],"services":[],"optimizedUserExperience":false}},"price":0,"currency":"USD","isAdvertized":false,"filename":"net.workout-tracker.workouttracker-trial_0.6.3_all.ipk","free":false,"touchpad_exclusive":false,"images":{"1":{"thumbnail":"117\/en\/images\/1\/S\/workouttrackerTrial_MainMenu.png","screenshot":"117\/en\/images\/1\/L\/workouttrackerTrial_MainMenu.png","orientation":"P","device":"P"},"2":{"thumbnail":"117\/en\/images\/2\/S\/workouttrackerTrial_StopWatch.png","screenshot":"117\/en\/images\/2\/L\/workouttrackerTrial_StopWatch.png","orientation":"P","device":"P"},"3":{"thumbnail":"117\/en\/images\/3\/S\/workouttrackerTrial_TrackWorkOut.png","screenshot":"117\/en\/images\/3\/L\/workouttrackerTrial_TrackWorkOut.png","orientation":"P","device":"P"},"4":{"thumbnail":"117\/en\/images\/4\/S\/workouttrackerTrial_CheckResults.png","screenshot":"117\/en\/images\/4\/L\/workouttrackerTrial_CheckResults.png","orientation":"P","device":"P"},"5":{"thumbnail":"117\/en\/images\/5\/S\/workouttracker_addexercise.jpg","screenshot":"117\/en\/images\/5\/L\/workouttracker_addexercise.jpg","orientation":"P","device":"P"}}}