{"publicApplicationId":"com.dijit.jonathanpeters","description":"Jonathan Peters is a world renowned DJ who has a very distinct and unique musical style. He built up his career as a DJ at many well known clubs in New York City, but it was his 7 year run at the legendary Sound Factory that made him a staple in the New York City nightlife. He draws in thousands of fans every time he’s spinning in the DJ booth, which shows that he is a key player in the music industry.  DJ Jonathan Peters has also gained the attention of famous music artists including Janet Jackson, Mary J. Blige, Ricky Martin, Brian McKnight, and Paula Cole, who have all requested remixes of their hit songs. Several of these hit remixed songs made the number one spot on the Billboard Charts. Jonathan Peters is constantly telling a new story through his music by creating new sounds, lyrics, and beats, setting him apart from other DJs. He is truly dedicated to his music and puts his heart and soul into every project that he is a part of.  WHY THIS APP IS HOT:  This app is filled with many ways to keep up with your favorite DJ Jonathan Peters:  • Set images of Jonathan Peters as your wallpaper. • Watch videos of Jonathan Peters spinning fresh beats at some of the hottest parties around. • Keep track of what’s up with Jonathan Peters by clicking on his Twitter link.","version":"3.1.5","versionNote":"","homeURL":"http:\/\/www.dijit.com","supportURL":"http:\/\/www.dijit.com\/contact-dijit.aspx","custsupportemail":"support@dijit.com","custsupportphonenum":"877.547.2711","copyright":"copyright 2010 Dijit","licenseURL":"","locale":"en_US","appSize":1698872,"installSize":5107329,"isEncrypted":false,"adultRating":false,"islocationbased":false,"lastModifiedTime":"2010-01-20T16:14:37.000+0000","mediaLink":null,"mediaIcon":null,"attributes":{"provides":{"noApp":false,"dockMode":false,"universalSearch":false,"connectors":[],"services":[],"optimizedUserExperience":false}},"price":0.99,"currency":"USD","isAdvertized":false,"filename":"com.dijit.jonathanpeters_3.1.5_all.ipk","free":false,"touchpad_exclusive":false,"images":{"1":{"thumbnail":"1291\/en\/images\/1\/S\/jonathan1.png","screenshot":"1291\/en\/images\/1\/L\/jonathan1.png","orientation":"P","device":"P"},"2":{"thumbnail":"1291\/en\/images\/2\/S\/jonathan2.png","screenshot":"1291\/en\/images\/2\/L\/jonathan2.png","orientation":"P","device":"P"},"3":{"thumbnail":"1291\/en\/images\/3\/S\/jonathan3.png","screenshot":"1291\/en\/images\/3\/L\/jonathan3.png","orientation":"P","device":"P"}}}