{"publicApplicationId":"com.jackpot.whereimatnow","description":"Tap GO!! Tap Send, that’s all it takes to text or e-mail someone your GPS location and a MAP. Where I’m At Now is the easiest way to tell someone WHERE you are! Great for sending the address and map of where you are to a loved one, friend, or business associate. Now Re-Engineered to periodically track GPS and display results, also monitors Network and WiFi connectivity. With just one tap, see if you’re getting location data using a true GPS Satellite Fix or Cellular Triangulation (AGPS). Simply tap small Satellite icon on the header, wait, and try again, untill you lock a GPS fix. Lat, Lon and status change color depending on the accuracy. Even easily TWEET your location! Just register your phone on Twitter, create a new contact, use the Twitter Short Code for the phone number, (e.g. 40404 in U.S.) or check here: http:\/\/help.twitter.com\/forums\/59008\/entries\/14226, then set that as your favorite contact. Tap \"Go!!\" for a location fix, you’ll get a Latitude (Lat) and Longitude (Lon) a street address and horizontal accuracy in meters. Tap \"Map It\" to see your location with the Google Maps app. \"TAP TO SEND LOCATION\" via E-Mail, TEXT, or IM, to your Favorite Contact, (Automatic pre-populate the recipient field for each message). A map link is automatically included in the message for any computer, phone, etc, that can view Google \/ Bing maps online. The TEXT \/ IM link is Google Maps, E-mail will have links to Google and Bing maps. The recipient can simply click on the map link and see the map of where you are. Check the Diagnostics page if you see any “error”, Optimal Settings, in “SETTINGS” for GPS configurations. Completely editable, automatically saved, “Intro Text”, which pre-fixes the location message with whatever you like, “ON” by default and each message begins with “Here’s where I am now:” Check the FAQ page in HELP for detailed instructions. Don’t hesitate to E-Mail us regarding any questions, comments, or suggestions.","version":"1.0.6","versionNote":"","homeURL":"http:\/\/jackpotideas.com","supportURL":"http:\/\/jackpotideas.com","custsupportemail":"support@jackpotideas.com","custsupportphonenum":"","copyright":"Copyright 2011 J@ckpot ideas Inc.","licenseURL":"","locale":"en_US","appSize":473992,"installSize":2457600,"isEncrypted":false,"adultRating":false,"islocationbased":true,"lastModifiedTime":"2012-06-01T13:06:21.000+0000","mediaLink":null,"mediaIcon":null,"attributes":{"provides":{"noApp":false,"dockMode":false,"universalSearch":false,"connectors":["null"],"services":[],"optimizedUserExperience":false}},"price":1.5,"currency":"USD","isAdvertized":false,"filename":"com.jackpot.whereimatnow_1.0.6_all.ipk","free":false,"touchpad_exclusive":false,"images":{"1":{"screenshot":"1292\/1.0.6\/en\/images\/1\/L\/WIAN-Main_2011-04-01.png","thumbnail":"1292\/1.0.6\/en\/images\/1\/L\/WIAN-Main_2011-04-01.png","orientation":"P","device":"P"},"2":{"screenshot":"1292\/1.0.6\/en\/images\/2\/L\/WIAN-email_2011-04-01.png","thumbnail":"1292\/1.0.6\/en\/images\/2\/L\/WIAN-email_2011-04-01.png","orientation":"P","device":"P"},"3":{"screenshot":"1292\/1.0.6\/en\/images\/3\/L\/WIAN-maps_2011-04-01.png","thumbnail":"1292\/1.0.6\/en\/images\/3\/L\/WIAN-maps_2011-04-01.png","orientation":"P","device":"P"},"4":{"screenshot":"1292\/1.0.6\/en\/images\/4\/L\/WIAN-DrawerOpen_2011-04-01.png","thumbnail":"1292\/1.0.6\/en\/images\/4\/L\/WIAN-DrawerOpen_2011-04-01.png","orientation":"P","device":"P"},"5":{"screenshot":"1292\/1.0.6\/en\/images\/5\/L\/WIAN-GPSChecker1_2011-04-01.png","thumbnail":"1292\/1.0.6\/en\/images\/5\/L\/WIAN-GPSChecker1_2011-04-01.png","orientation":"P","device":"P"}}}