{"publicApplicationId":"com.howitdo.webos.doloanloan","description":"***Update: You can now click the \"DWN PAYMENT\" label to change the downpayment value from ($) dollars to (%) percent.***  DO DO DO! your loan calculations with DO Loan Loan. Buying a house? Or a car? Or are you just applying for a home equity loan? No matter the loan you can use DO Loan Loan to DO your loan calculations. DO Loan Loan is a basic loan calculator that will show you how much a loan will cost you per month, per year, and for the life of the loan. It's quick, it's easy, and it works!!! Click Accrue to show a summary of what it'll cost you. Click Amortize to see an amortization table for the entire life of the loan. Click the compose button on the bottom of the Accrue or Amortize screens to send a summary of the calculation via e-mail. WHAT'S NEW!:  1) All textfields default to NumLock on!!! No more pushing the orange button!!!  2) Selecting a textfield will automatically highlight the value for easy deletion.  3) You can now determine how much you can afford by entering a monthly PAYMENT, INTEREST, and TERM on the Calculate screen.  4) Added down payment, \"extra monthly\" payments, and \"extra yearly\" payment fields to the new DO MORE section on the Calculate screen.  7) E-mails have also been updated and are now formatted for easier viewing on your phone.  8) Added Payoff year\/mos. to the Accrue screen.  9) Added the sums of yearly principal and interest payments for each year to the Amortize screen.  10) Fixed 1st year interest bug on the Accrue screen. Shout outs (Thanks) go out to everyone who made suggestions. Thanks! ","version":"0.2.1","versionNote":"","homeURL":"http:\/\/www.howitdo.com","supportURL":"http:\/\/www.howitdo.com","custsupportemail":"thatshowitdo@gmail.com","custsupportphonenum":"..","copyright":"Copyright 2010 Newbyan Corporation.","licenseURL":"","locale":"en_US","appSize":24474,"installSize":1752881,"isEncrypted":false,"adultRating":false,"islocationbased":false,"lastModifiedTime":"2010-03-08T08:47:42.000+0000","mediaLink":null,"mediaIcon":null,"attributes":{"provides":{"noApp":false,"dockMode":false,"universalSearch":false,"connectors":[],"services":[],"optimizedUserExperience":false}},"price":0.99,"currency":"USD","isAdvertized":false,"filename":"com.howitdo.webos.doloanloan_0.2.1_all.ipk","free":false,"touchpad_exclusive":false,"images":{"1":{"thumbnail":"1330\/en\/images\/1\/S\/snap1.png","screenshot":"1330\/en\/images\/1\/L\/snap1.png","orientation":"P","device":"P"},"2":{"thumbnail":"1330\/en\/images\/2\/S\/snap2.png","screenshot":"1330\/en\/images\/2\/L\/snap2.png","orientation":"P","device":"P"},"3":{"thumbnail":"1330\/en\/images\/3\/S\/snap3.png","screenshot":"1330\/en\/images\/3\/L\/snap3.png","orientation":"P","device":"P"},"4":{"thumbnail":"1330\/en\/images\/4\/S\/snap4.png","screenshot":"1330\/en\/images\/4\/L\/snap4.png","orientation":"P","device":"P"}}}