{"publicApplicationId":"com.gameloft.app.asphalt5free","description":"Try the free version of Asphalt 5 and race with the fastest dream cars ever created by some of the most prestigious manufacturers in the world.  Everything you’ve ever dreamed of doing behind the wheel is here! Stop dreaming and get in!  Features of the full version:  THERE’S A DREAM CAR FOR YOU Take a ride in over 30 of the fastest, most prestigious cars you’ve ever dreamed of, from manufacturers like Ferrari, Lamborghini, Audi and Ducati.  THE WORLD IS YOUR RACETRACK Highly polished HD graphics let you see every detail and animation of the track as you speed over snow, mud, dirt and more in 12 beautiful locations around the world including St. Tropez, Aspen and Las Vegas. Discover hidden shortcuts and jump off ramps!  NEW WAYS TO PLAY Challenge yourself to 8 different racing events including Drift Contest, Cop Chase, Time Attack, Duel Mode, Last Man Standing and Escape.  Full list of cars: Audi R8, Audi TT-RS, Audi Q7, Lamborghini Gallardo LP 560-4, Lamborghini Murciélago LP 670-4 SV, Lamborghini Reventón, Ferrari 599 XX, Ferrari California, Ferrari F430 16M, Ferrari FXX Evolution, Nissan 370Z, Nissan GT-R R35, Bugatti Veyron 16.4, BMW X6M, Caterham CSR Superlight, 2009 Chevrolet Corvette ZR1, 2010 Chevrolet Camaro SS, Ducati 1198, Ducati Monster 1100s, Ford GT, Ford Shelby GT500, Gumpert Apollo, Kawasaki Z750, Kawasaki ZX6-R, Lotus 2-Eleven, Lotus Evora, Mercedes E Class, Mercedes ML 63 AMG, Mercedes-Benz S65 Black Series, MINI Cooper S, RUF 3400 K, RUF Dakara, RUF Rt 12  For fans of arcade racing games. Become a fan of Gameloft on Facebook: gameloft.com\/facebook Follow the official Twitter account: @asphaltracing","version":"1.0.8","versionNote":"","homeURL":"http:\/\/www.gameloft.com","supportURL":"http:\/\/www.gameloft.com\/support.php","custsupportemail":"support@gameloft.com","custsupportphonenum":"..","copyright":"© 2009 Gameloft. All Rights Reserved.","licenseURL":"","locale":"en_US","appSize":33952594,"installSize":68064630,"isEncrypted":false,"adultRating":false,"islocationbased":false,"lastModifiedTime":"2010-01-28T00:18:57.000+0000","mediaLink":null,"mediaIcon":null,"attributes":{"provides":{"noApp":false,"dockMode":false,"universalSearch":false,"connectors":[],"services":[],"optimizedUserExperience":false}},"price":0,"currency":"USD","isAdvertized":false,"filename":"com.gameloft.app.asphalt5free_1.0.8_all.ipk","free":false,"touchpad_exclusive":false,"images":{"1":{"thumbnail":"1405\/en\/images\/1\/S\/A5_1.png","screenshot":"1405\/en\/images\/1\/L\/A5_1.png","orientation":"P","device":"P"},"2":{"thumbnail":"1405\/en\/images\/2\/S\/A5_2.png","screenshot":"1405\/en\/images\/2\/L\/A5_2.png","orientation":"P","device":"P"},"3":{"thumbnail":"1405\/en\/images\/3\/S\/A5_3.png","screenshot":"1405\/en\/images\/3\/L\/A5_3.png","orientation":"P","device":"P"},"4":{"thumbnail":"1405\/en\/images\/4\/S\/A5_5.png","screenshot":"1405\/en\/images\/4\/L\/A5_5.png","orientation":"P","device":"P"}}}