{"publicApplicationId":"com.laminar-research.app.giant-robots","description":"THIS is the virtual-reality combat sim that turns the Palm Pre into a mini game-station of pretty significant power!  Much like X-Plane, Giant Fighting Robots is fairly complex, with pretty accurate physics... but being in a Giant Fighting Robot with Guided Machine Guns, Lightning-Guns, Gatling Lasers, and a dozen or so other weapons, trying to defend yourselves against artificially-intelligent, heavily-armed alien fighter and bomber spider-bots on a dozen foreign worlds... well, the action gets quite a bit more intense.  You will start off in the Genesis-Class ATAW (All Terrain Attack Walker), which is nothing more than a modified cargo-walker with a few modified aircraft air-to-ground guns mounted on the top. It is a pretty silly defense against the alien attack, but it is all humanity can throw together on short notice. As you defeat the alien invaders at progressively harder levels, the Human Cascade will have time to develop increasingly powerful ATAWs and weapon systems, making each of your future combat engagements more complex and violent as you move into faster moving ATAWs like the Huron, or heavier ones like the Galaxy or Titanic, and move into command of really frightening weapons systems like the Flame-Thrower, High-Capacitance Laser, Ion Cannon, or Guided Torpedo. We believe this is the most immersive, intense combat simulation for the iPhone... can you handle it? Can you WIN it? We can.. but it isn't easy!  NOTE: As well as fighting against the artificially-intelligent aliens, you can play in multi-player death-matches against your friends, choosing your ATAW weapons, reactors, batteries, armor, engines, and jet-durations to maximize the lethality of your attack... and here is where the fun just gets so amazing it is about impossible to put your phone down!","version":"9.5.0","homeURL":"http:\/\/www.x-plane.com","supportURL":"http:\/\/www.x-plane.com","custsupportemail":"","custsupportphonenum":"","copyright":"2010, Laminar Research","licenseURL":"http:\/\/www.x-plane.com","locale":null,"appSize":"99586442","installSize":"99586442","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"4.83","currency":"USD","filename":"com.laminar-research.app.giant-robots_9.5.0_all.ipk","free":false,"images":[{"thumbnail":"1406\/images\/1\/L\/1.jpg","screenshot":"1406\/images\/1\/L\/1.jpg","orientation":"P","device":"P"},{"thumbnail":"1406\/images\/2\/L\/2.jpg","screenshot":"1406\/images\/2\/L\/2.jpg","orientation":"P","device":"P"},{"thumbnail":"1406\/images\/3\/L\/3.jpg","screenshot":"1406\/images\/3\/L\/3.jpg","orientation":"P","device":"P"},{"thumbnail":"1406\/images\/4\/L\/4.jpg","screenshot":"1406\/images\/4\/L\/4.jpg","orientation":"P","device":"P"},{"thumbnail":"1406\/images\/5\/L\/5.jpg","screenshot":"1406\/images\/5\/L\/5.jpg","orientation":"P","device":"P"}]}