{"publicApplicationId":"com.nacgeo.nacwatch","description":"NAC Watch is a space watch to tell the exact location in the most efficient Universal Address similar to a time watch to tell the exact time. It also allows users to use the Universal Address to get the map of any location in the world on Google Maps to overcome problems such as:  •\tMany countries such as Dubai, India, Japan and Mongolia don't have good street addresses, which makes you extremely difficult to find locations.  •\tMany countries\/areas such as Taiwan don't have standard street addresses in English, which makes most maps fail to find locations represented by English street addresses.  •\tMore than 99% of locations such as accidents in the world don't have street addresses, which makes people difficult to tell these locations accurately.  •\tStreet addresses are also full of variations, often duplicated in multiple locations, frequently changed and often missed in databases, which makes many maps either fail to find or find wrong locations.  •\tEven street addresses are available, they are always very long and not efficient to input.  All these seriously restrict the uses of map applications. The advantages of using Universal Addresses instead of street addresses to specify locations are:  •\tUniversal Addresses are highly efficient, 80% shorter than a typical street address.  •\tAll houses and buildings in the world have their unique Universal Addresses.  •\tUniversal Addresses are language independent.  •\tNot only houses and buildings but also all other locations in the world have their unique Universal Addresses.  •\tUniversal Addresses are standard and permanent. They never change and don't rely on any databases. With the Universal Address obtained from NAC Watch, travellers can tell where they are, police officers can record the location of an accident or a wrongly parked car, local citizens can report a road pothole or a broken street light, and journalists can insert the exact location of an event into their story, etc.","version":"1.0.0","versionNote":"","homeURL":"http:\/\/www.nacgeo.com","supportURL":"http:\/\/www.nacgeo.com\/nacwatch.asp","custsupportemail":"support@nacgeo.com","custsupportphonenum":"..","copyright":"copyright","licenseURL":"","locale":"en_US","appSize":52714,"installSize":7192871,"isEncrypted":false,"adultRating":false,"islocationbased":true,"lastModifiedTime":"2010-02-18T13:28:52.000+0000","mediaLink":null,"mediaIcon":null,"attributes":{"provides":{"noApp":false,"dockMode":false,"universalSearch":false,"connectors":[],"services":[],"optimizedUserExperience":false}},"price":3,"currency":"USD","isAdvertized":false,"filename":"com.nacgeo.nacwatch_1.0.0_all.ipk","free":false,"touchpad_exclusive":false,"images":{"1":{"thumbnail":"1408\/en\/images\/1\/S\/nacwatchscreen1.jpg","screenshot":"1408\/en\/images\/1\/L\/nacwatchscreen1.jpg","orientation":"P","device":"P"},"2":{"thumbnail":"1408\/en\/images\/2\/S\/nacwatchscreen2.jpg","screenshot":"1408\/en\/images\/2\/L\/nacwatchscreen2.jpg","orientation":"P","device":"P"},"3":{"thumbnail":"1408\/en\/images\/3\/S\/nacwatchscreen3.jpg","screenshot":"1408\/en\/images\/3\/L\/nacwatchscreen3.jpg","orientation":"P","device":"P"}}}