{"publicApplicationId":"com.laminar-research.app.xplane-apollo","description":"This is X-Plane APOLLO, a realistic simulation of the lunar landing and docking operations of the Apollo-11 mission!  This is the most complete realistic simulation of a lunar landing that we have seen for any mobile device, and gives you a wide range of missions to try! Start off docked with the command module in a lunar orbit, and then separate from the command module to start your way down to the lunar surface. Once that is done, you can do the full de-orbit burn and orbital transfer from lunar orbit down to the touch-down phase of flight, all in REAL TIME with the actual weight, thrust, fuel capacity, and fuel burn of the REAL Apollo 11 lander.  Once you have done the de-orbit burn and orbit transfer, you enter the most challenging phase of flight: The POWERED DESCENT. During this phase of the mission, you must keep you TAIL pointed in the direction of flight, running FULL THRUST, to slow the craft from orbital speed to a standstill. This phase of flight, the 'Powered deceleration' is actually where you spend most of your time.  Once done with THAT, you enter the part of the simulation that you expect: The vertical descent and landing. This is all with actual performance of the REAL lander, right down to the radio callouts made by mission control as Neil and Buzz worked their way down in 1969.  Once you have aced the landing, you can rove around on the moon in the rover! This is a REALISTIC simulation of the 4-wheel drive, surprisingly speedy rover they used in reality, which is really fun to drive off, off, off, off, OFF-road in one-sixth gravity!  Once you have run the farthest off-road simulator ever written, you can do the launch of the lander back up towards the Command Module (waiting in orbit) and then dock the Lander with the Command Module!  This is a pretty complete, and accurate, simulation of the lunar phase of the Apollo 11 mission, available now for your Palm... really pretty stunning!","version":"9.5.0","versionNote":"","homeURL":"http:\/\/www.X-Plane.com","supportURL":"http:\/\/www.X-Plane.com","custsupportemail":"info@X-Plane.com","custsupportphonenum":"913.269.0976","copyright":"copyright 2010, Laminar Research","licenseURL":"","locale":"en_US","appSize":10115404,"installSize":19873860,"isEncrypted":false,"adultRating":false,"islocationbased":false,"lastModifiedTime":"2010-01-28T00:24:14.000+0000","mediaLink":null,"mediaIcon":null,"attributes":{"provides":{"noApp":false,"dockMode":false,"universalSearch":false,"connectors":[],"services":[],"optimizedUserExperience":false}},"price":4.99,"currency":"USD","isAdvertized":false,"filename":"com.laminar-research.app.xplane-apollo_9.5.0_all.ipk","free":false,"touchpad_exclusive":false,"images":{"1":{"thumbnail":"1414\/en\/images\/1\/S\/1.jpg","screenshot":"1414\/en\/images\/1\/L\/1.jpg","orientation":"P","device":"P"},"2":{"thumbnail":"1414\/en\/images\/2\/S\/2.jpg","screenshot":"1414\/en\/images\/2\/L\/2.jpg","orientation":"P","device":"P"},"3":{"thumbnail":"1414\/en\/images\/3\/S\/3.jpg","screenshot":"1414\/en\/images\/3\/L\/3.jpg","orientation":"P","device":"P"},"4":{"thumbnail":"1414\/en\/images\/4\/S\/4.jpg","screenshot":"1414\/en\/images\/4\/L\/4.jpg","orientation":"P","device":"P"},"5":{"thumbnail":"1414\/en\/images\/5\/S\/5.jpg","screenshot":"1414\/en\/images\/5\/L\/5.jpg","orientation":"P","device":"P"}}}