{"publicApplicationId":"com.laminar-research.app.xplane-carrier","description":"This app is the most realistic aerial combat simulation for any mobile device (by far), and is the most realist carrier-ops simulation for any mobile device as well.  Your ultimate goal is to take off from the carrier, destroy your adversary in the air without being shot down yourself, and return to the carrier for landing. You will receive a score based on your performance. How high how can you score? We have never managed to exceed a 90% here.  Catapults, guns, guided missiles, and arresting gear are all realistically simulated (more realistically than any other any mobile device app by far), giving you the ultimate aviation challenges of aircraft carrier operations and aerial combat in one simulation.   You will have access to the World-War-2 F4U Corsair, a screaming 350+ mph fighter packing two THOUSAND horsepower. This goes against the nimble Japanese A6M 'Zero'... a much slower and less powerful, but much MORE MANEUVERABLE, adversary.  You can also try the mighty F-4 Phantom, with over thirty-two THOUSAND pounds of thrust, and four air-to-air guided missiles, and guns if those fail. This bird flies against the surprisingly fast and agile Mig-21 Fishbed, which puts up an amazing fight with it's light weight and tight turns.  After winning the aerial engagement, of course, the battle is only half-won... you still have to put the plane on the carrier. Google 'carrier landings' to learn how... what you see there does apply to this simulation... all of the X-Plane simulations are realistic enough that you can just research how to fly the REAL planes, and use that research to see how to fly X-Plane.  Ready to try it?","version":"9.5.2","versionNote":"","homeURL":"http:\/\/www.X-Plane.com","supportURL":"http:\/\/www.X-Plane.com","custsupportemail":"info@X-Plane.com","custsupportphonenum":"913.269.0976","copyright":"copyright 2010, Laminar Research","licenseURL":"","locale":"en_US","appSize":11920228,"installSize":45429993,"isEncrypted":false,"adultRating":false,"islocationbased":false,"lastModifiedTime":"2010-03-30T12:52:15.000+0000","mediaLink":null,"mediaIcon":null,"attributes":{"provides":{"noApp":false,"dockMode":false,"universalSearch":false,"connectors":[],"services":[],"optimizedUserExperience":false}},"price":9.99,"currency":"USD","isAdvertized":false,"filename":"com.laminar-research.app.xplane-carrier_9.5.2_all.ipk","free":false,"touchpad_exclusive":false,"images":{"1":{"thumbnail":"1415\/en\/images\/1\/S\/1.jpg","screenshot":"1415\/en\/images\/1\/L\/1.jpg","orientation":"P","device":"P"},"2":{"thumbnail":"1415\/en\/images\/2\/S\/2.jpg","screenshot":"1415\/en\/images\/2\/L\/2.jpg","orientation":"P","device":"P"},"3":{"thumbnail":"1415\/en\/images\/3\/S\/3.jpg","screenshot":"1415\/en\/images\/3\/L\/3.jpg","orientation":"P","device":"P"},"4":{"thumbnail":"1415\/en\/images\/4\/S\/4.jpg","screenshot":"1415\/en\/images\/4\/L\/4.jpg","orientation":"P","device":"P"},"5":{"thumbnail":"1415\/en\/images\/5\/S\/5.jpg","screenshot":"1415\/en\/images\/5\/L\/5.jpg","orientation":"P","device":"P"}}}