{"publicApplicationId":"com.shanerooni.phakephoney","description":"PLEASE update your rating to be in-line with the app updates. It will be greatly appreciated! Updated v1.2: now choose music from your collection to be played! Also, hit the \"FOLLOW\" button and follow me on Twitter for app updates or to test upcoming apps! This is an app for your small children (and LOCKS THE APP)! Need an extra few minutes to get out the door? This fake phone app may be perfect for keeping your child's attention for those few crucial minutes. This small app is loaded with features! Each number pressed will speak and spell the number. The music button will play 1 of 10 music songs (Over the Rainbow, Alphabet Song, Shoofly, Hush Baby, Little Lamb, The Muffin Man, Clap Hands, BINGO, Farmer in the Dell, and Small World!) or songs from your collection. The talk button will play 1 of 4 greetings. For options, you are able to set the app to either go straight to the dialer, or to the menu on startup. You can LOCK THE APP, which should keep MOST children from leaving the app. You also can set up \"Caller ID\" images that show up full screen. For each number (0-9), you can set a picture from your device.  When your child, for instance, presses 1 then 'Talk', a picture of Daddy will show up. Pressing 2 then 'Talk' will show a picture of Mommy, etc. This will be a nice feature for your children to learn family members and friends, or maybe even the family pet! You get a generic voice for $0.99. Shanerooni, LLC has the ability to customize this app with YOUR voice! Then your child will be learning from you, and receiving special messages from you! This option comes at an additional charge, and details are under 'Instructions' within the app. You may record Daddy's voice, Mommy's, Grandma's or a combination of voices! ***NOTE: type 'menu' to get to the menu if you have the app locked!*** Later updates may include option to shake the phone for a new song, option for dial tones, option for just saying the number instead of saying and spelling it.","version":"1.2.0","versionNote":"","homeURL":"http:\/\/www.shanerooni.com","supportURL":"http:\/\/www.shanerooni.com","custsupportemail":"admin@shanerooni.com","custsupportphonenum":"484.654.2668","copyright":"Copyright 2010 Shanerooni, LLC","licenseURL":"","locale":"en_US","appSize":9358016,"installSize":19188284,"isEncrypted":false,"adultRating":false,"islocationbased":false,"lastModifiedTime":"2012-06-01T01:47:01.000+0000","mediaLink":null,"mediaIcon":null,"attributes":{"provides":{"noApp":false,"dockMode":false,"universalSearch":false,"connectors":["null"],"services":[],"optimizedUserExperience":false}},"price":0.99,"currency":"USD","isAdvertized":false,"filename":"com.shanerooni.phakephoney_1.2.0_all.ipk","free":false,"touchpad_exclusive":false,"images":{"1":{"screenshot":"1444\/1.2.0\/en\/images\/1\/L\/phakephoney_2010-01-04_071419.png","thumbnail":"1444\/1.2.0\/en\/images\/1\/L\/phakephoney_2010-01-04_071419.png","orientation":"P","device":"P"},"2":{"screenshot":"1444\/1.2.0\/en\/images\/2\/L\/phakephoney_2010-01-04_072505.png","thumbnail":"1444\/1.2.0\/en\/images\/2\/L\/phakephoney_2010-01-04_072505.png","orientation":"P","device":"P"},"3":{"screenshot":"1444\/1.2.0\/en\/images\/3\/L\/phakephoney_2010-01-04_071401.png","thumbnail":"1444\/1.2.0\/en\/images\/3\/L\/phakephoney_2010-01-04_071401.png","orientation":"P","device":"P"}}}