{"publicApplicationId":"com.puggleware.news","description":"Enjoy our top-rated & easy-to-use News app that more than 43,000 others have downloaded!\nTONS of news feeds and websites to choose from! (see partial list below)\n\nKeep up with the latest headlines, sports, business, celebrity gossip, tech\/science news, arts, fashion, jokes, comics and more from your favorite sources!\nFound something you want to share? Tap to email, text\/sms, post it to Facebook or Myspace!\n\nChoose from a list of nearly 400 suggested U.S. news sources, plus Canadian news, UK news, and news in Spanish.\n\nAdd your own feeds or recommend new sources for us to add to the App.\nSelect your own colors, like a dark background for easy night reading!\n\n** New in this version: Fixes to the auto-update feature and readability enhancements!\n\nCheck out the paid version in the Catalog for an ad-free experience! \n\nHere's a partial list of the included feeds:\nCNN, USA Today, MSNBC, Wall Street Journal, Washington Post, Fox News, Chicago Tribune, New York Times, Los Angeles Times, Boston Herald, Las Vegas Review-Journal, Denver Post, Baltimore Sun, National Public Radio, BBC News, Reuters, Business Wire, Google News, Yahoo Top Stories, Oprah Winfrey Show, TMZ, People Magazine, Entertainment Tonight, US Magazine, National Enquirer, Dilbert, The Onion, Comedy Central Joke of the Day, Jokes 4 All, Fox Sports, CBS Sports, ESPN Top Headlines, ESPN NFL, ESPN NBA, ESPN MLB, ESPN NHL, ESPN Soccer, ESPNU, ESPN College Basketball, ESPN College Football, Slashdot, Engadget, Gizmodo, Digg, Ars Technica, Yahoo Technology Stories, Daily Dish, Nick Carr, Huffington Post, CNN Top Stories, CNN World, CNN U.S., CNN Sports, CNNMoney.com, CNN Politics, CNN Crime, CNN Science & Space, CNN Health, CNN Entertainment, CNN Travel, CNN Living, CNBC, Glamour","version":"2.5.0","versionNote":"","homeURL":"http:\/\/sites.google.com\/site\/puggleware","supportURL":"http:\/\/sites.google.com\/site\/puggleware","custsupportemail":"puggleware@yahoo.com","custsupportphonenum":"","copyright":"copyright 2010 puggleware","licenseURL":"","locale":"en_US","appSize":142092,"installSize":2916352,"isEncrypted":false,"adultRating":false,"islocationbased":false,"lastModifiedTime":"2010-12-29T03:49:14.000+0000","mediaLink":null,"mediaIcon":null,"attributes":{"provides":{"noApp":false,"dockMode":false,"universalSearch":false,"connectors":[],"services":[],"optimizedUserExperience":false}},"price":0,"currency":"USD","isAdvertized":false,"filename":"com.puggleware.news_2.5.0_all.ipk","free":false,"touchpad_exclusive":false,"images":{"1":{"thumbnail":"1525\/en\/images\/1\/S\/Screenshot2e.png","screenshot":"1525\/en\/images\/1\/L\/Screenshot2e.png","orientation":"P","device":"P"},"2":{"thumbnail":"1525\/en\/images\/2\/S\/Screenshot1e.png","screenshot":"1525\/en\/images\/2\/L\/Screenshot1e.png","orientation":"P","device":"P"},"3":{"thumbnail":"1525\/en\/images\/3\/S\/Screenshot3d.png","screenshot":"1525\/en\/images\/3\/L\/Screenshot3d.png","orientation":"P","device":"P"}}}