{"publicApplicationId":"com.ttpsoft.tallyhoo","description":"Ever have the need to keep track of something?  Maybe it's the number of people getting on a bus or attending a party you're throwing.  Maybe it's something less tangible like the number of times you think about chocolate or someone says \"Ummm\" in a speech.  Whatever the need, TallyHoo is the fully featured tool for you.  It let's you easily & quickly count items of your choosing by pressing a really large plus button.  Each time you press this button it adds to the count & provides a little haptic feedback (in other words, the device vibrates).  This comes in handy when you need to focus on what's going on around you while you're keeping count.  It also allows you to reset the count & start over or save the results of a counting session in your Tally Log.  Your Tally Log is where you can keep a historical record of things you've counted.  Once you've decided to save a particular session, you can go into your Tally Log to do a few things with it.  You can delete it, email it, restart that counting session or share it with the TallyHoo Community.  This is where it gets interesting.  You can anonymously share your counts or just view the interesting counts that others have shared.  Then you'll frequently find yourself thinking \"I never thought to count that before\"!  TallyHoo also includes a \"minus\" button for those occasions when you need to subtract from the count.  To make this feature most useful, you can choose which side of the screen it appears on.  So if you're using your right thumb to add to the count, you can choose to place the \"Minus\" button on the left side of the screen so the base of your right thumb doesn't accidentally activate it.  You can also set what number your count should begin on and what number you should count by.  That way you can count by 5, 14, 50, 1000 or whatever works for you.  If you decide to give TallyHoo a try, please give us your feedback & consider adding a rating, so that others will know if you found this app useful.  Thanks!","version":"1.0.0","versionNote":"","homeURL":"http:\/\/www.ttpsoft.com","supportURL":"http:\/\/www.ttpsoft.com\/tallyhoo","custsupportemail":"support@ttpsoft.com","custsupportphonenum":"..","copyright":"Copyright 2010 TTPSoft, LLC","licenseURL":"","locale":"en_US","appSize":118988,"installSize":2886138,"isEncrypted":false,"adultRating":false,"islocationbased":false,"lastModifiedTime":"2010-02-08T12:04:03.000+0000","mediaLink":null,"mediaIcon":null,"attributes":{"provides":{"noApp":false,"dockMode":false,"universalSearch":false,"connectors":[],"services":[],"optimizedUserExperience":false}},"price":1.99,"currency":"USD","isAdvertized":false,"filename":"com.ttpsoft.tallyhoo_1.0.0_all.ipk","free":false,"touchpad_exclusive":false,"images":{"1":{"thumbnail":"1610\/en\/images\/1\/S\/tallyhoo_2010-03-02_153947.png","screenshot":"1610\/en\/images\/1\/L\/tallyhoo_2010-03-02_153947.png","orientation":"P","device":"P"},"2":{"thumbnail":"1610\/en\/images\/2\/S\/tallyhoo_2010-03-02_165921.png","screenshot":"1610\/en\/images\/2\/L\/tallyhoo_2010-03-02_165921.png","orientation":"P","device":"P"},"3":{"thumbnail":"1610\/en\/images\/3\/S\/tallyhoo_2010-03-02_165801.png","screenshot":"1610\/en\/images\/3\/L\/tallyhoo_2010-03-02_165801.png","orientation":"P","device":"P"}}}