{"publicApplicationId":"com.laminar-research.app.xplane-shuttle","description":"This is SPACE SHUTTLE, an amazing sim that lets you really get some cool bits of the Space Shuttle experience, in completely real-time simulation.  ->Launch: This option lets you WATCH the launch in real-time, from 10 seconds left in the count-down, through orbiter-roll, through SRB-separation, though External-Tank separation, right through to low-orbit insertion, at 17,500 mph at 400,000 ft. You won't FLY this launch, but the times and speeds and events are accurately laid out for you to see, so you can finally see what happens AFTER the shuttle leaves sight of the cameras on it's flights to space. REALISTIC depiction of the Earth is included, including realistic atmospheric visibility and Earth curvature, so you can see what the view is REALLY like when riding a rocket from sea-level to 400,000 ft.  ->ISS Docking. This is a docking sim that gives you full freedom in all 6 dimensions: X, Y, Z, Pitch, Heading, and Roll. This is as tricky as space-flight gets, and YOU will attempt to dock with the ISS... can you handle it? Shuttle and ISS geometry and docking-points are rendered accurately.  ->Final Approach: Now THIS is one you can FLY like a plane! You will be placed at about 18,000 ft, about 10 or 15 miles short of the runway at Edwards... you will fly clear down to landing on your own! Any decent flight-simmer should be able to handle this one, no problem.  ->Near and Distant Re-Entries: THESE are ones that you can fly yourself, and these ones are tricky! You will start off as far as about 600 miles out, at 200,000 ft, Mach-10, well above almost all of the atmosphere, and guide the Orbiter down, by hand, clear to Edwards. The instrumentation in the cockpit is similar to the instrumentation in the real Orbiter, so you will be following the speed, energy, and altitude curves from 200,000 ft all the way down to landing as you S-turn through the stratosphere at Hypersonic speeds.  Can you do it?","version":"9.5.2","versionNote":"","homeURL":"http:\/\/www.X-Plane.com","supportURL":"http:\/\/www.X-Plane.com","custsupportemail":"info@X-Plane.com","custsupportphonenum":"913.269.0976","copyright":"copyright 2010, Laminar Research","licenseURL":"","locale":"en_US","appSize":15943306,"installSize":53004407,"isEncrypted":false,"adultRating":false,"islocationbased":false,"lastModifiedTime":"2010-03-30T12:44:14.000+0000","mediaLink":null,"mediaIcon":null,"attributes":{"provides":{"noApp":false,"dockMode":false,"universalSearch":false,"connectors":[],"services":[],"optimizedUserExperience":false}},"price":9.99,"currency":"USD","isAdvertized":false,"filename":"com.laminar-research.app.xplane-shuttle_9.5.2_all.ipk","free":false,"touchpad_exclusive":false,"images":{"1":{"thumbnail":"1611\/en\/images\/1\/S\/7.jpg","screenshot":"1611\/en\/images\/1\/L\/7.jpg","orientation":"P","device":"P"},"2":{"thumbnail":"1611\/en\/images\/2\/S\/2.jpg","screenshot":"1611\/en\/images\/2\/L\/2.jpg","orientation":"P","device":"P"},"3":{"thumbnail":"1611\/en\/images\/3\/S\/13.jpg","screenshot":"1611\/en\/images\/3\/L\/13.jpg","orientation":"P","device":"P"},"4":{"thumbnail":"1611\/en\/images\/4\/S\/19.jpg","screenshot":"1611\/en\/images\/4\/L\/19.jpg","orientation":"P","device":"P"},"5":{"thumbnail":"1611\/en\/images\/5\/S\/18.jpg","screenshot":"1611\/en\/images\/5\/L\/18.jpg","orientation":"P","device":"P"}}}