{"publicApplicationId":"com.laminar-research.app.xplane-airliner","description":"This is X-Plane-Airliner, a new version of X-Plane for the Palm that simulates Airliners and the relatively long-range, instrument-capable flying that they do. X-Plane-Airliner comes with:  The Boeing 777: The gold standard for modern airliner design and efficiency. The Boeing 747: The big double-decker 4-engine  classic Liner of the sky. The Airbus A-380: The largest airplane in the world, with fly-by-wire controls. The Boeing 787: The new carbon-fiber, high-bypass, ultra-efficient harbinger of the next wave of airline travel. The MD-80: A well-known twin-engine pusher workhouse referred to by pilots as the 'Mad Dog' The Boeing-737: The workhorse of the airline industry known as the 'Baby Boeing'  As well, X-Plane Airliner gives you control of throttle, flaps, speedbrakes, and trim, giving you much more control over these incredible machines than you can get in the regular X-Plane for Palm.  In addition to the additional flight controls, the cockpit is a full glass EFIS system, with airspeed, heading, altitude, vertical speed, Mach number, DME, and HSI with localizer and glideslope displayed in the same manner as the real airliners. As well, a moving map glass display gives you complete situational awareness as you fly, as you find in the real airliners.  With X-Plane-Airliner, you get 42 NAVAIDs, 98 airports, and about 60 by 180 miles to fly in in the default scenery area! That default flight region in X-Plane Airliner spans from San Diego clear up to Edwards Air Force Base! This large flying area, combined with the 98 airports and 42 NAVAIDs, lets you practice long flights in any weather, with glass-cockpit 'EFIS' instrumentation and moving maps in the cockpit to make it all easy as you fly the Big Birds across the scenic terrain of Southern California, enjoying the view if you like to do that, or in hardball IFR conditions, using the glass instrumentation to fly the airliners down to minimums in clouds and fog and turbulence at night... or anything in between.","version":"9.5.2","versionNote":"","homeURL":"http:\/\/www.X-Plane.com","supportURL":"http:\/\/www.X-Plane.com","custsupportemail":"info@X-Plane.com","custsupportphonenum":"803.738.1156","copyright":"copyright 2010, Laminar Research","licenseURL":"","locale":"en_US","appSize":19682190,"installSize":58391439,"isEncrypted":false,"adultRating":false,"islocationbased":false,"lastModifiedTime":"2010-03-30T12:49:20.000+0000","mediaLink":null,"mediaIcon":null,"attributes":{"provides":{"noApp":false,"dockMode":false,"universalSearch":false,"connectors":[],"services":[],"optimizedUserExperience":false}},"price":9.99,"currency":"USD","isAdvertized":false,"filename":"com.laminar-research.app.xplane-airliner_9.5.2_all.ipk","free":false,"touchpad_exclusive":false,"images":{"1":{"thumbnail":"1615\/en\/images\/1\/S\/1.png","screenshot":"1615\/en\/images\/1\/L\/1.png","orientation":"P","device":"P"},"2":{"thumbnail":"1615\/en\/images\/2\/S\/2.png","screenshot":"1615\/en\/images\/2\/L\/2.png","orientation":"P","device":"P"},"3":{"thumbnail":"1615\/en\/images\/3\/S\/3.png","screenshot":"1615\/en\/images\/3\/L\/3.png","orientation":"P","device":"P"},"4":{"thumbnail":"1615\/en\/images\/4\/S\/4.png","screenshot":"1615\/en\/images\/4\/L\/4.png","orientation":"P","device":"P"},"5":{"thumbnail":"1615\/en\/images\/5\/S\/5.png","screenshot":"1615\/en\/images\/5\/L\/5.png","orientation":"P","device":"P"}}}