{"publicApplicationId":"com.laminar-research.app.xplane-glider","description":"This is X-Plane GLIDER, a REALLY fun X-Plane app that lets you do some really fun GLIDING!  Here is how it works: You start off in either of 2 gliders: A nice Ask-21 composite trainer, or a Schemp-Hirth high-performance sailplane. You are on the runway, with a towplane in front of you, engine running, ready to go. Release the brakes to command the towplane to take off and away you go! The towplane will take you as high as you like, and you will hold formation behind him as he pulls you to altitude.  WARNING! THE TOW-ROPE THAT ATTACHES YOUR PLANE TO HIS IS HOOKED TO HIS TAIL, AND YOUR NOSE, WITH REALISTIC PHYSICS. IF YOU PULL YOUR GLIDER LEFT, RIGHT, UP, OR DOWN, IT WILL PULL HIS TAIL IN THAT DIRECTION, PULLING HIM OFF COURSE, OR ULTIMATELY INTO A STALL OR SPIN IF YOU PULL TOO HARD. AT THIS POINT, YOU WILL HAVE CAUSED THE TOWPLANE TO CRASH, WHICH IS ESPECIALLY PROBLEMATIC SINCE YOU ARE ATTACHED TO HIM WITH A TOW-ROPE! The dynamics of the resulting crash are... 'interesting' ;-)  Once you have gotten a successful ride to altitude, the REAL fun begins: GLIDING! X-Plane Glider simulates RIDGE LIFT. This is a phenomenon where the WIND blows UP and OVER the mountains, climbing or descending to follow the contours of the terrain. Your mission as a glider pilot is pretty clear: Watch the wind and the slope of the terrain carefully to hold inside the UPWARD-MOVING areas of air, using the lift of the air flowing UP the mountain-slope to hold you aloft!  Helping you along is an instrument called the TOTAL ENERGY VARIOMETER. If it is BEEPING, then  you have found a nice updraft from the air following the terrain... circle in that area to ride the climbing air to altitude! If you hear a STEADY tone, then you are in DESCENDING air... you have probably let yourself be blown to the wrong side of the mountain!!! You are now in DESCENDING air, and a crash will follow soon if you do not find a way out of that area!","version":"9.5.2","versionNote":"","homeURL":"http:\/\/www.X-Plane.com","supportURL":"http:\/\/www.X-Plane.com","custsupportemail":"info@X-Plane.com","custsupportphonenum":"913.269.0976","copyright":"copyright 2010, Laminar Research","licenseURL":"","locale":"en_US","appSize":19679050,"installSize":56563494,"isEncrypted":false,"adultRating":false,"islocationbased":false,"lastModifiedTime":"2010-03-30T12:45:26.000+0000","mediaLink":null,"mediaIcon":null,"attributes":{"provides":{"noApp":false,"dockMode":false,"universalSearch":false,"connectors":[],"services":[],"optimizedUserExperience":false}},"price":9.99,"currency":"USD","isAdvertized":false,"filename":"com.laminar-research.app.xplane-glider_9.5.2_all.ipk","free":false,"touchpad_exclusive":false,"images":{"1":{"thumbnail":"1616\/en\/images\/1\/S\/1.jpg","screenshot":"1616\/en\/images\/1\/L\/1.jpg","orientation":"P","device":"P"},"2":{"thumbnail":"1616\/en\/images\/2\/S\/2.jpg","screenshot":"1616\/en\/images\/2\/L\/2.jpg","orientation":"P","device":"P"},"3":{"thumbnail":"1616\/en\/images\/3\/S\/3.jpg","screenshot":"1616\/en\/images\/3\/L\/3.jpg","orientation":"P","device":"P"},"4":{"thumbnail":"1616\/en\/images\/4\/S\/4.jpg","screenshot":"1616\/en\/images\/4\/L\/4.jpg","orientation":"P","device":"P"},"5":{"thumbnail":"1616\/en\/images\/5\/S\/5.jpg","screenshot":"1616\/en\/images\/5\/L\/5.jpg","orientation":"P","device":"P"}}}