{"publicApplicationId":"com.jackpot.massageit","description":"***webOS 2.x and VEER compatible! The cheapest lite massage you can get anywhere! Massage It! is like having your own mini massager at your fingertips. Do not be caught during an intimate encounter without it! Spice up your next romantic adventure at home. Your sweetheart will love you long time. REMEMBER, Massage It! Repeatedly vibrates your phone but this app does NOT have any thing to do with controlling the vibration you feel when you receive a message alert or phone call. You can adjust the vibrate frequency \/ intensity, by sliding the Massage It! Intensity control. Power the app On or Off with a swipe or tap of the Power On \/ Off toggle switch. Your settings are automatically saved after closing the app for the next time the app is launched. Massage It! has been so thoughtfully designed that it will keep on running even after the screen dims, (mentioned in review from 7\/10\/2010, NICOLE R, please update your review), so you can press the power button once on your Pre or Pixi, turn off the screen, dim the lights and hold on tight! Just remember, extended usage could put a strain and drain your battery. Available in English, Spanish, French and Italian but you certainly don’t need to know how to read to use this app. Just set the mood, relax and enjoy. What is most important to us is that you are happy with our applications. Please reach out to us via E-mail with suggestions so we can make it even better. Massage It! DOES NOT turn your phone into a professional massage system, or a Powerful Vibrating Device, it simply allows you to repeatedly vibrate your phone. It is very good for a light massage in a tender, sensitive area of the body. Intensity ranges from level 1, which is a vibrate every second or so, to level 10 which is essentially a continuous vibrate. Help is always available through the app menu and you can refer to the Faq for simple instructions.","version":"1.0.4","versionNote":"","homeURL":"http:\/\/jackpotideas.com","supportURL":"http:\/\/jackpotideas.com","custsupportemail":"support@jackpotideas.com","custsupportphonenum":"","copyright":"Copyright 2010 J@ckpot ideas Inc.","licenseURL":"","locale":"en_US","appSize":265446,"installSize":9225575,"isEncrypted":false,"adultRating":false,"islocationbased":false,"lastModifiedTime":"2012-06-01T04:34:16.000+0000","mediaLink":null,"mediaIcon":null,"attributes":{"provides":{"noApp":false,"dockMode":false,"universalSearch":false,"connectors":["null"],"services":[],"optimizedUserExperience":false}},"price":0.99,"currency":"USD","isAdvertized":false,"filename":"com.jackpot.massageit_1.0.4_all.ipk","free":false,"touchpad_exclusive":false,"images":{"1":{"screenshot":"1626\/1.0.4\/en\/images\/1\/L\/massageitoff.png","thumbnail":"1626\/1.0.4\/en\/images\/1\/L\/massageitoff.png","orientation":"P","device":"P"},"2":{"screenshot":"1626\/1.0.4\/en\/images\/2\/L\/massageit.png","thumbnail":"1626\/1.0.4\/en\/images\/2\/L\/massageit.png","orientation":"P","device":"P"},"3":{"screenshot":"1626\/1.0.4\/en\/images\/3\/L\/MassageitFAQ.png","thumbnail":"1626\/1.0.4\/en\/images\/3\/L\/MassageitFAQ.png","orientation":"P","device":"P"},"4":{"screenshot":"1626\/1.0.4\/en\/images\/4\/L\/MassageitSupport.png","thumbnail":"1626\/1.0.4\/en\/images\/4\/L\/MassageitSupport.png","orientation":"P","device":"P"}}}