{"publicApplicationId":"com.xybyresoft.trimatchdemo","description":"This is a demo for Tri-Match.  Tri-Match is a matching game, similar to Bejeweled. You must match three or more objects by swapping any two adjacent objects. Match more than three objects to receive bonuses!   Tri-Match has special features that make it a joy to play:   1. Although the objects may seem small and hard to select, the object's touchable area is actually four times larger! This means that you don't have to be precise with your moves. Just touch the object you want to move and slide your finger in the direction of the object you want to swap with. Don't worry if you missed the object by a little bit. Tri-match is smart enough to deduce your intended move!   2. Smooth animation and special effects.   3. Tri-Match automatically gives you a hint if you can't find a move.   4. Create special explosive objects by matching 4 or more objects. When your game ends, there is a chance that these will explode to save you!   5. The game automatically pauses when the app is minimized.   The full version also includes:  1. Automatically resume play if you need to close the app.  2. Instant Replay! Did you just get an awesome combo? Did the action go by too fast to follow? Watch it again in slow motion! Pixi users can press 'R' on the keyboard to invoke this feature.   3. Get a speed bonus for making moves quickly! You can also queue up moves while your current move is in motion.   4. Three game modes: Free Play, which lets you enjoy the game at your own pace, or Timed (3-minute) and Blitz (1-minute) modes.   5. High scores are tracked, locally and globally.    * v1.0.1 - extended demo time limit","version":"1.0.1","versionNote":"","homeURL":"http:\/\/xybyresoft.com","supportURL":"http:\/\/xybyresoft.com","custsupportemail":"support@xybyresoft.com","custsupportphonenum":"..","copyright":"Copyright 2010 Xybyresoft","licenseURL":"","locale":"en_US","appSize":283494,"installSize":2089983,"isEncrypted":false,"adultRating":false,"islocationbased":false,"lastModifiedTime":"2010-04-01T01:32:25.000+0000","mediaLink":null,"mediaIcon":null,"attributes":{"provides":{"noApp":false,"dockMode":false,"universalSearch":false,"connectors":[],"services":[],"optimizedUserExperience":false}},"price":0,"currency":"USD","isAdvertized":false,"filename":"com.xybyresoft.trimatchdemo_1.0.1_all.ipk","free":false,"touchpad_exclusive":false,"images":{"1":{"thumbnail":"1700\/en\/images\/1\/S\/tm_demo1.jpg","screenshot":"1700\/en\/images\/1\/L\/tm_demo1.jpg","orientation":"P","device":"P"},"2":{"thumbnail":"1700\/en\/images\/2\/S\/tm_demo2.jpg","screenshot":"1700\/en\/images\/2\/L\/tm_demo2.jpg","orientation":"P","device":"P"},"3":{"thumbnail":"1700\/en\/images\/3\/S\/tm_demo3.jpg","screenshot":"1700\/en\/images\/3\/L\/tm_demo3.jpg","orientation":"P","device":"P"}}}