{"publicApplicationId":"com.laminar-research.app.xplane-extreme","description":"X-Plane Extreme is by far the most difficult X-Plane Palm App we have ever coded.  This is because now we are really getting into the hard stuff: the tricky and demanding propulsion and flight-control systems that make X-Plane so complex. We have some of the most unusual, fast, maneuverable, or advanced planes ever made... EACH with it's own unique control systems that radically effect the way the plane handles, and how it must be flown.  F-22 Raptor. The Raptor is by far the most maneuverable and powerful fighter in the sky... nobody else comes remotely close. An interesting point of the Raptor is that the thrust vectors up and down to steer the craft. This lets the plane pitch the nose up and down with full authority even at zero speed, simply by vectoring the thrust.  SR-71 Blackbird.  This is the fastest airplane in the world, exceeding Mach-3, exceeding 70,000 feet. Managing this airplane is sort of like balancing 3 checkbooks at once: Can you work out the speed, altitude, and flight control to see well over Mach-3 at well over 70,000 feet, and still make it back to the airport and get stopped on the runway?  B-1 'Bone' Bomber. The B-1 has almost full-span flaps, spoilers for roll control, and differentially-deflecting all-moving stabilators to aid in roll control.  The B-2 'Jet' Bomber: The B-2 has no tail. No vertical stabilizer. No horizontal stabilizer. No flaps. Ailerons on the wingtips split open to add drag on the left or right side of the plane to give yaw-control! A fly-by-wire system coupled to multiple flight-control surfaces makes this airplane manageable.  The X-15. This plane was dropped from a B-52 bomber like a bomb, and then flown by hand INTO SPACE. Once the plane exhausted it's fuel, it glided back down to Edwards for landing. ","version":"9.5.2","versionNote":"","homeURL":"http:\/\/www.X-Plane.com","supportURL":"http:\/\/www.X-Plane.com","custsupportemail":"info@X-Plane.com","custsupportphonenum":"913.269.0976","copyright":"copyright 2010, Laminar Research","licenseURL":"","locale":"en_US","appSize":21096098,"installSize":59172466,"isEncrypted":false,"adultRating":false,"islocationbased":false,"lastModifiedTime":"2010-03-30T13:02:07.000+0000","mediaLink":null,"mediaIcon":null,"attributes":{"provides":{"noApp":false,"dockMode":false,"universalSearch":false,"connectors":[],"services":[],"optimizedUserExperience":false}},"price":9.99,"currency":"USD","isAdvertized":false,"filename":"com.laminar-research.app.xplane-extreme_9.5.2_all.ipk","free":false,"touchpad_exclusive":false,"images":{"1":{"thumbnail":"1716\/en\/images\/1\/S\/1.jpg","screenshot":"1716\/en\/images\/1\/L\/1.jpg","orientation":"P","device":"P"},"2":{"thumbnail":"1716\/en\/images\/2\/S\/2.jpg","screenshot":"1716\/en\/images\/2\/L\/2.jpg","orientation":"P","device":"P"},"3":{"thumbnail":"1716\/en\/images\/3\/S\/3.jpg","screenshot":"1716\/en\/images\/3\/L\/3.jpg","orientation":"P","device":"P"},"4":{"thumbnail":"1716\/en\/images\/4\/S\/4.jpg","screenshot":"1716\/en\/images\/4\/L\/4.jpg","orientation":"P","device":"P"},"5":{"thumbnail":"1716\/en\/images\/5\/S\/5.jpg","screenshot":"1716\/en\/images\/5\/L\/5.jpg","orientation":"P","device":"P"}}}