{"publicApplicationId":"com.laminar-research.app.xplane-racing","description":"This is X-Plane RACING, the FIRST-EVER X-Plane with timed race-courses that let you race against the computer, or your friends, in multiplayer-mode! Here is how it works: X-Plane RACING comes with 6 regions and 24 race-courses. These course are presented as 'highway-in-the-sky' 'hoops' that you fly though, racing against the clock, right alongside the AI plane. X-Plane RACING will show you the time through the course, and number of hoops missed, at the end of the race. Some courses race down river-valleys.. others through mountain ranges, other through clouds. Some through snow-covered rocky mountains, others through desert. To our knowledge, this is the most realistic flight physics for any aerial racing out there. Pulling these peppy WW-2 fighters, or massive jets, through the hoops in the Mach 0.5 to Mach 1.25 range at low altitude through mountains and canyons is... special.  Fly the:  F-4-U Corsair: A tricky hi-speed fighter of World-War-2. Being a tail-dragger landing gear configuration, it will be VERY tricky to land. You must land in a full-stall, nose-high attitude.  P-51 Mustang: The premier fighter of World-War-2 .Being a tail-dragger landing gear configuration, it will be VERY tricky to land. You must land in a full-stall, nose-high attitude.  F-4 Phantom: The King of the 'Jet-Age', this plane is amazing to take through the desert canyons at Mach 1.25.  F-15 Eagle: This powerful machine is the pinnacle of pilot-friendly jet-power... IF you can handle Mach 1.25 between the mountain peaks of Alaska... can you?  F-86 Sabre: An amazing Korean-era jet.  We also have some new tweaks in here like tire-skidding sound that is accurately hooked up the street-racing-accurate tire-physics model, and visible afterburners, which are pretty darn cool on the F-4 Phantom!","version":"9.5.2","versionNote":"","homeURL":"http:\/\/www.X-Plane.com","supportURL":"http:\/\/www.X-Plane.com","custsupportemail":"info@X-Plane.com","custsupportphonenum":"913.269.0976","copyright":"copyright 2010, Laminar Research","licenseURL":"","locale":"en_US","appSize":16852296,"installSize":52353336,"isEncrypted":false,"adultRating":false,"islocationbased":false,"lastModifiedTime":"2010-03-30T13:04:27.000+0000","mediaLink":null,"mediaIcon":null,"attributes":{"provides":{"noApp":false,"dockMode":false,"universalSearch":false,"connectors":[],"services":[],"optimizedUserExperience":false}},"price":9.99,"currency":"USD","isAdvertized":false,"filename":"com.laminar-research.app.xplane-racing_9.5.2_all.ipk","free":false,"touchpad_exclusive":false,"images":{"1":{"thumbnail":"1717\/en\/images\/1\/S\/1.jpg","screenshot":"1717\/en\/images\/1\/L\/1.jpg","orientation":"P","device":"P"},"2":{"thumbnail":"1717\/en\/images\/2\/S\/2.jpg","screenshot":"1717\/en\/images\/2\/L\/2.jpg","orientation":"P","device":"P"},"3":{"thumbnail":"1717\/en\/images\/3\/S\/3.jpg","screenshot":"1717\/en\/images\/3\/L\/3.jpg","orientation":"P","device":"P"},"4":{"thumbnail":"1717\/en\/images\/4\/S\/4.jpg","screenshot":"1717\/en\/images\/4\/L\/4.jpg","orientation":"P","device":"P"},"5":{"thumbnail":"1717\/en\/images\/5\/S\/5.jpg","screenshot":"1717\/en\/images\/5\/L\/5.jpg","orientation":"P","device":"P"}}}