{"publicApplicationId":"com.laminar-research.app.xplane-helo","description":"X-Plane Helicopter is a new version of X-Plane that lets you realistically fly Helicopters!  You get some very interesting birds to fly, including:  The Robinson R-22: The lightweight, efficient trainer. The Bell-206: The turbine-powered mainstay of the helicopter fleet. The BlackHawk: The massive military cargo and troop mover. The Sea King: The huge land\/sea rescue helicopter. The Sikorsky S-76, an amazing luxurious executive-transport.  These fascinating and varied machines are modeled very realistically, so the flight you get on the Palm is actually almost as realistic as the full FAA-Certified flight-model used in X-Plane for desktop... You get almost all the flight-model realism of this certified sim: On your phone.  Now, a quick lesson: The COLLECTIVE control is on the LEFT of the Palm screen... drag it DOWN GENTLY to INCREASE the pitch of the main rotor, thus causing the helo to lift. As you drag this collective down, you will notice that the throttle AUTOMATICALLY increases on the right side of the screen. This is because the throttle governor automatically increases the engine power to maintain the desired rotor RPM as you increase the load on the rotor by increasing the rotor pitch. This is how the real helicopters work, and how we simulate them on the Palm.  The tail-rotor is controlled with a horizontal slider on the bottom of the screen. Flying a helicopter in reality is well known to be one of the more challenging and rewarding facets of aviation... the most difficult to do, but the most rewarding when you manage to do it all properly.  If you are ready for the best scenery and most fascinating and challenging flight model available on the Palm, then you are ready for X-Plane-Helicopter.","version":"9.5.2","versionNote":"","homeURL":"http:\/\/www.X-Plane.com","supportURL":"http:\/\/www.X-Plane.com","custsupportemail":"info@X-Plane.com","custsupportphonenum":"913.269.0976","copyright":"copyright 2010, Laminar Research","licenseURL":"","locale":"en_US","appSize":20264774,"installSize":57750987,"isEncrypted":false,"adultRating":false,"islocationbased":false,"lastModifiedTime":"2010-03-30T12:55:14.000+0000","mediaLink":null,"mediaIcon":null,"attributes":{"provides":{"noApp":false,"dockMode":false,"universalSearch":false,"connectors":[],"services":[],"optimizedUserExperience":false}},"price":9.99,"currency":"USD","isAdvertized":false,"filename":"com.laminar-research.app.xplane-helo_9.5.2_all.ipk","free":false,"touchpad_exclusive":false,"images":{"1":{"thumbnail":"1718\/en\/images\/1\/S\/1.jpg","screenshot":"1718\/en\/images\/1\/L\/1.jpg","orientation":"P","device":"P"},"2":{"thumbnail":"1718\/en\/images\/2\/S\/2.jpg","screenshot":"1718\/en\/images\/2\/L\/2.jpg","orientation":"P","device":"P"},"3":{"thumbnail":"1718\/en\/images\/3\/S\/3.jpg","screenshot":"1718\/en\/images\/3\/L\/3.jpg","orientation":"P","device":"P"},"4":{"thumbnail":"1718\/en\/images\/4\/S\/4.jpg","screenshot":"1718\/en\/images\/4\/L\/4.jpg","orientation":"P","device":"P"},"5":{"thumbnail":"1718\/en\/images\/5\/S\/5.jpg","screenshot":"1718\/en\/images\/5\/L\/5.jpg","orientation":"P","device":"P"}}}