{"publicApplicationId":"com.hedami.geostringstrial","description":"*****\n\nNominated by the PreCentral community in the following \"Best of 2010\" award categories:\n\n-  Best App of 2010\n-  Best Location-Based\/GPS App of 2010\n-  Most innovative App of 2010\n\n*****\n\n*** This 10-day free trial allows you to experience all the features within the full app. ***\n\nGeoStrings gives you the ability to set location-based reminders that will alert you when you are close to a location where you need to perform a task.\n\nGeoStrings provides an elegant, intuitive interface with a plethora of advanced customization options including date\/time filtering, day of the week alerting, customizable snooze settings & alarm notifications, custom wallpapers and background colors, as well as the ability to add multiple locations to a GeoString reminder.\n\nGeoStrings also automatically saves all of your reminders and locations into a searchable history list, as well as provides you the ability to define favorite reminders, locations, and custom location groups.\n\nGeoStrings also has a unique interactive help system built directly into the app. \nOn any screen tap the \"?\" icon located at the top-right corner of the screen to view a series of help balloons that will give you a detailed description of all the screen's hot spots.\n\nGeoStrings is a powerful tool you'll use on a daily basis. It'll forever change the way you manage your day-to-day tasks. In the past, people would tie strings on their fingers to remind them of their tasks. Today, leveraging the unique abilities of the webOS mobile platform, GeoStrings is your modern-day, location-aware string-on-your-finger that will never let you forget another task again.\n\nNEW IN VERSION 1.1.7:  Add support for the Pre 3\n\n(NOTE for the Pre 3:  Mapping functions are not supported on the Pre 3 due to issues with the Google Map API on webOS 2.2.  The \"Map Input\" function has been replaced with a \"Current Location\" function).","version":"1.1.7","homeURL":"http:\/\/www.hedami.com\/contactus.html","supportURL":"http:\/\/www.hedami.com\/contactus.html","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright © 2011 Hedami","licenseURL":"http:\/\/www.hedami.com\/contactus.html","locale":null,"appSize":"968684","installSize":"968684","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":0,"currency":"USD","filename":"com.hedami.geostringstrial_1.1.7_all.ipk","free":true,"images":[{"thumbnail":"1769\/icon\/S\/icon_1_1_7.png","screenshot":"1769\/icon\/S\/icon_1_1_7.png","orientation":"P","device":"P"}]}