{"publicApplicationId":"com.shanerooni.mazehunter3d","description":"How often does a real maze have an aerial view of the entire maze? Have you ever been to a real maze, and tried walking through it? All you can see is what's in front of you. MazeHunter3D is a simple 3D maze game where you are inside the maze and hunting a specific random spot in the maze. Use the keyboard, touch-screen or the accelerometer to navigate your way through the maze. There are currently 5 different sized mazes (10x10, 15x15, 20x20, 30x30 and 45x45), and the object is to find and get to that part of the maze that shows up on the map. Okay, you're not totally alone here. You have a map that shows only a small radius around you, and a compass to show you which way you are facing.  You can see where you started indicated with a red square, where you are, the walls, the path you've taken so far, and there's a green indicator. That's where you want to go! Don't see a green indicator? You may be looking for quite a while! Each new game randomly places the green indicator somewhere in the maze. Each minute or so that passes, you can see a little more of the map but the map will only get so big -- then you're on your own from there! You must beat the easier maze to unlock the next tougher maze. You might have a green indicator right in front of you, or you might be hunting it all around the maze! ***NOTE: There is no timer, no score keeping and you can't lose!  This game is just to kill time, and search around the maze. Please don't purchase and then rate it 1 star because of something that was already disclosed. Future updates will include a more competitive environment, a make-your-own-maze option, and multiple (sequential) searches within a single maze.  Please feel free to hold off on your purchase for the updated release, but for an inexpensive app, this will keep you busy!  Thank you, and enjoy!***","version":"1.0.1","versionNote":"","homeURL":"http:\/\/www.shanerooni.com","supportURL":"http:\/\/www.shanerooni.com","custsupportemail":"admin@shanerooni.com","custsupportphonenum":"484.654.2668","copyright":"Copyright 2010 Shanerooni, LLC","licenseURL":"","locale":"en_US","appSize":137810,"installSize":3314353,"isEncrypted":false,"adultRating":false,"islocationbased":false,"lastModifiedTime":"2012-06-01T01:16:01.000+0000","mediaLink":"http:\/\/www.youtube.com\/watch?v=sivHSC12Usg","mediaIcon":"http:\/\/img.youtube.com\/vi\/sivHSC12Usg\/2.jpg","attributes":{"provides":{"noApp":false,"dockMode":false,"universalSearch":false,"connectors":["null"],"services":[],"optimizedUserExperience":false}},"price":0.99,"currency":"USD","isAdvertized":false,"filename":"com.shanerooni.mazehunter3d_1.0.1_all.ipk","free":false,"touchpad_exclusive":false,"images":{"1":{"screenshot":"1777\/1.0.1\/en\/images\/1\/L\/mazehunter3d_2010-15-02_143917.png","thumbnail":"1777\/1.0.1\/en\/images\/1\/L\/mazehunter3d_2010-15-02_143917.png","orientation":"P","device":"P"},"2":{"screenshot":"1777\/1.0.1\/en\/images\/2\/L\/mazehunter3d_2010-15-02_135032.png","thumbnail":"1777\/1.0.1\/en\/images\/2\/L\/mazehunter3d_2010-15-02_135032.png","orientation":"P","device":"P"},"3":{"screenshot":"1777\/1.0.1\/en\/images\/3\/L\/mazehunter3d_2010-15-02_134855.png","thumbnail":"1777\/1.0.1\/en\/images\/3\/L\/mazehunter3d_2010-15-02_134855.png","orientation":"P","device":"P"}}}