{"publicApplicationId":"com.mediafly.medialite-twit","description":"Mediafly Mobile featuring TWiT.tv allows you to access the entire TWiT Netcast Network – all of the audio shows and the new video shows – from the palm of your hand — at home, at work and on the go.  Mediafly allows you to watch and listen to TWiT over WiFi or cell network so you never miss an episode.   The TWiT network is one of the most renown tech news networks with popular shows, such as this WEEK in TECH, MacBreak Weekly, Security Now, net@night, this WEEK in GOOGLE, Daily Giz Wiz, FLOSS Weekly, this WEEK in FUN, Munchcast, The Tech Guy, Roz Rows, Futures in Biotech, this WEEK in LAW, Radio Leo & more.  With Mediafly you can also access to the most popular netcasts and podcasts — organized into convenient channels from News & Politics to Technology News, Comedy to Celebrity Gossip, and many more.  Extend your TWiT experience beyond your phone. Visit Mediafly.com to see how to link your channels to other great devices such as Roku Internet Video Player for your TV, OpenPeak and Logitech Squeezebox for your countertop or desk, and many other popular devices. [Mediafly Mobile for webOS was designed for Mediafly by Jamie Hatfield and Obtiva.com]","version":"0.18.4","versionNote":"I am working with Jeff Finkelstein at Palm to get this app approved in time for Leo Laporte's demo at Blogworld Thursday where he will announce this app as the first way to get access to TWiT video mobile.  This app is identical to our other app (also in review), Medialfy Mobile. The only difference is that this app has special branding for TWiT and automatically adds TWiT to the top of the Home menu.  ","homeURL":"http:\/\/www.mediafly.com","supportURL":"http:\/\/forums.mediafly.com","custsupportemail":"support@mediafly.com","custsupportphonenum":"312.281.5175","copyright":"copyright 2009 Mediafly, Inc.","licenseURL":"","locale":"en_US","appSize":706908,"installSize":3313548,"isEncrypted":false,"adultRating":false,"islocationbased":false,"lastModifiedTime":"2009-10-15T18:29:01.000+0000","mediaLink":null,"mediaIcon":null,"attributes":{"provides":{"noApp":false,"dockMode":false,"universalSearch":false,"connectors":[],"services":[],"optimizedUserExperience":false}},"price":0,"currency":"USD","isAdvertized":false,"filename":"com.mediafly.medialite-twit_0.18.4_all.ipk","free":false,"touchpad_exclusive":false,"images":{"1":{"thumbnail":"181\/en\/images\/1\/S\/TWiT-Palm-Channel-3.png","screenshot":"181\/en\/images\/1\/L\/TWiT-Palm-Channel-3.png","orientation":"P","device":"P"},"2":{"thumbnail":"181\/en\/images\/2\/S\/TWiT-Palm-Channel-2.png","screenshot":"181\/en\/images\/2\/L\/TWiT-Palm-Channel-2.png","orientation":"P","device":"P"},"3":{"thumbnail":"181\/en\/images\/3\/S\/TWiT-Palm-Channel-0.png","screenshot":"181\/en\/images\/3\/L\/TWiT-Palm-Channel-0.png","orientation":"P","device":"P"}}}