{"publicApplicationId":"com.appible.mansfieldpark","description":"Mansfield Park is highly regarded by Austen followers as a tale of character and sensibility very much along the lines of Emma and confronting similar issues of marriage and social class while acting as a serious critique of Regency values. Austen began writing it in 1811 and it was published in 1814, just as she began writing Emma. The novel is founded upon the solid and stern but kind-hearted Sir Thomas Bertram, owner of Mansfield Park. He is a throwback to the conservative values and beliefs of order, principles and distance from emotion so prevalent in the 18th century. Although he has two sons and two daughters of his own (Tom, Edmund, Maria and Julia) he takes on the child of his sister-in-law Mrs Price who has a large family of youngsters and, due to her marine officer husband, is very poor. Young Fanny Price, a timid but likeable girl, is the heroine of this tale. She represents the late-18th and early 19th century value of sensibility, which was considered to be an intangible but very positive trait which supposedly allowed one to feel more deeply than most. In between the contrasting manners of Sir Thomas and Fanny are Henry and Mary Crawford who have neither cautious values nor the newcomer's capacity for caring and aesthetic moral sensibilities. Mansfield Park tells of the departure of Sir Thomas and the moral decline of his household into flirtatious and inappropriate relationships and dubious acting in forbidden theatricals to make possible the demonstration of their illicit desires. Sir Thomas's return from the West Indies and Fanny's exile back to poverty drive forward events which, as ever in Austen, lead to marriage proposals and related difficulties. -Bibiomania.com","version":"1.5.8","homeURL":"http:\/\/appible.com\/a\/contact","supportURL":"http:\/\/appible.com\/a\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/a\/contact","locale":null,"appSize":"819948","installSize":"819948","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"0.99","currency":"USD","filename":"com.appible.mansfieldpark_1.5.8_all.ipk","free":false,"images":[{"thumbnail":"1935\/de\/images\/1\/L\/1mansfield.png","screenshot":"1935\/de\/images\/1\/L\/1mansfield.png","orientation":"P","device":"P"},{"thumbnail":"1935\/de\/images\/2\/L\/2mansfield.png","screenshot":"1935\/de\/images\/2\/L\/2mansfield.png","orientation":"P","device":"P"},{"thumbnail":"1935\/de\/images\/3\/L\/3mansfield.png","screenshot":"1935\/de\/images\/3\/L\/3mansfield.png","orientation":"P","device":"P"},{"thumbnail":"1935\/de\/images\/4\/L\/4mansfield.png","screenshot":"1935\/de\/images\/4\/L\/4mansfield.png","orientation":"P","device":"P"}]}