{"publicApplicationId":"com.appible.thepictureofdoriangray","description":"The Picture of Dorian Gray was arch-aesthete Oscar Wilde’s only novel, although he wrote a number of poems and children’s stories before it was published in 1890 (in Lippincott’s Magazine) and became a very successful playwright in the 1890s themselves. Like much of his work and life, the Gothic melodrama Dorian Gray was controversial. In his preface to the book he famously wrote that, \"There is no such thing as a moral or immoral book. Books are well written or badly written. That is all\". The novel is a brilliant portrait of vanity and depravity tinged with sadness. The picture of the title is a splendid work painted by Basil Hallward of the orphaned boy Dorian Gray who is the heir to a great fortune. Lord Henry and Hallward discuss the boy and the remarkable painting. Dorian enters and declares that he would give his soul if he were always to be young and the painting instead would grow old. As the story pans out, Dorian leaves his fiancée - the actress Sibyl Vane - because through a single bad performance he claims that she has ‘killed’ his love. She kills herself with poison and Dorian is unaffected. So begins the tale of the boy’s descent into low society in London while still giving dinners and musicals for high society. He is inspired by two things: the book Lord Henry sends him that seems to predict his own life in dissecting every virtue and every sin from the past; and secondly the picture of himself which grows steadily older and more vicious looking compared to his own mirror image which remains young. Fanatical about the portrait, he is driven to murder and deception. As others are drawn into this web of evil Dorian himself longs to return to innocence but his method is horrific and tragic. -Bibliomania.com","version":"1.5.8","homeURL":"http:\/\/appible.com\/a\/contact","supportURL":"http:\/\/appible.com\/a\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/a\/contact","locale":null,"appSize":"611160","installSize":"611160","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"0.99","currency":"USD","filename":"com.appible.thepictureofdoriangray_1.5.8_all.ipk","free":false,"images":[{"thumbnail":"1950\/de\/images\/1\/L\/01dorian.png","screenshot":"1950\/de\/images\/1\/L\/01dorian.png","orientation":"P","device":"P"},{"thumbnail":"1950\/de\/images\/2\/L\/02dorian.png","screenshot":"1950\/de\/images\/2\/L\/02dorian.png","orientation":"P","device":"P"},{"thumbnail":"1950\/de\/images\/3\/L\/03dorian.png","screenshot":"1950\/de\/images\/3\/L\/03dorian.png","orientation":"P","device":"P"},{"thumbnail":"1950\/de\/images\/4\/L\/04dorian.png","screenshot":"1950\/de\/images\/4\/L\/04dorian.png","orientation":"P","device":"P"}]}