{"publicApplicationId":"com.appible.littlewomen","description":"Little Women is the story of The Marches, a family used to hard toil and suffering. Although Father March is away with the Union armies, the sisters Meg, Jo, Amy and Beth keep in high spirits with their mother, affectionately named Marmee. Their friendly gift of a Christmas holiday breakfast to a neighbouring family is an act of generosity rewarded with wealthy Mr. Laurence's gift of a surprise Christmas feast. However, despite their efforts to be good, the girls show faults: the pretty Meg becomes discontented with the children she teaches; boyish Jo loses her temper regularly; while the golden-haired schoolgirl Amy is inclined towards affectation. However, Beth, who keeps the house is always kind and gentle. After certain happy times winning over the Laurences, dark times arrive as Marmee finds out about her husband's illness. Worse is to come as Beth contracts scarlet fever in her Samaritan efforts for a sick neighbour and becomes more or less an invalid. The novel tells of their progress into young womanhood with the additional strains of romance, Beth's terminal illness, the pressures of marriage and the outside world. This is the story of their growing maturity and wisdom and the search for the contentedness of family life. It was written in 1867 and is a fictionalised biography of Alcott and her sisters. It has become a much loved classic tale and, while some of its issues seem outdated, many of the trials of the sisters are all too relevant today as evidenced by its continued following \"Bibliomania.com\"","version":"1.5.8","homeURL":"http:\/\/appible.com\/a\/contact","supportURL":"http:\/\/appible.com\/a\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/a\/contact","locale":null,"appSize":"915550","installSize":"915550","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"0.99","currency":"USD","filename":"com.appible.littlewomen_1.5.8_all.ipk","free":false,"images":[{"thumbnail":"1953\/de\/images\/1\/L\/1littlewom.png","screenshot":"1953\/de\/images\/1\/L\/1littlewom.png","orientation":"P","device":"P"},{"thumbnail":"1953\/de\/images\/2\/L\/2littlewom.png","screenshot":"1953\/de\/images\/2\/L\/2littlewom.png","orientation":"P","device":"P"},{"thumbnail":"1953\/de\/images\/3\/L\/3littlewom.png","screenshot":"1953\/de\/images\/3\/L\/3littlewom.png","orientation":"P","device":"P"},{"thumbnail":"1953\/de\/images\/4\/L\/4littlewom.png","screenshot":"1953\/de\/images\/4\/L\/4littlewom.png","orientation":"P","device":"P"}]}