{"publicApplicationId":"com.appible.treasureisland","description":"Stevenson's most famous novel and an enduringly popular romance, Treasure Island was published in 1883, although it had appeared initially in Young Folks in serial form July 1881-June 1882 under the alternative title of \"The Sea-Cook or Treaure Island\". It is of course the author's success, but the novel's conception is interesting. It developed from an imaginary map that Stevenson and his stepson Lloyd Osbourne had devised on holiday and this goes some way towards explaining the book's appeal among children. Moreover, the famous antihero Long John Silver was the invention of Stevenson's friend, William Henley. Nonetheless, the tale is the archetypal nineteenth century 'ripping yarn'. Our narrator is Jim Hawkins, son of a guesthouse owner on the west coast of England sometime in the eighteenth century. To the inn come firstly an old buccaneer who has a map of Captain Flint's treasure, and secondly a group of pirates under the command of ominous blind man Pew. Jim Hawkins, our hero, in an act of bravery and cunning gets hold of the map before this rabid mob gets it. He delivers the map to Squire Trelawney, and together they set off for Treasure Island in the Squire's schooner. The rest of the crew, apart from Dr Livesey (a friend of the squire) are a company collected by Long John Silver. The latter and his men try to mutiny and get hold of the treasure themselves but Jim intervenes and through a series of enthralling adventures we find ourselves on Treasure Island with the marooned Ben Gunn and ever closer to the treasure itself. Bibliomania.com","version":"1.5.8","homeURL":"http:\/\/appible.com\/a\/contact","supportURL":"http:\/\/appible.com\/a\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/a\/contact","locale":null,"appSize":"661546","installSize":"661546","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"0.99","currency":"USD","filename":"com.appible.treasureisland_1.5.8_all.ipk","free":false,"images":[{"thumbnail":"1954\/de\/images\/1\/L\/1treasure.png","screenshot":"1954\/de\/images\/1\/L\/1treasure.png","orientation":"P","device":"P"},{"thumbnail":"1954\/de\/images\/2\/L\/2treasure.png","screenshot":"1954\/de\/images\/2\/L\/2treasure.png","orientation":"P","device":"P"},{"thumbnail":"1954\/de\/images\/3\/L\/3treasure.png","screenshot":"1954\/de\/images\/3\/L\/3treasure.png","orientation":"P","device":"P"},{"thumbnail":"1954\/de\/images\/4\/L\/4treasure.png","screenshot":"1954\/de\/images\/4\/L\/4treasure.png","orientation":"P","device":"P"}]}