{"publicApplicationId":"com.appible.jesusthechrist","description":"\"One who gets the understanding, the vision, and the spirit of the resurrected Lord through a careful study of the text Jesus the Christ by Elder James E. Talmage will find that he has greatly increased his moving faith in our glorified Redeemer.\" -Marion G Romney In his preface to the first edition, Elder Talmage wrote: \"The author has departed from the course usually followed by writers on the Life of Jesus Christ, which course, as a rule, begins with the birth of Mary's Babe and ends with the ascension of the slain and risen Lord from Olivet. The treatment embodied in these pages, in addition to the narrative of the Lord's life in the flesh, comprises the antemortal existence and activities of the world's Redeemer, the revelations and personal manifestations of the glorified and exalted Son of God during the apostolic period of old and in modern times, the assured nearness of the Lord's second advent, and predicted events beyond-all so far as the Holy Scriptures make it plain. \"It is particularly congruous and appropriate that The Church of Jesus Christ of Latter-day Saints-the only Church that affirms authority based on specific revelation and commission to use the Lord's Holy Name as a distinctive designation-should set forth her doctrines concerning the Messiah and His mission.\"","version":"1.5.8","homeURL":"http:\/\/appible.com\/a\/contact","supportURL":"http:\/\/appible.com\/a\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/a\/contact","locale":null,"appSize":"1405328","installSize":"1405328","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"0.99","currency":"USD","filename":"com.appible.jesusthechrist_1.5.8_all.ipk","free":false,"images":[{"thumbnail":"1956\/de\/images\/1\/L\/jesusthechrist1.png","screenshot":"1956\/de\/images\/1\/L\/jesusthechrist1.png","orientation":"P","device":"P"},{"thumbnail":"1956\/de\/images\/2\/L\/Jesusthechrist2.png","screenshot":"1956\/de\/images\/2\/L\/Jesusthechrist2.png","orientation":"P","device":"P"},{"thumbnail":"1956\/de\/images\/3\/L\/Jesusthechrist3.png","screenshot":"1956\/de\/images\/3\/L\/Jesusthechrist3.png","orientation":"P","device":"P"},{"thumbnail":"1956\/de\/images\/4\/L\/Jesusthechrist4.png","screenshot":"1956\/de\/images\/4\/L\/Jesusthechrist4.png","orientation":"P","device":"P"}]}