{"publicApplicationId":"com.appible.olivertwist","description":"One of Dickens’ most enduringly popular stories is Oliver Twist, an early work published 1837-8. Like many of his later novels, its central theme is the hardship faced by the dispossessed and those of the outside of ‘polite’ society. Oliver himself is born in a workhouse and treated cruelly there as was the norm at the time for pauper children, in particular by Bumble, a parish council official or ‘beadle’. The story follows Oliver as he escapes the workhouse and runs away to London. Here he receives an education in villainy from the criminal gang of Fagin that includes the brutal thief Bill Sikes, the famous ‘Artful Dodger’ and Nancy, Bill’s whore. Oliver is rescued by the intervention of a benefactor - Mr Brownlow - but the mysterious Monks gets the gang to kidnap the boy again. Nancy intervenes but is murdered viciously by Sikes after she has showed some redeeming qualities and has discovered Monk’s sinister intention. The story closes happily and with justice for Bumble and the cruel Monks who has hidden the truth of Oliver’s parentage out of malice. Accusations were made that the book glamorised crime (like the ‘Newgate Group’ of the period) but Dickens wisely disassociated himself from criminal romances. His achievement was in fact in presenting the underworld and problems of poverty to the well-off in a way rarely attempted previously. -Bibliomania.com","version":"1.5.8","homeURL":"http:\/\/appible.com\/a\/contact","supportURL":"http:\/\/appible.com\/a\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/a\/contact","locale":null,"appSize":"807860","installSize":"807860","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"0.99","currency":"USD","filename":"com.appible.olivertwist_1.5.8_all.ipk","free":false,"images":[{"thumbnail":"1961\/de\/images\/1\/L\/1twistM.png","screenshot":"1961\/de\/images\/1\/L\/1twistM.png","orientation":"P","device":"P"},{"thumbnail":"1961\/de\/images\/2\/L\/2twistM.png","screenshot":"1961\/de\/images\/2\/L\/2twistM.png","orientation":"P","device":"P"},{"thumbnail":"1961\/de\/images\/3\/L\/3twistM.png","screenshot":"1961\/de\/images\/3\/L\/3twistM.png","orientation":"P","device":"P"},{"thumbnail":"1961\/de\/images\/4\/L\/4twistM.png","screenshot":"1961\/de\/images\/4\/L\/4twistM.png","orientation":"P","device":"P"}]}