{"publicApplicationId":"com.appible.commonsense","description":"Published anonymously by Thomas Paine in January of 1776, Common Sense was an instant best-seller, both in the colonies and in Europe. It went through several editions in Philadelphia, and was republished in all parts of United America. Because of it, Paine became internationally famous. Paine's political pamphlet brought the rising revolutionary sentiment into sharp focus by placing blame for the suffering of the colonies directly on the reigning British monarch, George III. First and foremost, Common Sense advocated an immediate declaration of independence, postulating a special moral obligation of America to the rest of the world. Not long after publication, the spirit of Paine's argument found resonance in the American Declaration of Independence. Written at the outset of the Revolution, Common Sense became the leaven for the ferment of the times. It stirred the colonists to strengthen their resolve, resulting in the first successful anticolonial action in modern history. Little did Paine realize that his writings would set fire to a movement that had seldom if ever been worked out in the Old World: sovereignty of the people and written constitutions, together with effective checks and balances in government. Paine has been described as a professional radical and a revolutionary propagandist without peer. Born in England, he was dismissed as an excise officer while lobbying for higher wages. Impressed by Paine, Benjamin Franklin sponsored Paine's emigration to America in 1774. In Philadelphia Paine became a journalist and essayist, contributing articles on all subjects to The Pennsylvania Magazine. After the publication of Common Sense, Paine continued to inspire and encourage the patriots during the Revolutionary War with a series of pamphlets entitled The American Crisis. Eventually, Paine went on to write The Rights of Man and The Age of Reason. But, it all started with Common Sense, the writing that sparked an American Revolution. -EarlyAmerica.com","version":"1.0.0","homeURL":"http:\/\/appible.com\/a\/contact","supportURL":"http:\/\/appible.com\/a\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/a\/contact","locale":null,"appSize":"216866","installSize":"216866","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"0.99","currency":"USD","filename":"com.appible.commonsense_1.0.0_all.ipk","free":false,"images":[{"thumbnail":"1967\/en\/images\/1\/L\/commonsense.png","screenshot":"1967\/en\/images\/1\/L\/commonsense.png","orientation":"P","device":"P"},{"thumbnail":"1967\/en\/images\/2\/L\/commonsense2.png","screenshot":"1967\/en\/images\/2\/L\/commonsense2.png","orientation":"P","device":"P"},{"thumbnail":"1967\/en\/images\/3\/L\/commonsense1.png","screenshot":"1967\/en\/images\/3\/L\/commonsense1.png","orientation":"P","device":"P"}]}