{"publicApplicationId":"com.spreadsong.freebooks2","description":"Ah, to describe an app in two words... Free Books is just that- Free Books! We take 23,469 classic books, package them up, and make them available to download and read with our included ereader. All for less than a cup of coffee.   Free Books unlocks a world of public domain content, allowing you to acquire the great books of human history. Letters of leaders, the collected works of geniuses, the finest Victorian novels, the plays of Shakespeare, the philosophy of Seneca and Marcus Aurelius, the autobiographies of Benjamin Franklin and Andrew Carnegie. It's all here, along with tens of thousands of other books. And all, might we belabor the point, absolutely free.   While you won't find recent books like Twilight or Harry Potter, you will find a mindboggling amount of classic titles from throughout the ages.   To get these books it really is as simple as a tap- in seconds you'll be reading with our lightning fast, built-in ereader. Done reading? No worries- we'll save your place with automatic bookmarking, and return to your spot when you pull up the app again. 23,469 of the greatest books in human history, accessible with the tap of your finger. Free.   If you have any questions or suggestions don't hesitate to drop us a line at hi@freebooksapp.com- that's what we're here for!   Also, we've had a few questions about pricing- to be clear, all books in the collection are included with your purchase. Once you pay for the application every single piece of content within the app is free- we aren't a store, we're a buffet, and the app purchase is your wristband to pig out on shrimp. And by shrimp, we mean books like, you know, Shakespeare. Tasty, tasty morsels of Shakespeare.   * Free Books requires internet access to download books, but after you download them you can read anywhere, even when you're not online. ","version":"1.0.1","versionNote":"","homeURL":"http:\/\/spreadsong.com","supportURL":"http:\/\/support.freebooksapp.com","custsupportemail":"hi@freebooksapp.com","custsupportphonenum":"..","copyright":"Copyright 2009-2010 Spreadsong, Inc.","licenseURL":"","locale":"en_US","appSize":75500,"installSize":3697751,"isEncrypted":false,"adultRating":false,"islocationbased":false,"lastModifiedTime":"2010-08-05T09:08:58.000+0000","mediaLink":null,"mediaIcon":null,"attributes":{"provides":{"noApp":false,"dockMode":false,"universalSearch":false,"connectors":[],"services":[],"optimizedUserExperience":false}},"price":1.99,"currency":"USD","isAdvertized":false,"filename":"com.spreadsong.freebooks2_1.0.1_all.ipk","free":false,"touchpad_exclusive":false,"images":{"1":{"thumbnail":"1990\/en\/images\/1\/S\/freebooks_2009-20-11_161026.jpg","screenshot":"1990\/en\/images\/1\/L\/freebooks_2009-20-11_161026.jpg","orientation":"P","device":"P"},"2":{"thumbnail":"1990\/en\/images\/2\/S\/freebooks_2009-20-11_161207.jpg","screenshot":"1990\/en\/images\/2\/L\/freebooks_2009-20-11_161207.jpg","orientation":"P","device":"P"},"3":{"thumbnail":"1990\/en\/images\/3\/S\/freebooks_2009-20-11_162107.png","screenshot":"1990\/en\/images\/3\/L\/freebooks_2009-20-11_162107.png","orientation":"P","device":"P"},"4":{"thumbnail":"1990\/en\/images\/4\/S\/freebooks_2009-20-11_162107.png","screenshot":"1990\/en\/images\/4\/L\/freebooks_2009-20-11_162107.png","orientation":"P","device":"P"}}}