{"publicApplicationId":"com.appible.ataleoftwocities","description":"A Tale of Two Cities (1859) is one of Dickens’ two historical novels, the other being Barnaby Rudge, the two cities in question are Paris and London at the time of the French Revolution. Perhaps unsurprisingly Dickens seems to disdain the aristocracy. The heroic nobleman, Charles Darnay, renounces his status in opposition to his uncle, the Marquis de St Evremonde, and the evils of oppression he represents. Meanwhile, Dr Manette the physician has become aware of the Marquis’ ill-practice through a young peasant and his sister who have been hideously treated. After Darnay leaves France, he falls in love with Manette’s daughter, Lucie, and they are married. The story continues after Darnay’s happiness with Lucie as he returns to France during the Terror to save a servant. Darnay is arrested and condemned to death. The final section of the novel is concerned with the question of whether he will survive or be punished for his noble act of rescue, and whether or not the Englishman Carton who resembles Darnay will be able to save his life. It is a story of great sacrifices being made for the sake of principle. The novel is notable for its vivid representation of France during this troubled time and was modeled on Carlyle’s The French Revolution. \"Bibliomania.com\"","version":"1.5.8","homeURL":"http:\/\/appible.com\/a\/contact","supportURL":"http:\/\/appible.com\/a\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/a\/contact","locale":null,"appSize":"1088702","installSize":"1088702","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"0.99","currency":"USD","filename":"com.appible.ataleoftwocities_1.5.8_all.ipk","free":false,"images":[{"thumbnail":"2004\/de\/images\/1\/L\/1tale2cities.png","screenshot":"2004\/de\/images\/1\/L\/1tale2cities.png","orientation":"P","device":"P"},{"thumbnail":"2004\/de\/images\/2\/L\/2tale2cities.png","screenshot":"2004\/de\/images\/2\/L\/2tale2cities.png","orientation":"P","device":"P"},{"thumbnail":"2004\/de\/images\/3\/L\/3tale2cities.png","screenshot":"2004\/de\/images\/3\/L\/3tale2cities.png","orientation":"P","device":"P"},{"thumbnail":"2004\/de\/images\/4\/L\/4tale2cities.png","screenshot":"2004\/de\/images\/4\/L\/4tale2cities.png","orientation":"P","device":"P"}]}