{"publicApplicationId":"com.appible.alicesadventuresinwonderland","description":"Read the classic novel by Lewis Carroll that inspired Disney's \"Alice in Wonderland\" movies! \"Lewis Carroll is best remembered for this story, Alice's Adventures in Wonderland and its sequel, Through the Looking Glass, both of which are children's books with content and style that have often appealed as much to adult readers as to the young. It was published in 1865 and was in fact with a particular child in mind, Alice Liddell, and had the working title \"Alice's Adventures Under Ground\". As befits that title, the tale is indeed of a trip (with the additional psychedelic sense certainly intact for the modern reader) beneath normal existence. Alice follows a certain White Rabbit down from the riverside in a dream. This alternate reality follows its own internal logic and is therefore not merely an excuse for fantasy. This logic is played out by now well-known characters such as the Mad Hatter, the Queen of Hearts, the Mock Turtle, the Cheshire Cat and the March Hare whose tea parties and games have taken their place in the folklore of the real world through generations of readers. The story has no moral dimension to speak of and is therefore unusual for nineteenth century children's literature, but it does extol caution and other common sense values in the often foolish choices made by Alice that take her deeper into the strange dimension. \" -Bibliomania.com","version":"1.5.8","homeURL":"http:\/\/appible.com\/a\/contact","supportURL":"http:\/\/appible.com\/a\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/a\/contact","locale":null,"appSize":"534628","installSize":"534628","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"0.99","currency":"USD","filename":"com.appible.alicesadventuresinwonderland_1.5.8_all.ipk","free":false,"images":[{"thumbnail":"2007\/de\/images\/1\/L\/alice1.png","screenshot":"2007\/de\/images\/1\/L\/alice1.png","orientation":"P","device":"P"},{"thumbnail":"2007\/de\/images\/2\/L\/alice2.png","screenshot":"2007\/de\/images\/2\/L\/alice2.png","orientation":"P","device":"P"},{"thumbnail":"2007\/de\/images\/3\/L\/alice3.png","screenshot":"2007\/de\/images\/3\/L\/alice3.png","orientation":"P","device":"P"},{"thumbnail":"2007\/de\/images\/4\/L\/alice4.png","screenshot":"2007\/de\/images\/4\/L\/alice4.png","orientation":"P","device":"P"},{"thumbnail":"2007\/de\/images\/5\/L\/alice5.png","screenshot":"2007\/de\/images\/5\/L\/alice5.png","orientation":"P","device":"P"}]}