{"publicApplicationId":"com.mvolution.hrs","description":"Weltweit mit dem Palm Pre Hotels suchen und buchen mit HRS\n\nDas vielfach ausgezeichnete HRS Hotelportal nun auch auf dem Palm Pre. Holen Sie sich 250.000 Hotels weltweit auf Ihr Handy und buchen Sie kinderleicht.\n\nSuchen Sie mit Ihrem Palm Pre in über 250.000 Hotels weltweit, prüfen Sie Verfügbarkeit und aktuellen Preis, und informieren Sie sich über Lage und Ausstattung der Angebote. Nutzen Sie dabei auch Hotel-Fotos und Gästebewertungen für Ihre Entscheidung. Buchen Sie kostenfrei mit der Palm Pre Hotel App von HRS direkt online das Hotel Ihrer Wahl zum besten Preis – auch in der letzten Minute. Bei vielen Hotels kann ohne Angabe von Kreditkarteninformationen gebucht und auch kostenfrei bis zum Anreisetag wieder storniert werden\n\nPraktische Funktionen:\n- Klassische Suchmaske und intuitive Bedienbarkeit\n\n- Die größte Auswahl - über 250.000 Hotels über die Palm Pre Hotel App von HRS verfügbar\n\n- Kurzfristig ein Hotelzimmer, direkt dort wo Sie es benötigen: Umkreissuche per GPS \n\n- Buchung teilweise ohne Kreditkarteninfos\n\n- Flexibler geht es nicht: Kostenlose Änderungen und Stornierungen bis 18 Uhr am Anreisetag\n\n- Entscheidungshilfen für Ihre Hotelbuchung: Umfangreiche Detailinformationen zu jedem Hotel mit der Palm Pre Hotel App abrufen.\n\n- 2,5 Mio. Hotelbewertungen von Gästen für Gäste\n\n- Optional für Firmenkunden: Spezielle Raten auch mobil nutzen, einfach HRS Firmenkundennummer eingeben\n\n- Speicherung des gebuchten Hotels in das Adressbuch, bei der nächsten Buchung dieses Hotels geht es dadurch noch schneller\n\n- Immer auf dem Laufenden:  Speicherung der An- und Abreisedaten der Hotelbuchung in den Terminkalender\n\n- Viel unterwegs? Den Überblick behält man mit dem Zugriff auf die Buchungshistorie\n\n- Pläne kurzfristig geändert, kein Problem auch die Stornierung einer Buchung (gemäß Stornierungsbedingungen) ist mobil möglich","version":"1.2.0","homeURL":"http:\/\/www.hrs.de","supportURL":"http:\/\/www.hrs.de","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 HRS - Hotel Reservation Service","licenseURL":"http:\/\/www.hrs.de","locale":null,"appSize":"292546","installSize":"292546","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":0,"currency":"USD","filename":"com.mvolution.hrs_1.2.0_all.ipk","free":true,"images":[{"thumbnail":"2022\/de\/images\/1\/L\/hrs_2010-05-03_171031.png","screenshot":"2022\/de\/images\/1\/L\/hrs_2010-05-03_171031.png","orientation":"P","device":"P"},{"thumbnail":"2022\/de\/images\/2\/L\/hrs_2010-08-03_123115.png","screenshot":"2022\/de\/images\/2\/L\/hrs_2010-08-03_123115.png","orientation":"P","device":"P"},{"thumbnail":"2022\/de\/images\/3\/L\/hrs_2010-08-03_122454.png","screenshot":"2022\/de\/images\/3\/L\/hrs_2010-08-03_122454.png","orientation":"P","device":"P"},{"thumbnail":"2022\/de\/images\/4\/L\/hrs_2010-08-03_122640.png","screenshot":"2022\/de\/images\/4\/L\/hrs_2010-08-03_122640.png","orientation":"P","device":"P"},{"thumbnail":"2022\/de\/images\/5\/L\/hrs_2010-08-03_122859.png","screenshot":"2022\/de\/images\/5\/L\/hrs_2010-08-03_122859.png","orientation":"P","device":"P"}]}