{"publicApplicationId":"com.glu.app.dragon","description":"NOW ON SALE!!\n\nONLY THE STRONG CAN BELONG! Take to the skies as Toothless, the sleek, stealthy, fire-breathing dragon, with his new friend, Hiccup, the Viking teenager who doesn't exactly fit in with his tribe's longstanding tradition of heroic dragon slayers.  Explore the expanded world from the Viking home Island of Berk to the sea and beautiful but forbidding lands beyond.  Plunge from the vast heavens above to the depths of subterranean caves.  Apply lessons from Dragon Training as dragon and rider form a unique bond together and master the art of flying.\n \nFLIGHT\nSoar through the skies while dashing through challenging obstacle courses and searching out ethereal Dragon Paths only visible to a dragon and its rider\n\nEXPLORATION\nJourney across the Isle of Berk and surrounding environments from the expanded world of How to Train Your Dragon\n\nACHIEVEMENTS\nChallenge your abilities by completing different tasks, besting the fastest flight times, and secretly carrying out missions to help the Viking village\n \n3D WORLD\nExperience beautiful 3D flying while performing diving spin maneuvers, ascending to the highest peaks and scanning the horizons from atop the dragon’s perches\n\nUNLOCKABLE EXTRAS\nUnlock secret achievements, including film stills and cheat codes\n\nCheck out other Glu Mobile titles - Guitar Hero 5, Deer Hunter 3D, Super KO Boxing! 2 and Glyder 2!","version":"1.0.0","homeURL":"http:\/\/www.glu.com\/support","supportURL":"http:\/\/www.glu.com\/support","custsupportemail":"","custsupportphonenum":"","copyright":"© 2010 DreamWorks Animation L.L.C.","licenseURL":"http:\/\/www.glu.com\/support","locale":null,"appSize":"29132074","installSize":"29132074","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"0.99","currency":"USD","filename":"com.glu.app.dragon_1.0.0_all.ipk","free":false,"images":[{"thumbnail":"2078\/icon\/S\/48x48.png","screenshot":"2078\/icon\/S\/48x48.png","orientation":"P","device":"P"}]}