{"publicApplicationId":"com.baonproductions.puzzlefunfree","description":"Now you can enjoy Puzzle Fun Free on the Palm Pixi and we've also added NEW puzzles! That's right, we've added 10 additional puzzles for your enjoyment, bringing the total puzzles to 20. Current users, just click update and the new puzzles will be added to your collection FREE OF CHARGE. Your existing data will not be lost. Pixi users, use the hint button to bring up the interface.  Use DRAG AND DROP technology to rearrange the pieces into their proper location.  Sample 10 levels of beautiful and stunning images brought to you by our lovely photographers. Stuck on an image?  Press H for a quick hint.  Still stuck?  Just skip the level.  You don't have to solve every puzzle to play the next one.  Stats are kept including your best time and number of times a puzzle was solved.   Beat all 10 puzzles and still haven't had enough? Download the FULL VERSION with CUSTOM PUZZLES. Puzzle Fun full version has 100 unique and beautiful levels to try out. Still haven't had enough? The full version comes with the ability to customize any picture! Choose an image from your photo album, and it will automatically create your puzzle.  Can't finish your custom puzzle?  Puzzle Fun will automatically save your custom puzzles for the next time you load your game. High score is included for custom puzzles as well! Please check out our website for additional games such as Navy Defense, Slalom Skiing, Whack-A-Molly, Chronic Attack, and Shooter.","version":"1.1.0","versionNote":"","homeURL":"http:\/\/www.baonproductions.com","supportURL":"http:\/\/www.baonproductions.com","custsupportemail":"info@baonproductions.com","custsupportphonenum":"703.867.8912","copyright":"Copyright 2010 Baon Productions","licenseURL":"","locale":"en_US","appSize":994528,"installSize":4512992,"isEncrypted":false,"adultRating":false,"islocationbased":false,"lastModifiedTime":"2010-06-21T19:30:52.000+0000","mediaLink":null,"mediaIcon":null,"attributes":{"provides":{"noApp":false,"dockMode":false,"universalSearch":false,"connectors":[],"services":[],"optimizedUserExperience":false}},"price":0,"currency":"USD","isAdvertized":false,"filename":"com.baonproductions.puzzlefunfree_1.1.0_all.ipk","free":false,"touchpad_exclusive":false,"images":{"1":{"thumbnail":"2083\/en\/images\/1\/S\/puzzlefunfreess1.png","screenshot":"2083\/en\/images\/1\/L\/puzzlefunfreess1.png","orientation":"P","device":"P"},"2":{"thumbnail":"2083\/en\/images\/2\/S\/puzzlefunfreess2.png","screenshot":"2083\/en\/images\/2\/L\/puzzlefunfreess2.png","orientation":"P","device":"P"},"3":{"thumbnail":"2083\/en\/images\/3\/S\/puzzlefunfreess3.png","screenshot":"2083\/en\/images\/3\/L\/puzzlefunfreess3.png","orientation":"P","device":"P"}}}