{"publicApplicationId":"com.dblpartners.apushistory","description":"Upward Mobility's U.S. History Exam Prep software for Palm's webOS  is a tool to help students properly prepare for the multiple choice sections of the AP, SAT II and CLEP exams.     The module covers the founding of the New World up through Bill Clinton's administration, with 150 realistic questions that address nearly all of the topics covered on the exam. Each question is followed by a clear and thoughtful explanation, paired with a Key Takeaway.   The key takeaway summarizes the key learning point of the question, ensuring comprehensive understanding of the material.  Whether you are taking the test for the first time, or striving to improve your score, this app will be a useful component of your test preparation.  Author:  Katie McConnaughey is a freelance writer and editor based in Seattle, Washington. She received her BA in History from Mount Holyoke College.  Kate has worked in the publishing industry, focusing primarily on children's and young adult fiction and non-fiction. Since going freelance in 2007, Katie has edited and written for a large variety of clients, including Simon & Schuster, Alloy Entertainment, becker&mayer! book producers, Symphony Space, diacriTech, the New York City Department of Health & Mental Hygiene, and a number of private clients.  About Upward Mobility  Upward Mobility creates high end professional education content for management development and test preparation, and makes it available through mobile apps. Our goal is to keep learners engaged with a mix of wit, humor, and actionable takeaways while meeting our customer’s educational needs. We are a double bottom line company that is committed to education in the developing world. Some of the profits will be used to deploy education via mobile phone in emerging countries to improve their total factor productivity growth. ","version":"1.0.1","versionNote":"","homeURL":"http:\/\/www.upwardpro.com","supportURL":"http:\/\/www.upwardpro.com","custsupportemail":"info@upwardpro.com","custsupportphonenum":"..","copyright":"DBL Partners LLC","licenseURL":"","locale":"en_US","appSize":196892,"installSize":3232291,"isEncrypted":false,"adultRating":false,"islocationbased":false,"lastModifiedTime":"2010-03-16T13:22:21.000+0000","mediaLink":null,"mediaIcon":null,"attributes":{"provides":{"noApp":false,"dockMode":false,"universalSearch":false,"connectors":[],"services":[],"optimizedUserExperience":false}},"price":3.99,"currency":"USD","isAdvertized":false,"filename":"com.dblpartners.apushistory_1.0.1_all.ipk","free":false,"touchpad_exclusive":false,"images":{"1":{"thumbnail":"2142\/en\/images\/1\/S\/1.jpg","screenshot":"2142\/en\/images\/1\/L\/1.jpg","orientation":"P","device":"P"},"2":{"thumbnail":"2142\/en\/images\/2\/S\/2.jpg","screenshot":"2142\/en\/images\/2\/L\/2.jpg","orientation":"P","device":"P"},"3":{"thumbnail":"2142\/en\/images\/3\/S\/3.jpg","screenshot":"2142\/en\/images\/3\/L\/3.jpg","orientation":"P","device":"P"},"4":{"thumbnail":"2142\/en\/images\/4\/S\/4.jpg","screenshot":"2142\/en\/images\/4\/L\/4.jpg","orientation":"P","device":"P"},"5":{"thumbnail":"2142\/en\/images\/5\/S\/5.jpg","screenshot":"2142\/en\/images\/5\/L\/5.jpg","orientation":"P","device":"P"}}}