{"publicApplicationId":"com.dblpartners.matpro","description":"Upward Mobility’s Miller Analogies Test for Palm's webOS is a valuable tool written by test prep experts to help you excel on the MAT exam. \n  With 400 analogies with detailed explanations, we recommend this tool as a supplemental study tool or practice test for those who want to improve their skill level on analogies.  \n  *   \nThis application contains 200 analogies on various MAT topics in the MAT format, and 200 vocabulary building analogies.  The 200 MAT analogies cover diverse topics such as math, humanities, history, geography, art and other potential exam topics.  The vocabulary section contains advanced words with detailed definitions while providing extra analogy practice.  \n  ||   \nThe Miller Analogies Test (MAT), published by Harcourt Assessment, measures a graduate school candidate's analytical ability. The candidate must solve problems presented in the form of analogies. The MAT is accepted at many graduate school programs as an alternative to the GRE.\n  *  \nThis app is not affiliated with Harcourt Associates.\n  ||  \nUpward Mobility creates high end professional educational content for management development and test preparation, and makes it available through mobile apps. Our goal is to keep learners engaged with a mix of wit, humor and actionable takeaways while meeting our customer's specific educational needs.\n  *  \nWe are a double bottom line company that is committed to education in the developing world. Some of the profits will be used to deploy education via mobile phone in emerging countries to improve their total factor productivity growth.\n   *  \nUpward Mobility cares out its products, and you can contact us from the home screen of all of our apps.","version":"2.0.0","versionNote":"Major content overhaul, providing more precise analogies with clearer explanations.","homeURL":"http:\/\/upwardpro.com","supportURL":"http:\/\/upwardpro.com","custsupportemail":"info@upwardpro.com","custsupportphonenum":"","copyright":"DBL Partners LLC","licenseURL":"","locale":"en_US","appSize":165348,"installSize":2064384,"isEncrypted":false,"adultRating":false,"islocationbased":false,"lastModifiedTime":"2012-06-01T12:27:53.000+0000","mediaLink":null,"mediaIcon":null,"attributes":{"provides":{"noApp":false,"dockMode":false,"universalSearch":false,"connectors":["null"],"services":[],"optimizedUserExperience":false}},"price":4.99,"currency":"USD","isAdvertized":false,"filename":"com.dblpartners.matpro_2.0.0_all.ipk","free":false,"touchpad_exclusive":false,"images":{"1":{"screenshot":"2144\/2.0.0\/en\/images\/1\/L\/1.png","thumbnail":"2144\/2.0.0\/en\/images\/1\/L\/1.png","orientation":"P","device":"P"},"2":{"screenshot":"2144\/2.0.0\/en\/images\/2\/L\/2.png","thumbnail":"2144\/2.0.0\/en\/images\/2\/L\/2.png","orientation":"P","device":"P"},"3":{"screenshot":"2144\/2.0.0\/en\/images\/3\/L\/3.png","thumbnail":"2144\/2.0.0\/en\/images\/3\/L\/3.png","orientation":"P","device":"P"},"4":{"screenshot":"2144\/2.0.0\/en\/images\/4\/L\/4.png","thumbnail":"2144\/2.0.0\/en\/images\/4\/L\/4.png","orientation":"P","device":"P"},"5":{"screenshot":"2144\/2.0.0\/en\/images\/5\/L\/5.png","thumbnail":"2144\/2.0.0\/en\/images\/5\/L\/5.png","orientation":"P","device":"P"}}}