{"publicApplicationId":"com.dblpartners.casemaestro","description":"This app for Palm's webOS contains 256 questions to prepare you for management consulting case interviews.  If you want to optimize your chances of landing a strategy consulting position, Case Maestro was designed for you.  The package is designed to be a concise module to hone the skills necessary to perform well in case format interviews.  Each answer in our module is paired with a Key Takeaway to bridge the gap between conceptual knowledge and practical application.\n\nAuthor:\n\nCase Maestro’s primary editor and writer was Ted Chan, who holds a MBA from the MIT Sloan School of Management, and has 9 years of strategy consulting experience.  Ted is also an experienced writer and editor with over 50 credits, including ESPN.com.\n\nBreakdown:\n\n72 strategy questions – Covers a wide range of strategy consulting vocabulary and concepts ranging from strategic frameworks to economics.  \n\n15 estimating\/facts to know – Practice your estimating skills and learn a few key numbers that will help you in market sizing questions.\n\n42 fast math – A systematic quick math module to help you perform case calculations faster.  These 42 questions cover short cuts for decimals, multiplication, division, percentages and other key mathematical concepts for business.  \n\n9 bonus questions – These were oddballs and tips we thought would help you succeed as we were writing this module.  They didn’t fit in any of the above categories, but we wanted to include them anyhow.\n\n118 financial accounting questions - For those who need a refresher on the basics of accounting, we have now included a module.\n\nGreat for your interviews at firms such as McKinsey, Bain, BCG, Monitor, Booz, Mercer, LEK, Deloitte, Oliver Wyman, CSMG, Gartner, BearingPoint, Watson Wyatt, Roland Berger, ZS Associates, PRTM, Aon, Analysis Group, AT Kearney and PWC. ","version":"1.0.2","versionNote":"","homeURL":"http:\/\/www.upwardpro.com","supportURL":"http:\/\/www.upwardpro.com","custsupportemail":"info@upwardpro.com","custsupportphonenum":"..","copyright":"DBL Partners LLC","licenseURL":"","locale":"en_US","appSize":424352,"installSize":3854909,"isEncrypted":false,"adultRating":false,"islocationbased":false,"lastModifiedTime":"2012-06-01T00:26:34.000+0000","mediaLink":null,"mediaIcon":null,"attributes":{"provides":{"noApp":false,"dockMode":false,"universalSearch":false,"connectors":["null"],"services":[],"optimizedUserExperience":false}},"price":8.99,"currency":"USD","isAdvertized":false,"filename":"com.dblpartners.casemaestro_1.0.2_all.ipk","free":false,"touchpad_exclusive":false,"images":{"1":{"screenshot":"2185\/1.0.2\/en\/images\/1\/L\/1.jpg","thumbnail":"2185\/1.0.2\/en\/images\/1\/L\/1.jpg","orientation":"P","device":"P"},"2":{"screenshot":"2185\/1.0.2\/en\/images\/2\/L\/2.jpg","thumbnail":"2185\/1.0.2\/en\/images\/2\/L\/2.jpg","orientation":"P","device":"P"},"3":{"screenshot":"2185\/1.0.2\/en\/images\/3\/L\/3.jpg","thumbnail":"2185\/1.0.2\/en\/images\/3\/L\/3.jpg","orientation":"P","device":"P"},"4":{"screenshot":"2185\/1.0.2\/en\/images\/4\/L\/4.jpg","thumbnail":"2185\/1.0.2\/en\/images\/4\/L\/4.jpg","orientation":"P","device":"P"},"5":{"screenshot":"2185\/1.0.2\/en\/images\/5\/L\/5.jpg","thumbnail":"2185\/1.0.2\/en\/images\/5\/L\/5.jpg","orientation":"P","device":"P"}}}