{"publicApplicationId":"com.dblpartners.cbap","description":"Upward Mobility’s CBAP Exam Prep for webOS contains a targeted curriculum of 169 questions to address key topics for business analysts with actionable learning points.  Use this as a review, refresher or last minute review for the valuable Certified Business Analysis Professional designation from the IIBA.  This app is based on the latest version of the BABoK.  The primary editor for the content was Ted Chan, an experienced consultant who holds a MBA from MIT’s Sloan School of Management.   This app contains expertly structured questions with detailed answers targeted to provide actionable career takeaways to help you create value and have a fulfilling career as business analyst.   The intuitive Study Mode interface allows you to track your progress and circle back to questions for later review. Test Mode allows you to take the course as a sample CBAP exam and quickly review incorrect answers.  What is the CBAP?  The International Institute of Business Analysis (IIBA) certifies expertise in   Business Analysis.  The IIBA is the first organization to offer formal certification for Business Analysis Professionals.  This certification is widely recognized by employers and clients.  About Upward Mobility  Upward Mobility creates high end professional educational content for management development and test preparation, and makes it available through mobile apps. Our goal is to keep learners engaged with a mix of wit, humor and actionable takeaways while meeting our customer's specific educational needs.  We are a double bottom line company that is committed to education in the developing world. Some of the profits will be used to deploy education via mobile phone in emerging countries to improve their total factor productivity growth. ","version":"1.0.1","versionNote":"","homeURL":"http:\/\/www.upwardpro.com","supportURL":"http:\/\/www.upwardpro.com","custsupportemail":"info@upwardpro.com","custsupportphonenum":"..","copyright":"DBL Partners LLC","licenseURL":"","locale":"en_US","appSize":120568,"installSize":2994436,"isEncrypted":false,"adultRating":false,"islocationbased":false,"lastModifiedTime":"2010-03-22T14:01:17.000+0000","mediaLink":null,"mediaIcon":null,"attributes":{"provides":{"noApp":false,"dockMode":false,"universalSearch":false,"connectors":[],"services":[],"optimizedUserExperience":false}},"price":4.99,"currency":"USD","isAdvertized":false,"filename":"com.dblpartners.cbap_1.0.1_all.ipk","free":false,"touchpad_exclusive":false,"images":{"1":{"thumbnail":"2216\/en\/images\/1\/S\/1.jpg","screenshot":"2216\/en\/images\/1\/L\/1.jpg","orientation":"P","device":"P"},"2":{"thumbnail":"2216\/en\/images\/2\/S\/2.jpg","screenshot":"2216\/en\/images\/2\/L\/2.jpg","orientation":"P","device":"P"},"3":{"thumbnail":"2216\/en\/images\/3\/S\/3.jpg","screenshot":"2216\/en\/images\/3\/L\/3.jpg","orientation":"P","device":"P"},"4":{"thumbnail":"2216\/en\/images\/4\/S\/4.jpg","screenshot":"2216\/en\/images\/4\/L\/4.jpg","orientation":"P","device":"P"},"5":{"thumbnail":"2216\/en\/images\/5\/S\/5.jpg","screenshot":"2216\/en\/images\/5\/L\/5.jpg","orientation":"P","device":"P"}}}