{"publicApplicationId":"com.palm.app.mobilehotspot","description":"Verwandelt Ihr Palm webOS™-Handy im Handumdrehen in einen WLAN-Hotspot für bis zu fünf Geräte. Sie können unterwegs mit Ihrem Laptop auf das Internet zugreifen und Ihre Internetverbindung gleichzeitig mit Freunden oder Kollegen teilen. Diese von Palm speziell für die webOS™-Plattform entwickelte Anwendung ist einfach konfigurierbar und benutzerfreundlich. Damit erhalten Sie ein Handy und einen Wi-Fi-Router in einem Gerät und können an jedem beliebigen Ort einen WLAN-Hotspot einrichten.\n\nHinweis: Die Anwendung erfordert eine schnelle Datenverbindung von Ihrem Mobilfunkanbieter; Sie sollten sie nicht benutzen, während Sie roamen. Eine Datenoption mit unbegrenzter Nutzung wird nachdrücklich empfohlen, da andernfalls zusätzliche Datenkosten anfallen können. Weitere Informationen erhalten Sie von Ihrem Mobilfunkanbieter. Nur innerhalb des Empfangsbereichs Ihres Mobilfunkanbieters verfügbar. Während der Palm WLAN-Hotspot aktiv ist, funktionieren die auf Ihrem Handy installierten Anwendungen wie gewohnt; die übertragene Datenmenge wird von der Datenpauschale für den WLAN-Hotspot abgezogen (falls zutreffend). Klicken Sie auf den Support-Link, um weitere Informationen zu erhalten.","version":"1.1.12","homeURL":"http:\/\/www.hpwebos.com","supportURL":"http:\/\/www.hpwebos.com","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2009-2011 Palm, Inc.","licenseURL":"http:\/\/www.hpwebos.com","locale":null,"appSize":"201900","installSize":"201900","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":0,"currency":"USD","filename":"com.palm.app.mobilehotspot_1.1.12_all.ipk","free":true,"images":[{"thumbnail":"com.palm.app.mobilehotspot\/1.1.12\/de\/images\/1\/L\/ph_MHS_1.png","screenshot":"com.palm.app.mobilehotspot\/1.1.12\/de\/images\/1\/L\/ph_MHS_1.png","orientation":"P","device":"P"},{"thumbnail":"com.palm.app.mobilehotspot\/1.1.12\/de\/images\/2\/L\/ph_MHS_2.png","screenshot":"com.palm.app.mobilehotspot\/1.1.12\/de\/images\/2\/L\/ph_MHS_2.png","orientation":"P","device":"P"}]}