{"publicApplicationId":"com.nanto.breadcrumbs","description":"Breadcrumbs v1.1 is an application that allows you to create adventures, and keep track of your path by dropping breadcrumbs along the way. It is GPS enabled and integrates with the Google Maps API v3 which should provide better performance.\n\nStart your adventure by going to the dropdown menu and choosing the \"Start Adventure\" option. Once an adventure has started, you can drop a breadcrumb and a note at any time by clicking on a button. You can also see your current location on the map by clicking on a button.\n\nIf you are using this as you go camping or hiking, keep track of your starting location, where you leave your car, where you pitch your tent, where exciting spots are along your hike, etc.  Or use it in the city to identify good restaurants, cool tourist sites, or historical spots of interest.\n\nTo adjust the zoom levels of the map, click the zoom in button, or click the zoom out button. \n\nIf you want to see the breadcrumbs you have already dropped, use the bread crumb cycle buttons. \n\nTo see a list of past adventures, click on the breadcrumbs drop down menu, and select the \"Adventures\" item. This will show you a list of past adventures that you can reload. Once you have reloaded an adventure, you can continue to add breadcrumbs to that adventure. You can also delete old adventures from this page. Remember that there is a limit to 25 adventures that you can have stored. \n\nThis application uses your current physical location and requires that your palm GPS in enabled and that you have access to the internet.","version":"1.1.0","versionNote":"","homeURL":"http:\/\/palmbreadcrumbs.wordpress.com\/","supportURL":"http:\/\/palmbreadcrumbs.wordpress.com\/","custsupportemail":"palmbreadcrumbs@gmail.com","custsupportphonenum":"..","copyright":"Copyright (c) 2010 Daniel A Nanto","licenseURL":"","locale":"en_US","appSize":975538,"installSize":3639452,"isEncrypted":false,"adultRating":false,"islocationbased":true,"lastModifiedTime":"2012-06-01T01:26:37.000+0000","mediaLink":"http:\/\/www.youtube.com\/watch?v=cyDeD-9IZy0","mediaIcon":"http:\/\/img.youtube.com\/vi\/cyDeD-9IZy0\/2.jpg","attributes":{"provides":{"noApp":false,"dockMode":false,"universalSearch":false,"connectors":["null"],"services":[],"optimizedUserExperience":false}},"price":0.99,"currency":"USD","isAdvertized":false,"filename":"com.nanto.breadcrumbs_1.1.0_all.ipk","free":false,"touchpad_exclusive":false,"images":{"1":{"screenshot":"2448\/1.1.0\/en\/images\/1\/L\/mapScreen.png","thumbnail":"2448\/1.1.0\/en\/images\/1\/L\/mapScreen.png","orientation":"P","device":"P"},"2":{"screenshot":"2448\/1.1.0\/en\/images\/2\/L\/dropScreen.png","thumbnail":"2448\/1.1.0\/en\/images\/2\/L\/dropScreen.png","orientation":"P","device":"P"},"3":{"screenshot":"2448\/1.1.0\/en\/images\/3\/L\/mapScreen2.png","thumbnail":"2448\/1.1.0\/en\/images\/3\/L\/mapScreen2.png","orientation":"P","device":"P"}}}