{"publicApplicationId":"com.desimone.remotetstat","description":"Following the successful debut of Remote Thermostat, a professional version of Remote Thermostat is now available: Remote Thermostat Pro.  Remote Thermostat Pro allows users to interact with model NT Series Thermostats manufactured by Proliphix™.  The Remote Thermostat application is specifically designed for models NT10e, NT20e, NT120e\/h, NT130e\/h, NT150e\/h, and NT160e\/h.  Remote Thermostat Pro provides an easy-to-use interface to check the status and adjust the settings of the Proliphix™ thermostat for the professional or advanced home user. The application includes all the features of Remote Thermostat, plus a number of new enhancements:  - Manage up to three thermostats - View temperature readings of remote sensors (for thermostats with optional sensor devices) - Control the fan mode - Change the day-class scheduling for the default week - Change heat and cool settings for each day class - View analytical reports for each thermostat - Customize thermostat status scene ***UPDATE (v2.0.1)*** Fixed listing of Special Days.  Please note that Remote Thermostat and Remote Thermostat Pro are not affiliated with Proliphix™.  These applications were not developed by Proliphix™, and as such, Proliphix™ does not provide support for them.   If you have any questions or require technical support, please send an email to support@remote-thermostat.com. If you would like to see additional functionality added to the Remote Thermostat Pro application, please send requests or recommendations to rfe@remote-thermostat.com. Your input will help ensure the Remote Thermostat Pro application is as beneficial and easy-to-use as possible.   Thank you – I hope you enjoy this mobile application!  Michael H. DeSimone Developer of Remote Thermostat & Remote Thermostat Pro  Proliphix and the Proliphix NT Series are trademarks of Proliphix, Inc. All rights reserved.","version":"2.0.1","homeURL":"http:\/\/www.remote-thermostat.com","supportURL":"http:\/\/www.remote-thermostat.com","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 DeSimone","licenseURL":"http:\/\/www.remote-thermostat.com","locale":null,"appSize":"94824","installSize":"94824","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"3.99","currency":"USD","filename":"com.desimone.remotetstat_2.0.1_all.ipk","free":false,"images":[{"thumbnail":"2464\/en\/images\/1\/L\/TSTATSettings.png","screenshot":"2464\/en\/images\/1\/L\/TSTATSettings.png","orientation":"P","device":"P"},{"thumbnail":"2464\/en\/images\/2\/L\/TSTATStatus.png","screenshot":"2464\/en\/images\/2\/L\/TSTATStatus.png","orientation":"P","device":"P"},{"thumbnail":"2464\/en\/images\/3\/L\/TSTATFunctions.png","screenshot":"2464\/en\/images\/3\/L\/TSTATFunctions.png","orientation":"P","device":"P"},{"thumbnail":"2464\/en\/images\/4\/L\/DayPlanner.png","screenshot":"2464\/en\/images\/4\/L\/DayPlanner.png","orientation":"P","device":"P"},{"thumbnail":"2464\/en\/images\/5\/L\/Menu.png","screenshot":"2464\/en\/images\/5\/L\/Menu.png","orientation":"P","device":"P"}]}