{"publicApplicationId":"net.wizardapps.weatherman","description":"Weatherman is the only Palm app that allows you to view weather information right from your Palm desktop background.  Unlike other weather applications which require you to start an app or keep a card running to see current weather forecasts, Weatherman automatically provides convenient four day weather forecast information overlaid directly on top of your own wallpaper. There is no need to start an app or keep one running in a card, and battery life is preserved because Weatherman only once an hour to update the background.  Everything happens automatically -- set it and forget it!  Every time you turn on your phone you will see the latest weather information for the city of your choice or you can select GPS location and Weatherman will update the forecast to your current location every hour.   Another feature, unique to Weatherman, is that your forecasts are available even from the phone’s lock screen. This means you can quickly turn on your phone and glance at the forecast without unlocking your phone!\n\nVersion 2.0 has a completely re-written forecasting service to ensure accurate and reliable updates twenty four hours a day.  Users may use the GPS built into their phone to automatically set the forecast to their current location and new to version 2.0, users can now obtain weather forecasts for any major city around the world!","version":"2.0.6","homeURL":"http:\/\/support.wizardapps.net\/","supportURL":"http:\/\/support.wizardapps.net\/","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2011 WizardApps","licenseURL":"http:\/\/support.wizardapps.net\/","locale":null,"appSize":"79422","installSize":"79422","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.99","currency":"USD","filename":"net.wizardapps.weatherman_2.0.6_all.ipk","free":false,"images":[{"thumbnail":"net.wizardapps.weatherman\/2.0.6\/en\/images\/1\/L\/ph_Unknown.jpeg","screenshot":"net.wizardapps.weatherman\/2.0.6\/en\/images\/1\/L\/ph_Unknown.jpeg","orientation":"P","device":"P"},{"thumbnail":"net.wizardapps.weatherman\/2.0.6\/en\/images\/2\/L\/ph_open-uri20101216-27073-vxr0f3-0..jpeg","screenshot":"net.wizardapps.weatherman\/2.0.6\/en\/images\/2\/L\/ph_open-uri20101216-27073-vxr0f3-0..jpeg","orientation":"P","device":"P"},{"thumbnail":"net.wizardapps.weatherman\/2.0.6\/en\/images\/3\/L\/ph_Unknown-1.jpeg","screenshot":"net.wizardapps.weatherman\/2.0.6\/en\/images\/3\/L\/ph_Unknown-1.jpeg","orientation":"P","device":"P"}]}