{"publicApplicationId":"com.glu.app.glyder2-free","description":"\"ONE OF THE YEAR'S BEST GAMES\" - Pocket Gamer   Eryn once again finds herself in a foreign dimension and needs your help to unlock the mysteries of her new environment in an effort find a way back home. Soar through the skies and swoop through tight caverns to explore the wondrous mysteries throughout the land. Customize your adventure by uncovering and collecting all new sets of wings and outfits. In Glyder’s open expansive world, choose your own game experience: explore at your own pace without time constraints or tackle goal-oriented achievements and challenges!   Get the FULL VERSION to access these features:  EXPLORE 6 NEW WORLDS USING PICK-UP-AND-PLAY TILT CONTROLS  Journey through the bitter cold of Arctasia, Discover the hidden mysteries of Oasis, Navigate the treacherous terrain of Magma Core, Marvel at the wonders of Spiral Heights, Uncover the depths of Sporelle, and Rise into orbit in Ascension.   CUSTOMIZE ERYN  Collect an assortment of special wings & outfits. Utilize the abilities of each set of wings to aide in your adventure. Use the Phoenix wings to store boost crystals, charge the Albatross wings while inside of thermals, and strap on the Energy wings to make item collection a breeze.   CHALLENGE YOURSELF WITH NEW MINI-GAMES AND PUZZLES 18  All new trips include waypoint rings for exciting new routes around each world. Master the flight path and record your best scores! Fly to Perpetua for a completely unique experience as you fly faster and faster through an obstacle course. How many laps can you complete?  CHECK OUT other Glu games: -Super KO Boxing 2 -Family Guy: Uncensored -How To Train Your Dragon Mobile Game -WSOP: Texas Hold'em Legend -Deer Hunter 3D -Guitar Hero 5  FOLLOW US at twitter.com\/glumobile facebook.com\/glumobile","version":"1.0.0","versionNote":"","homeURL":"http:\/\/www.glu.com\/","supportURL":"http:\/\/www.glu.com\/support","custsupportemail":"glyder2free-p@glu.com","custsupportphonenum":"..","copyright":"© Copyright 2010 Glu Mobile","licenseURL":"","locale":"en_US","appSize":32663648,"installSize":34054796,"isEncrypted":false,"adultRating":false,"islocationbased":false,"lastModifiedTime":"2010-04-15T09:27:33.000+0000","mediaLink":"http:\/\/www.youtube.com\/watch?v=NhTlsGmuCFo","mediaIcon":"http:\/\/img.youtube.com\/vi\/NhTlsGmuCFo\/2.jpg","attributes":{"provides":{"noApp":false,"dockMode":false,"universalSearch":false,"connectors":[],"services":[],"optimizedUserExperience":false}},"price":0,"currency":"USD","isAdvertized":false,"filename":"com.glu.app.glyder2-free_1.0.0_all.ipk","free":false,"touchpad_exclusive":false,"images":{"1":{"thumbnail":"2508\/en\/images\/1\/S\/HomePage2.jpg","screenshot":"2508\/en\/images\/1\/L\/HomePage2.jpg","orientation":"P","device":"P"},"2":{"thumbnail":"2508\/en\/images\/2\/S\/screen1.jpg","screenshot":"2508\/en\/images\/2\/L\/screen1.jpg","orientation":"P","device":"P"},"3":{"thumbnail":"2508\/en\/images\/3\/S\/screen2.jpg","screenshot":"2508\/en\/images\/3\/L\/screen2.jpg","orientation":"P","device":"P"},"4":{"thumbnail":"2508\/en\/images\/4\/S\/screen3.jpg","screenshot":"2508\/en\/images\/4\/L\/screen3.jpg","orientation":"P","device":"P"},"5":{"thumbnail":"2508\/en\/images\/5\/S\/HomePage3.jpg","screenshot":"2508\/en\/images\/5\/L\/HomePage3.jpg","orientation":"P","device":"P"}}}