{"publicApplicationId":"com.jackpot.fortunecookie","description":"***webOS 2.x \/ VEER \/ PIXI compatible! Fortune Cookie is as easy as tap, tap, flick...Tap for a fortune, get Truly Random lucky numbers. Easily choose a maximum number. Play the lucky numbers for Lotto, hey you never know. Even share your fortune with your friends and family via TEXT \/ IM or E-Mail. Even easily TWEET your fortune! Just register your phone on Twitter, create a new contact, use the Twitter Short Code for the phone number, (e.g. 40404 in U.S.) check here: http:\/\/help.twitter.com\/forums\/59008\/entries\/14226) then Text your fortune to the contact with the Twitter short code. Fortune Cookie has over 500 unique fortunes. And Fortune Cookie just got a whole lot smarter… it knows where you are and by simply tapping on the Chinese food take-out container on the top right of the title bar, you will automatically be taken to a Google map of the local Chinese food locations in your area. Fortune Cookie, for webOS, is the quickest way imaginable to find Chinese Food wherever you are... it uses GPS location and Google Maps, one TAP is all it takes. From the map you can view all of the plotted locations within a few miles of your current location, tap the “Results” button and see the locations all listed with the name and address and reviews \/ ratings if they were submitted. Tap on any result in the list, and see the actual reviews, phone number, ratings and get directions. The directions link will automatically know your location, since your Fortune Cookie told it so. The origin of the real fortune cookie is a subject of great debate. Some believe it was used to conceal messages and coordinate an uprising that led to the Ming Dynasty. It's origin is as mysterious as many of the messages contained inside \"or in bed\" :)  Fortune Cookie for webOS is the Fortune Cookie that keeps on giving. Help is always available through the app menu on the main screen, see Faq or E-Mail us with questions, comments, or suggestions. Enjoy your Fortune Cookie now!!!","version":"1.0.5","versionNote":"","homeURL":"http:\/\/jackpotideas.com","supportURL":"http:\/\/jackpotideas.com","custsupportemail":"support@jackpotideas.com","custsupportphonenum":"","copyright":"Copyright 2010 J@ckpot ideas Inc.","licenseURL":"","locale":"en_US","appSize":888272,"installSize":6258688,"isEncrypted":false,"adultRating":false,"islocationbased":true,"lastModifiedTime":"2012-06-01T12:26:50.000+0000","mediaLink":null,"mediaIcon":null,"attributes":{"provides":{"noApp":false,"dockMode":false,"universalSearch":false,"connectors":["null"],"services":[],"optimizedUserExperience":false}},"price":0.99,"currency":"USD","isAdvertized":false,"filename":"com.jackpot.fortunecookie_1.0.5_all.ipk","free":false,"touchpad_exclusive":false,"images":{"1":{"screenshot":"260\/1.0.5\/en\/images\/1\/L\/ph_fortunecookie.png","thumbnail":"260\/1.0.5\/en\/images\/1\/S\/ph_fortunecookie.png","orientation":"P","device":"P"},"2":{"screenshot":"260\/1.0.5\/en\/images\/2\/L\/ph_email.png","thumbnail":"260\/1.0.5\/en\/images\/2\/S\/ph_email.png","orientation":"P","device":"P"},"3":{"screenshot":"260\/1.0.5\/en\/images\/3\/L\/ph_map.png","thumbnail":"260\/1.0.5\/en\/images\/3\/S\/ph_map.png","orientation":"P","device":"P"},"4":{"screenshot":"260\/1.0.5\/en\/images\/4\/L\/ph_fortunecookie_send.png","thumbnail":"260\/1.0.5\/en\/images\/4\/S\/ph_fortunecookie_send.png","orientation":"P","device":"P"},"5":{"screenshot":"260\/1.0.5\/en\/images\/5\/L\/ph_fortunecookiefaq.png","thumbnail":"260\/1.0.5\/en\/images\/5\/S\/ph_fortunecookiefaq.png","orientation":"P","device":"P"}}}