{"publicApplicationId":"com.mobileappmakerscom.pocketplaylists","description":"*** IMPORTANT BUG FIX.  This version corrects the issue of songs not playing continuously for Pixi users. *** Create your own playlists using the library of music already on your device.  No need for an internet connection...no limits...your playlists are only a few taps away!  Are you heading out to the gym? Are you about to take a long car trip? Planning a party and need the right music mix? In the mood for romance? Do you want to listen to your favorite rock, indie, and country tunes together?  POCKET PLAYLISTS IS THE ANSWER!  Create as many playlists as you can imagine, NO LIMITS! Add any number of songs to your playlists in any order you like, without ever pausing your music. Reorder songs in your playlist \"on the fly\" by dragging and dropping, without ever pausing your music. Delete entire playlists or individual songs from a playlist without affecting the music on your device. Featuring the WebOS Media Picker, you can search for songs with ease.  Simply tap the “Add Song” button and you will be presented with a list of all the tunes on your device.  Type any part of a song's title or album to filter the list.  You can even preview the song before adding it to your playlist! Adding multiple songs at a time to your playlist from other playlists is a breeze.  Filter the list by song title or album, preview songs, or tap the check boxes to select one or more songs.  Then, tap the \"Add Selected Songs\" button to add them to your playlist. Pocket Playlists is not only a music organizer, but also a fully featured music player.  Play, pause, skip tracks, repeat, and shuffle are all a tap away.  If you have tunes on your device and you want to listen to them your way, then get Pocket Playlists today!","version":"1.0.5","homeURL":"http:\/\/www.mobileappmakers.com\/","supportURL":"http:\/\/www.mobileappmakers.com\/","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 MobileAppMakers.com","licenseURL":"http:\/\/www.mobileappmakers.com\/","locale":null,"appSize":"45102","installSize":"45102","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"3.86","currency":"USD","filename":"com.mobileappmakerscom.pocketplaylists_1.0.5_all.ipk","free":false,"images":[{"thumbnail":"2623\/images\/1\/L\/PocketPlaylistsScreenShot1.png","screenshot":"2623\/images\/1\/L\/PocketPlaylistsScreenShot1.png","orientation":"P","device":"P"},{"thumbnail":"2623\/images\/2\/L\/PocketPlaylistsScreenShot2.png","screenshot":"2623\/images\/2\/L\/PocketPlaylistsScreenShot2.png","orientation":"P","device":"P"},{"thumbnail":"2623\/images\/3\/L\/PocketPlaylistsScreenShot3.png","screenshot":"2623\/images\/3\/L\/PocketPlaylistsScreenShot3.png","orientation":"P","device":"P"}]}