{"publicApplicationId":"com.jackpot.multimessagepro","description":"***webOS 2.x compatible! Multi Message apps are the simplest of all the Group Messaging apps to set up and use, they always work. Organize your contacts into E-MAIL GROUPS (Lists), and SMS GROUP, (Lists). UNLIMITED GROUPS and NO ADS! Send Text messages or E-Mails to a Group, Individually, Multiple Groups, swipe to delete groups and members, tap and hold to reorder members. Even easily TWEET your message! Just register your phone on Twitter, create a new contact, use the Twitter Short Code for the phone number, (e.g. 40404 in U.S.) check here: http:\/\/help.twitter.com\/forums\/59008\/entries\/14226) then add the “Twitter” contact to an SMS group. Also set up 20 Quick Texts, choose with a tap, and include it in your text message or e-mail, similar to quick texts in previous Palm devices. One tap from the main scene, an attachment \/ message \/ Quick Text is automatically included to an entire SMS (or E-Mail) Group or multiple SMS (or E-Mail) Groups or tap one of the SMS (or E-Mail) GROUP members in the \"Edit SMS (or E-Mail) Group\" scene to individually text or e-mail any member. The Photo attachment \/ message \/ Quick Text, is also included. Even Backup the file that contains all of your SMS and EMAIL GROUP members, and restore the file at a later date, No fear of wasting time configuring groups, even if you had to erase your phone. Check the application menu ->Help ->FAQ scene for how. Multi Message apps are the simplest and most intuitive of all the Group Messaging apps to set up and use, they always work. Simply type into the \"Enter Your Text\" box and “Tap To Attach”, tap “Photo” “File” or “Remove Attachment”, tap the \"Tap To Send Message\" drawer, and \"Send Text \/ IM\" button to launch messaging, or “Send E-Mail” button to launch E-Mail. Compose \/ Attach once, send to many, via text or e-mail Note: SMS text message recipient limits are imposed by cell service providers. Updated to improve the German translation. E-mail us with suggestions, comments and new app requests.","version":"2.0.1","versionNote":"","homeURL":"http:\/\/jackpotideas.com","supportURL":"http:\/\/jackpotideas.com","custsupportemail":"support@jackpotideas.com","custsupportphonenum":"","copyright":"Copyright 2011 J@ckpot ideas Inc.","licenseURL":"","locale":"en_US","appSize":503146,"installSize":12681216,"isEncrypted":false,"adultRating":false,"islocationbased":false,"lastModifiedTime":"2012-06-02T00:52:13.000+0000","mediaLink":null,"mediaIcon":null,"attributes":{"provides":{"noApp":false,"dockMode":false,"universalSearch":false,"connectors":["null"],"services":[],"optimizedUserExperience":false}},"price":0.99,"currency":"USD","isAdvertized":false,"filename":"com.jackpot.multimessagepro_2.0.1_all.ipk","free":false,"touchpad_exclusive":false,"images":{"1":{"screenshot":"2634\/2.0.1\/en\/images\/1\/L\/ph_multimessagepro_Main.png","thumbnail":"2634\/2.0.1\/en\/images\/1\/S\/ph_multimessagepro_Main.png","orientation":"P","device":"P"},"2":{"screenshot":"2634\/2.0.1\/en\/images\/2\/L\/ph_multimessagepro_MainExpanded.png","thumbnail":"2634\/2.0.1\/en\/images\/2\/S\/ph_multimessagepro_MainExpanded.png","orientation":"P","device":"P"},"3":{"screenshot":"2634\/2.0.1\/en\/images\/3\/L\/ph_multimessagepro_SMSGroups.png","thumbnail":"2634\/2.0.1\/en\/images\/3\/S\/ph_multimessagepro_SMSGroups.png","orientation":"P","device":"P"},"4":{"screenshot":"2634\/2.0.1\/en\/images\/4\/L\/ph_multimessagelite_QuickText.png","thumbnail":"2634\/2.0.1\/en\/images\/4\/S\/ph_multimessagelite_QuickText.png","orientation":"P","device":"P"}}}