{"publicApplicationId":"com.appible.ldsmedia","description":"Enjoy 30 podcasts from LDS.org and BYU in the LDS Media application.  View the latest BYU devotional videos, listen to interviews with Church leaders, hear \"Music with a Message\" presentations, stories from the scriptures and General Conference, full General Conference addresses and discussions about the scriptures from leading scholars.  With the LDS Media application, you may stream or download the video or audio files to your Palm phone.  The application will automatically save your place in the playback when you exit so you can resume later.  Full listing of the included podcasts below: -CES Firesides  -Conversations  -Everything Creative  -Faith in Action  -General Conference  -Gospel Principles  -History of Hymns  -Into All the World  -Legacy  -Mormon Identity  -Music with a Message  -Public Affairs Newsroom.lds.org  -Scripture Stories  -Stories from General Conference  -The Light of Men  -The Mormon Channel Q&A  -Why I Believe -BYU Radio News -Most Recent Talks -Thinking Aloud -Gospel Teaching and Learning -Doctrine and Covenants Discussions -Pearl of Great Price Discussions -Discussions on the Old Testament -Our Savior in the Gospels Discussions -Acts to Revelation Discussions -Book of Mormon Discussions -Insights Into Isaiah Discussions -BYU Classic Speeches   ** A special thanks to Jamie Hatfield, creator of the WebOS app \"drPodder\" from which this app is derived. We sincerely appreciate the open source community for their efforts in helping everyone create and enjoy useful apps.","version":"1.0.0","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"200742","installSize":"200742","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.98","currency":"USD","filename":"com.appible.ldsmedia_1.0.0_all.ipk","free":false,"images":[{"thumbnail":"2684\/de\/images\/1\/L\/ldsmedia1.png","screenshot":"2684\/de\/images\/1\/L\/ldsmedia1.png","orientation":"P","device":"P"},{"thumbnail":"2684\/de\/images\/2\/L\/ldsmedia2.png","screenshot":"2684\/de\/images\/2\/L\/ldsmedia2.png","orientation":"P","device":"P"},{"thumbnail":"2684\/de\/images\/3\/L\/ldsmedia3.png","screenshot":"2684\/de\/images\/3\/L\/ldsmedia3.png","orientation":"P","device":"P"}]}