{"publicApplicationId":"com.wanderlife.app.budget","description":"Get control of your finances with Wanderlife Budget!  Our wizard interface will walk you through figuring out your income and defining your budget.  Then monitor your progress day to day as you keep track of your spending and income.  There are many options to configure it exactly how you want.  What makes Wanderlife Budget so powerful?\n\n- Tracks your income as well as your spending.  Get a one time bonus like a tax refund?  Enter it in and it will increase your discretionary income for that month only.\n\n- Tracks variable income.  Are you paid hourly or can your paycheck vary month to month?  Wanderlife Budget will automatically detect when a deposit is different than you budgeted for and adjust your budget for it.  You can also track unpredictable income like sales from a small business.\n\n- Tracks long term expenses.  Have a yearly or other non-monthly bill?  It will budget a fraction of it every month to build up a fund that will be ready when it comes due.  It will even tell you if you're ahead or behind schedule.\n\n- Statistics.  It will calculate the high, low, and average spending in each category to help you determine the correct amount to budget.  If you change the budgeted amount, it will give you separate statistics that occurred only since then.\n\n- Track as little or as much as you like.  If you have a bill or income that's exactly the same every month, you have the option of turning off tracking.  It will still be used to calculate the overall budget but you don't have to enter in any transactions.\n\nNew in 1.1: Easier data entry.  Transaction descriptions have type ahead and a drop down of previous descriptions.  Amounts can be entered with a pop-up number pad.  You can filter the budget categories by typing.","version":"1.1.2","versionNote":"","homeURL":"http:\/\/www.wanderlife.com","supportURL":"http:\/\/www.wanderlife.com","custsupportemail":"support@wanderlife.com","custsupportphonenum":"","copyright":"Copyright 2010 Wanderlife Software","licenseURL":"","locale":"en_US","appSize":463384,"installSize":6193152,"isEncrypted":false,"adultRating":false,"islocationbased":false,"lastModifiedTime":"2012-06-01T10:14:46.000+0000","mediaLink":null,"mediaIcon":null,"attributes":{"provides":{"noApp":false,"dockMode":false,"universalSearch":false,"connectors":["null"],"services":[],"optimizedUserExperience":false}},"price":2.99,"currency":"USD","isAdvertized":false,"filename":"com.wanderlife.app.budget_1.1.2_all.ipk","free":false,"touchpad_exclusive":false,"images":{"1":{"screenshot":"2695\/1.1.2\/en\/images\/1\/L\/1-Summary.png","thumbnail":"2695\/1.1.2\/en\/images\/1\/L\/1-Summary.png","orientation":"P","device":"P"},"2":{"screenshot":"2695\/1.1.2\/en\/images\/2\/L\/2-Income.png","thumbnail":"2695\/1.1.2\/en\/images\/2\/L\/2-Income.png","orientation":"P","device":"P"},"3":{"screenshot":"2695\/1.1.2\/en\/images\/3\/L\/3-Stats.png","thumbnail":"2695\/1.1.2\/en\/images\/3\/L\/3-Stats.png","orientation":"P","device":"P"},"4":{"screenshot":"2695\/1.1.2\/en\/images\/4\/L\/4-OverDeposit.png","thumbnail":"2695\/1.1.2\/en\/images\/4\/L\/4-OverDeposit.png","orientation":"P","device":"P"},"5":{"screenshot":"2695\/1.1.2\/en\/images\/5\/L\/5-EditBudget.png","thumbnail":"2695\/1.1.2\/en\/images\/5\/L\/5-EditBudget.png","orientation":"P","device":"P"}}}