{"publicApplicationId":"com.rbtdev.hamsterdx","description":"This application is available in English only. HamsterDX is the WebOS app Ham Radio operators have been waiting for.  Bring amateur radio (Ham) call sign lookups and world-wide repeater searching into the palm of your hand.  Using HamsterDX, you can search QRZ’s extensive database of world-wide amateur radio operators’ callsigns, and search for amateur radio repeaters throughout the world using the RFSearch.com database.  No more paging through repeater catalogues while on the road.  Hamster DX uses you phone’s GPS to automatically find repeaters in your immediate area, or you can enter in virtually any partial address and search for repeaters nearby.  Repeater search results and callsign lookups are displayed in a summary list, allowing you to quickly see the most important information.  For more detail, a simple tap will show you every detail available about the callsign, or repeater of interest.  For callsigns, this includes a picture, e-mail address, and website URL (if available on QRZ). For repeaters, this includes output frequency, offset, PL Code, callsign, and location.  Save callsigns of interest to a VIP list for future reference.  NOTE:  A QRZ.com XML Logbook account is required in order to use this application.  If you do not have a QRZ XML Logbook account, a free signup is available through QRZ which provides limited information for each callsign.  Repeater searches are available for anyone, however searches are limited to a 10 mile radius unless you have a membership with RFSearch.com.  Future additions to this app will include the ability to save callsign results to custom lists, and to create and export Ham Radio call logs for use in desktop logging software.   ** UPDATE v1.0.1 fixes an issue with the Repeater List not working properly after viewing repeater details. **","version":"1.0.1","versionNote":"","homeURL":"http:\/\/rbtdev.com","supportURL":"http:\/\/rbtdev.com","custsupportemail":"support@rbtdev.com","custsupportphonenum":"","copyright":"Copyright 2010 RBT Development","licenseURL":"","locale":"en_US","appSize":118148,"installSize":4128148,"isEncrypted":false,"adultRating":false,"islocationbased":true,"lastModifiedTime":"2012-06-01T01:43:12.000+0000","mediaLink":null,"mediaIcon":null,"attributes":{"provides":{"noApp":false,"dockMode":false,"universalSearch":false,"connectors":["null"],"services":[],"optimizedUserExperience":false}},"price":0.99,"currency":"USD","isAdvertized":false,"filename":"com.rbtdev.hamsterdx_1.0.1_all.ipk","free":false,"touchpad_exclusive":false,"images":{"1":{"screenshot":"2731\/1.0.1\/en\/images\/1\/L\/hamsterdx_2010-21-04_211127.png","thumbnail":"2731\/1.0.1\/en\/images\/1\/L\/hamsterdx_2010-21-04_211127.png","orientation":"P","device":"P"},"2":{"screenshot":"2731\/1.0.1\/en\/images\/2\/L\/hamsterdx_2010-21-04_212126.png","thumbnail":"2731\/1.0.1\/en\/images\/2\/L\/hamsterdx_2010-21-04_212126.png","orientation":"P","device":"P"},"3":{"screenshot":"2731\/1.0.1\/en\/images\/3\/L\/hamsterdx_2010-21-04_212258.png","thumbnail":"2731\/1.0.1\/en\/images\/3\/L\/hamsterdx_2010-21-04_212258.png","orientation":"P","device":"P"},"4":{"screenshot":"2731\/1.0.1\/en\/images\/4\/L\/hamsterdx_2010-21-04_212354.png","thumbnail":"2731\/1.0.1\/en\/images\/4\/L\/hamsterdx_2010-21-04_212354.png","orientation":"P","device":"P"}}}