{"publicApplicationId":"com.sykhronics.smiles","description":"SMILES, the award winning strategic puzzle and arcade matching-game is now available for webOS!\n\nSMILES reinvents the matching-game with an innovative gameplay mechanic, and rejuvenates the genre with TWO UNIQUE GAMES! It's designed for players of all skill levels, with interesting new play styles to discover and grow in to. SMILES also doesn't pressure you in to making a move! Play at your own pace.\n\n\"SMILES DROP\" does away with slow gesture-based controls, and introduces the \"TOUCH SWAP\"; An easier, faster, and better way to play on a touch screen. Make matches to score points, and DON'T WAIT! Touch your next match RIGHT AWAY, and chain together HUGE combos and high scores! Break rocks and ice by DROPPING them, and either turn your webOS device, or use the on screen buttons to SPIN the board.\n\n\"SMILES ZEN\" takes the \"TOUCH SWAP\" mechanic, and combines it with the best of patience games like Solitaire and Mahjong. The result is a game that's both thought provoking and engaging. Light up the board to win.\n\nSMILES features plenty of game modes, statistics, achievements, themes, and a full soundtrack!\n\nSMILES: The matching-game reinvented.\n\n\nFEATURES:\n- Two great games (SMILES DROP, and SMILES ZEN)\n- Uniquely designed for both novice and skilled players alike\n- 14 game modes including AVALANCHE, MATCH CHALLENGE, and DROP+\n- 3 themes including Adorable Vegetables, Cheerful Weather, and Colorful Blocks\n- High Scores and Statistics\n- Over 150 Achievements to unlock\n- Upbeat soundtrack with encouraging sound design, or listen to your own music while you play\n- Play in ANY orientation\n- Automatically saves your progress on exit","version":"1.0.8","versionNote":"","homeURL":"http:\/\/www.sykhronics.com","supportURL":"http:\/\/www.sykhronics.com","custsupportemail":"information@sykhronics.com","custsupportphonenum":"","copyright":"Copyright 2008-2010 Michael Kasprzak","licenseURL":"","locale":"en_US","appSize":32274406,"installSize":37715968,"isEncrypted":false,"adultRating":false,"islocationbased":false,"lastModifiedTime":"2012-06-01T08:14:59.000+0000","mediaLink":"http:\/\/www.youtube.com\/watch?v=UQBhVQYbHEM","mediaIcon":"http:\/\/img.youtube.com\/vi\/UQBhVQYbHEM\/2.jpg","attributes":{"provides":{"noApp":false,"dockMode":false,"universalSearch":false,"connectors":["null"],"services":[],"optimizedUserExperience":false}},"price":4.99,"currency":"USD","isAdvertized":false,"filename":"com.sykhronics.smiles_1.0.8_all.ipk","free":false,"touchpad_exclusive":false,"images":[]}