{"publicApplicationId":"com.l337tech.staylitflashlight","description":"Unlike other flashlight apps in the product catalog, Stay Lit Flashlight will always stay lit!  You no longer need to worry about your phone dimming then going to sleep.\nThe main purpose of this app is to give the user light when he needs it for as long as he needs it.  Other flashlight apps in the product catalog will dim then turn off if you dont constanly keep touching your screen to keep it awake.  Stay Lit Flashlight always stays lit!\nStay Lit Flashlight also offers a quick and easy way to adjust the brightness of the flashlight.  Some nights are pitch black and your need extra brightness.  Other nights you may be running a stealth mission so you might want to use less brightness.  \nThis app gives you the ability to choose the color of your flashlight from a list of colors.  Red light would be great for the covert mission mentioned above.  You can also enable an option to change the color of the light when you touch the screen to entertain your kids.  \nIf you want to have some fun, crank the brightness up and turn on the strobe light.  In a fog filled you with a fast flickering strobe you can have all kinds of fun.  Adjust the flicker of the strobe in the preferences page for the perfect flicker.\nIf you find yourself stranded somewhere with no cellphone coverage, use the SOS distress signal.  This mode flashes light in the propper pattern that denotes SOS or Help.\nI, Casey Broome, or L337tech.com are not responsible for any damage this app could or may cause to your phone or anything your phone is or may effect.  Do not use this app if you have any medical conditions that are affected by light, especially flashing light.  Do not use the SOS signal when you are not in danger, especially offshore where people routinely look for such signals.  It is the sole responsibility of the user to use this app properly.  Use this app at your own risk.\n","version":"1.0.0","versionNote":"","homeURL":"http:\/\/www.l337tech.com","supportURL":"http:\/\/www.l337tech.com\/apps\/stay-lit-flashlightstay-lit-flashlight\/","custsupportemail":"comments@l337tech.com","custsupportphonenum":"","copyright":"copyright","licenseURL":"","locale":"en_US","appSize":83390,"installSize":1952550,"isEncrypted":false,"adultRating":false,"islocationbased":false,"lastModifiedTime":"2012-06-01T01:56:32.000+0000","mediaLink":null,"mediaIcon":null,"attributes":{"provides":{"noApp":false,"dockMode":false,"universalSearch":false,"connectors":["null"],"services":[],"optimizedUserExperience":false}},"price":0.99,"currency":"USD","isAdvertized":false,"filename":"com.l337tech.staylitflashlight_1.0.0_all.ipk","free":false,"touchpad_exclusive":false,"images":{"1":{"thumbnail":"2889\/en\/images\/1\/S\/staylitflashlight_2010-07-05_101345.png","screenshot":"2889\/en\/images\/1\/L\/staylitflashlight_2010-07-05_101345.png","orientation":"P","device":"P"},"2":{"thumbnail":"2889\/en\/images\/2\/S\/staylitflashlight_2010-07-05_101356.png","screenshot":"2889\/en\/images\/2\/L\/staylitflashlight_2010-07-05_101356.png","orientation":"P","device":"P"},"3":{"thumbnail":"2889\/en\/images\/3\/S\/staylitflashlight_2010-07-05_101350.png","screenshot":"2889\/en\/images\/3\/L\/staylitflashlight_2010-07-05_101350.png","orientation":"P","device":"P"},"4":{"thumbnail":"2889\/en\/images\/4\/S\/staylitflashlight_2010-10-05_070531.png","screenshot":"2889\/en\/images\/4\/L\/staylitflashlight_2010-10-05_070531.png","orientation":"P","device":"P"}}}