{"publicApplicationId":"com.dblpartners.nbdhe","description":"Upward Mobility’s National Board Dental Hygienist Exam (NBDHE) app for Palm's webOS is a valuable tool to help you pass this important exam.  \n\nThis practice exam\/review module contains 402 questions written by professional writers with concise, but detailed explanations to help you prepare for this test.  \n\nWhile this module is designed for the NBDHE exam, it would also be helpful on medical board tests such as the USMLE, the MCAT, international dental hygiene licensure tests, and any other professional  exam that requires deep knowledge in the topic areas below.  \n \nTopics include:\n\nI. Scientific Basis for Dental Hygiene Practice \nII. Provision of Clinical Dental Hygiene Services \nIII. Community Health\/Research Principles\n\nAbout the National Board Dental Exam (NBDHE) \n\nThe purpose of the National Board Dental Hygiene Examination is to assist state boards in determining qualifications of dental hygienists who seek licensure to practice dental hygiene. The Examination assesses the ability to understand important information from basic biomedical, dental, and dental hygiene sciences.\n\nAbout Upward Mobility\n\nUpward Mobility creates high end professional educational content for management development and test preparation, and makes it available through mobile apps. Our goal is to keep learners engaged with a mix of wit, humor and actionable takeaways while meeting our customer's specific educational needs.\n\nWe are a double bottom line company that is committed to education in the developing world. Some of the profits will be used to deploy education via mobile phone in emerging countries to improve their total factor productivity growth.\n\nUpward Mobility cares deeply about its products, and you can contact us from the home screen of all of our apps.\n","version":"1.0.2","versionNote":"","homeURL":"http:\/\/www.upwardpro.com","supportURL":"http:\/\/www.upwardpro.com","custsupportemail":"info@upwardpro.com","custsupportphonenum":"","copyright":"DBL Partners LLC 2010","licenseURL":"","locale":"en_US","appSize":144906,"installSize":3105637,"isEncrypted":false,"adultRating":false,"islocationbased":false,"lastModifiedTime":"2012-06-01T02:01:05.000+0000","mediaLink":null,"mediaIcon":null,"attributes":{"provides":{"noApp":false,"dockMode":false,"universalSearch":false,"connectors":["null"],"services":[],"optimizedUserExperience":false}},"price":8.99,"currency":"USD","isAdvertized":false,"filename":"com.dblpartners.nbdhe_1.0.2_all.ipk","free":false,"touchpad_exclusive":false,"images":{"1":{"screenshot":"2935\/1.0.2\/en\/images\/1\/L\/1.png","thumbnail":"2935\/1.0.2\/en\/images\/1\/L\/1.png","orientation":"P","device":"P"},"2":{"screenshot":"2935\/1.0.2\/en\/images\/2\/L\/2.png","thumbnail":"2935\/1.0.2\/en\/images\/2\/L\/2.png","orientation":"P","device":"P"},"3":{"screenshot":"2935\/1.0.2\/en\/images\/3\/L\/3.png","thumbnail":"2935\/1.0.2\/en\/images\/3\/L\/3.png","orientation":"P","device":"P"},"4":{"screenshot":"2935\/1.0.2\/en\/images\/4\/L\/4.png","thumbnail":"2935\/1.0.2\/en\/images\/4\/L\/4.png","orientation":"P","device":"P"},"5":{"screenshot":"2935\/1.0.2\/en\/images\/5\/L\/5.png","thumbnail":"2935\/1.0.2\/en\/images\/5\/L\/5.png","orientation":"P","device":"P"}}}