{"publicApplicationId":"com.dblpartners.paramedic","description":"Upward Mobility’s NREMT Paramedic \/ EMT Exam Prep is a valuable tool to help you pass this important National Register of Emergency Medical Technicians exam.   This practice exam\/review module contains 202 questions written by professional writers with concise, but detailed explanations to help you prepare for this test.     While this module is designed for the NREMT exam, it would also be helpful on any paramedic, nursing, or medical board tests such as the USMLE, the MCAT, and any other professional licensure exam that requires deep knowledge in the topic areas below.     Topics include:  Airway and Breathing\t Cardiology\t Trauma\t Medical\t Obstetrics and Pediatrics\t Operations   Consult with your tax advisor or employer on whether this training module is tax deductible or can be reimbursed.    About the NREMT   The NREMT is a non-profit organization founded in 1970 whose mission is to serves as the national EMS certification organization by providing a valid, uniform process to assess the knowledge and skills required for competent practice required by EMS professionals throughout their careers. Prior to the 1970’s, a national certification standard for emergency medical care did not exist.  About Upward Mobility  Upward Mobility creates high end professional educational content for management development and test preparation, and makes it available through mobile apps. Our goal is to keep learners engaged with a mix of wit, humor and actionable takeaways while meeting our customer's specific educational needs.  We are a double bottom line company that is committed to education in the developing world. Some of the profits will be used to deploy education via mobile phone in emerging countries to improve their total factor productivity growth.  Upward Mobility cares about its products, and you can contact us from the home screen of all of our apps. ","version":"1.0.3","versionNote":"","homeURL":"http:\/\/www.upwardpro.com","supportURL":"http:\/\/www.upwardpro.com","custsupportemail":"info@upwardpro.com","custsupportphonenum":"","copyright":"DBL Partners LLC","licenseURL":"","locale":"en_US","appSize":109630,"installSize":2901598,"isEncrypted":false,"adultRating":false,"islocationbased":false,"lastModifiedTime":"2010-06-02T07:33:09.000+0000","mediaLink":null,"mediaIcon":null,"attributes":{"provides":{"noApp":false,"dockMode":false,"universalSearch":false,"connectors":[],"services":[],"optimizedUserExperience":false}},"price":3.99,"currency":"USD","isAdvertized":false,"filename":"com.dblpartners.paramedic_1.0.3_all.ipk","free":false,"touchpad_exclusive":false,"images":{"1":{"thumbnail":"2938\/en\/images\/1\/S\/1.png","screenshot":"2938\/en\/images\/1\/L\/1.png","orientation":"P","device":"P"},"2":{"thumbnail":"2938\/en\/images\/2\/S\/2.png","screenshot":"2938\/en\/images\/2\/L\/2.png","orientation":"P","device":"P"},"3":{"thumbnail":"2938\/en\/images\/3\/S\/3.png","screenshot":"2938\/en\/images\/3\/L\/3.png","orientation":"P","device":"P"},"4":{"thumbnail":"2938\/en\/images\/4\/S\/4.png","screenshot":"2938\/en\/images\/4\/L\/4.png","orientation":"P","device":"P"},"5":{"thumbnail":"2938\/en\/images\/5\/S\/5.png","screenshot":"2938\/en\/images\/5\/L\/5.png","orientation":"P","device":"P"}}}