{"publicApplicationId":"com.loudapps.ultrafart","description":"UltraFart: Hilarious fun!  Hands-down the best fart application available for Palm WebOS.  More than thirty high quality, disgusting, loud, underwear-wrecking fart sounds.  Pull pranks, gross out friends, or just listen to some serious wind-breaking.\nThree modes to choose from:\n*Time bomb mode* Set a timer, set the phone near a friend and sit back and wait.  Time bomb mode uses the WebOS multitasking to work while the App is backgrounded, the card is closed, or even with the phone locked!   You can even set the time bomb to repeat, for continued hilarity.\n\n*Motion Sense Mode*\nFarts when the phone is moved.  Great for simple \"can you grab me my phone?\" pranks.  With selectable sensitivity levels and a 5 second grace period to set your trap, there's lots of possibilities for other pranking fun.  Try setting the sensitivity really low and setting the phone on a couch, or setting the sensitivity higher and putting it in a friends bag.  Since the phone's motion detector only works with the screen on, we make sure it stays on while you've got your trap set.\n\n*Fart now mode* Play a fart at the touch of a finger.  Includes a selection for a random fart for those situations where you just can't make up your mind.\n\nEverybody loves a good fart joke, get off your high-horse, hold your nose, and buy this app!  You won't regret it!\nNew in 1.1.0 -- The best app just got better.  New motion sense mode, and an all new stylish (and appropriately colored) theme with WebOS smooth transitions and crossfades.  This app looks and works great!","version":"1.1.0","versionNote":"","homeURL":"http:\/\/loudapps.com","supportURL":"http:\/\/loudapps.com","custsupportemail":"support@loudapps.com","custsupportphonenum":"","copyright":"Copyright 2010 Loudapps","licenseURL":"","locale":"en_US","appSize":4516722,"installSize":8870329,"isEncrypted":false,"adultRating":false,"islocationbased":false,"lastModifiedTime":"2012-06-01T03:00:29.000+0000","mediaLink":null,"mediaIcon":null,"attributes":{"provides":{"noApp":false,"dockMode":false,"universalSearch":false,"connectors":["null"],"services":[],"optimizedUserExperience":false}},"price":1,"currency":"USD","isAdvertized":false,"filename":"com.loudapps.ultrafart_1.1.0_all.ipk","free":false,"touchpad_exclusive":false,"images":[]}