{"publicApplicationId":"com.tlamatini.itriagehealth","description":"Healthcare in Your Hand – Don’t Get Sick Without It\n\n- Information on thousands of symptoms, diseases, and medical procedures.\n- A nationwide directory of all U.S. hospitals, urgent cares, retail clinics, and pharmacies.\n- Find the nearest doctor from our list of over 750,000 physicians across more than 350 specialties\n- Access to Doctor and Nurse advice lines\n- Detailed quality reports from HealthGrades on hospitals and physicians\n- Help negotiating medical bills through an iTriage partnership with one of the most respected claims adjudication organizations\n- Emergency Room Wait Times for hospitals in select parts of the country\n\nHow do I use it?\nLet’s say you or your child suddenly develops ear pain. You can quickly pinpoint your symptom and search through possible causes to learn more. From there, you can determine which facility (hospital ER, urgent care, retail clinic or physician) can most appropriately treat the cause. As you sit in the waiting room, you can access quality reports on the facility or doctor you are going to see and obtain more information about the possible treatments you may receive. iTriage truly is your lifeline to healthcare information when you need it the most.\n \nWhat People Are Saying About It\n“iTriage saved my daughter’s life when she broke out with severe hives. We looked it up we found out that what she had was Anaphylaxis. We rushed her to the R.R. and they told me that it was good that I acted fast, if not, our little girl would have died. Thank you iTriage and keep up the good work.” G. F.\n\n“I love iTriage! I have three young kids and it’s so nice to have something on hand to do a little searching on. My father-in-law was recently admitted to the hospital with stroke-like symptoms but no signs of a stroke. While I sat in the waiting room, I did a little searching on iTriage, and found a possible diagnosis of a brain infection. Sure enough that’s what he ended up with.” – J. T.","version":"1.0.4","versionNote":"","homeURL":"http:\/\/www.healthagen.com","supportURL":"http:\/\/www.itriagehealth.com","custsupportemail":"info@healthagen.net","custsupportphonenum":"","copyright":"Copyright 2010 Healthagen LLC","licenseURL":"","locale":"en_US","appSize":10604,"installSize":1123169,"isEncrypted":false,"adultRating":false,"islocationbased":false,"lastModifiedTime":"2011-05-14T23:07:55.000+0000","mediaLink":null,"mediaIcon":null,"attributes":{"provides":{"noApp":false,"dockMode":false,"universalSearch":false,"connectors":[],"services":[],"optimizedUserExperience":false}},"price":0,"currency":"USD","isAdvertized":false,"filename":"com.tlamatini.itriagehealth_1.0.4_all.ipk","free":false,"touchpad_exclusive":false,"images":{"1":{"thumbnail":"com.tlamatini.itriagehealth\/en\/images\/1\/S\/palm-screenshot.png","screenshot":"com.tlamatini.itriagehealth\/en\/images\/1\/L\/palm-screenshot.png","orientation":"P","device":"P"},"2":{"thumbnail":"com.tlamatini.itriagehealth\/en\/images\/2\/S\/palm-screen2.png","screenshot":"com.tlamatini.itriagehealth\/en\/images\/2\/L\/palm-screen2.png","orientation":"P","device":"P"},"3":{"thumbnail":"com.tlamatini.itriagehealth\/en\/images\/3\/S\/palm-screen3.png","screenshot":"com.tlamatini.itriagehealth\/en\/images\/3\/L\/palm-screen3.png","orientation":"P","device":"P"}}}