{"publicApplicationId":"org.javasanity.grocerylist","description":"New: Save Money! Compare your prices for all stores in the item details screen! GroceryList is the ultimate shopping list program for the Palm Pre and Palm Pixi. GroceryList was designed with one thing in mind: Speed! Don't enter data when you can search for it! Search for stores using your current location. Search for items in an on-line database of common Grocery Items. Once found, adding them just takes a tap. Heading to Taco Bell and have a big order? The store search feature is not limited to just Grocery Stores! After adding a store using store search, if you want to call the store to find their hours, just tap Menu -> Store -> Call. Are you sending someone else to the store to buy your items? You can email your buy list to any email address, then they can print it out and take it with them! You can add one item to multiple stores and then buy it at the first store you happen to stop at. Checking out items at one store updates all stores! You can set per-store aisles and prices. If the above isn't enough, there is integration with an on-line GroceryList as well, which allows you to enter items on-line and download them to your device. The on-line GroceryList provides two excellent advantages. 1. Anyone in the family can add items at any time without even having the device present. 2. You can use a real computer keyboard to add items to your grocery list if you have many items to add! Put that laptop sitting in your kitchen to good use! Adding items from your on-line List is as easy as a tap. Your webOS shopping list items have a name, category, aisle, quantity, and price. You can also indicate that you have a coupon for an item and it will be visible in your List. You just can't go wrong with GroceryList. Many of the features listed here were a direct result of customer feedback. If there is something you'd like to see in a future version, do not hesitate to send a support email!","version":"1.2.13","versionNote":"","homeURL":"http:\/\/www.javasanity.org","supportURL":"http:\/\/www.javasanity.org\/GroceryList","custsupportemail":"entreesdujour@gmail.com","custsupportphonenum":"","copyright":"Copyright 2010 Java Sanity","licenseURL":"","locale":"en_US","appSize":48988,"installSize":2555904,"isEncrypted":false,"adultRating":false,"islocationbased":true,"lastModifiedTime":"2012-02-16T07:00:43.000+0000","mediaLink":null,"mediaIcon":null,"attributes":{"provides":{"noApp":false,"dockMode":false,"universalSearch":false,"connectors":["null"],"services":[],"optimizedUserExperience":false}},"price":1.99,"currency":"USD","isAdvertized":false,"filename":"org.javasanity.grocerylist_1.2.13_all.ipk","free":false,"touchpad_exclusive":false,"images":{"1":{"screenshot":"org.javasanity.grocerylist\/1.2.13\/en\/images\/1\/L\/ph_stores.png","thumbnail":"org.javasanity.grocerylist\/1.2.13\/en\/images\/1\/S\/ph_stores.png","orientation":"P","device":"P"},"2":{"screenshot":"org.javasanity.grocerylist\/1.2.13\/en\/images\/2\/L\/ph_slist.png","thumbnail":"org.javasanity.grocerylist\/1.2.13\/en\/images\/2\/S\/ph_slist.png","orientation":"P","device":"P"},"3":{"screenshot":"org.javasanity.grocerylist\/1.2.13\/en\/images\/3\/L\/ph_edit.png","thumbnail":"org.javasanity.grocerylist\/1.2.13\/en\/images\/3\/S\/ph_edit.png","orientation":"P","device":"P"},"4":{"screenshot":"org.javasanity.grocerylist\/1.2.13\/en\/images\/4\/L\/ph_online_pink.png","thumbnail":"org.javasanity.grocerylist\/1.2.13\/en\/images\/4\/S\/ph_online_pink.png","orientation":"P","device":"P"}}}