{"publicApplicationId":"com.dblpartners.cfp","description":"Aiming for a high score on your Certified Financial Planner (CFP) exam? Look no further. Upward Mobility's CFP Exam Prep software for Palm's webOS is the perfect tool to help you prepare for this challenging test.    This app has 442 questions which cover nearly all the key topics on the exam including:  General Principles of Financial Planning Insurance Planning and Risk Management Employee Benefits Planning Investment Planning Income Tax Planning Retirement Planning Estate Planning  While designed specifically for the CFP exam, this app would also be useful for other exams requiring financial knowledge, such as the CFA, Series 7, Series 63 and others.  About the CFP Exam and Designation  The CFP® identifies individuals who have met rigorous professional standards and have agreed to adhere to the principles of integrity, objectivity, competence, fairness, confidentiality, professionalism and diligence when dealing with clients.  Upward Mobility is not associated with the CFP Board.  The CFP Board does not endorse this product, and it did not have any role in its creation.  About Upward Mobility  Upward Mobility creates high end professional education content for management development and test preparation, and makes it available through mobile apps. Our goal is to keep learners engaged with a mix of wit, humor, and actionable takeaways while meeting our customer’s educational needs.  We are a double bottom line company that is committed to education in the developing world. Some of the profits will be used to deploy education via mobile phone in emerging countries to improve their total factor productivity growth.","version":"1.0.3","versionNote":"","homeURL":"http:\/\/www.upwardpro.com","supportURL":"http:\/\/www.upwardpro.com","custsupportemail":"info@upwardpro.com","custsupportphonenum":"","copyright":"DBL Partners LLC 2010","licenseURL":"","locale":"en_US","appSize":188124,"installSize":3279151,"isEncrypted":false,"adultRating":false,"islocationbased":false,"lastModifiedTime":"2010-06-08T01:00:46.000+0000","mediaLink":null,"mediaIcon":null,"attributes":{"provides":{"noApp":false,"dockMode":false,"universalSearch":false,"connectors":[],"services":[],"optimizedUserExperience":false}},"price":8.99,"currency":"USD","isAdvertized":false,"filename":"com.dblpartners.cfp_1.0.3_all.ipk","free":false,"touchpad_exclusive":false,"images":{"1":{"thumbnail":"3162\/en\/images\/1\/S\/1.png","screenshot":"3162\/en\/images\/1\/L\/1.png","orientation":"P","device":"P"},"2":{"thumbnail":"3162\/en\/images\/2\/S\/2.png","screenshot":"3162\/en\/images\/2\/L\/2.png","orientation":"P","device":"P"},"3":{"thumbnail":"3162\/en\/images\/3\/S\/3.png","screenshot":"3162\/en\/images\/3\/L\/3.png","orientation":"P","device":"P"},"4":{"thumbnail":"3162\/en\/images\/4\/S\/4.png","screenshot":"3162\/en\/images\/4\/L\/4.png","orientation":"P","device":"P"},"5":{"thumbnail":"3162\/en\/images\/5\/S\/5.png","screenshot":"3162\/en\/images\/5\/L\/5.png","orientation":"P","device":"P"}}}