{"publicApplicationId":"com.jackpot.twextionary","description":"***webOS 2.x \/ VEER \/ PIXI compatible! Wtf?, fnr, aytmtb?, roflmfao, twaffic, tweeps \/ tweeple, twittsomnia. If you want to communicate electronically, you’ll want Twextionary, a dictionary of more than a thousand shorthand Text Message \/ Instant Message and EMOTICON codes. It has ALL of the HP \/ Palm webOS supported EMOTICONS!!! This app has been 1 of the hottest apps since its release. Check the reviews for proof! Simply open the app, find the one you want, then tap and paste. Includes Twitter and gaming shorthand as well. Now you can decipher those text \/ instant messages quickly and easily. Or just look through the dictionary for some new shorthand to use. It’s the electronic language of today and future generations, and it’s something we all benefit by knowing. Sure you could “jfgi” if you could find it, but why waste the time. Whether you’re a parent or not, you might want to know, pir or pos. If your into gaming you might want to know tbag. If you use Twitter you might want to know twexplanation. We tried hard to find them all and we want this tool to be the best it can be. We love updating our apps, and updates are so easy and free, so we welcome you to e-mail us through HELP in the application menu with more shorthand and suggestions. We even included the complete list of Palm webOS supported EMOTICONS (smileys) which all work on Palm webOS devices, some may or may not work on other phones. Twextionary is so simple to use. Just launch the app and start typing to narrow down the entire list of shorthand and find what you are looking for. Or simply swipe up and down the entire list. You can even tap any item, emoticons too, (which copies the shorthand to the clipboard), and then paste it into your Text \/ IM messages. If you like Twextionary and you think its “pft”, and you want more features, we’d love for you to leave us a great review, and we'll be happy to further update the app. Bbfn, ttyl, :)","version":"4.1.1","versionNote":"","homeURL":"http:\/\/jackpotideas.com","supportURL":"http:\/\/jackpotideas.com","custsupportemail":"support@jackpotideas.com","custsupportphonenum":"","copyright":"Copyright 2010 J@ckpot ideas Inc.","licenseURL":"","locale":"en_US","appSize":166066,"installSize":2954926,"isEncrypted":false,"adultRating":false,"islocationbased":false,"lastModifiedTime":"2012-06-01T02:28:57.000+0000","mediaLink":null,"mediaIcon":null,"attributes":{"provides":{"noApp":false,"dockMode":false,"universalSearch":false,"connectors":["null"],"services":[],"optimizedUserExperience":false}},"price":0.99,"currency":"USD","isAdvertized":false,"filename":"com.jackpot.twextionary_4.1.1_all.ipk","free":false,"touchpad_exclusive":false,"images":{"1":{"screenshot":"3171\/4.1.1\/en\/images\/1\/L\/TwextionaryMain.png","thumbnail":"3171\/4.1.1\/en\/images\/1\/L\/TwextionaryMain.png","orientation":"P","device":"P"},"2":{"screenshot":"3171\/4.1.1\/en\/images\/2\/L\/TwextionaryFilter.png","thumbnail":"3171\/4.1.1\/en\/images\/2\/L\/TwextionaryFilter.png","orientation":"P","device":"P"},"3":{"screenshot":"3171\/4.1.1\/en\/images\/3\/L\/TwextionaryHelp.png","thumbnail":"3171\/4.1.1\/en\/images\/3\/L\/TwextionaryHelp.png","orientation":"P","device":"P"}}}