{"publicApplicationId":"com.bankofamerica.mobilebanking","description":"Mobile Banking is available to all Bank of America Online Banking* customers. Use it to check available balances, pay bills, transfer funds or locate ATMs and banking centers on-the-go. It’s fast, easy and convenient. Use our ATM and Banking Center Locator to find the nearest location with a simple touch of a button, no address input required**. This location aware feature is only available through our application and not on our mobile web site. Access the Mobile Banking web site directly within the application.  One destination on your device to check available balances 24\/7, pay bills and transfer funds. Feel secure with a leader in mobile security and our Online Banking Guarantee. MOBILE BANKING SECURITY - Your personal information is protected by advanced encryption technology to prevent unauthorized access. We are committed to protecting the privacy of your financial information. See the Privacy Policy for Consumers on our web site at www.bankofamerica.com. Our Online Banking Guarantee ensures you're not responsible for any unauthorized transactions. We use SiteKey® to verify your identity as we do for Online Banking, providing an extra layer of security for your peace of mind. We will never transmit account number information. *Mobile Banking is not available to Online Banking customers in WA and ID. **Technology limited to locating ATM\/Banking Centers only.","version":"1.0.0","homeURL":"http:\/\/www.bankofamerica.com\/contact","supportURL":"http:\/\/www.bankofamerica.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"© 2010 Bank of America. All rights reserved.","licenseURL":"http:\/\/www.bankofamerica.com\/contact","locale":null,"appSize":"114402","installSize":"114402","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":0,"currency":"USD","filename":"com.bankofamerica.mobilebanking_1.0.0_all.ipk","free":true,"images":[{"thumbnail":"3420\/en\/images\/1\/L\/bankmenu.png","screenshot":"3420\/en\/images\/1\/L\/bankmenu.png","orientation":"P","device":"P"},{"thumbnail":"3420\/en\/images\/2\/L\/transfer.png","screenshot":"3420\/en\/images\/2\/L\/transfer.png","orientation":"P","device":"P"},{"thumbnail":"3420\/en\/images\/3\/L\/locationdetails.png","screenshot":"3420\/en\/images\/3\/L\/locationdetails.png","orientation":"P","device":"P"}]}