{"publicApplicationId":"com.ultralingua.palmpre.dictionaries.eneo","description":"Dictionaries from Ultralingua contain data of unparalleled quality. Linguistic professionals keep definitions as precise as possible by updating them as often as needed.  Apps by Ultralingua are compatible with both Pre and Pixi devices.  BILINGUAL DICTIONARY  The Esperanto-English Translation Dictionary by Ultralingua offers thousands of entries including slang, technical terms, and idiomatic expressions. We help you find the word you need by returning results as you type, and also suggest similar results (in case you misspell or mistype) in the “Did you mean?” section.   VERB CONJUGATIONS  Although verb conjugations for Esperanto are not yet available, you can get conjugations for thousands of regular and irregular English verbs with the verb tool. Use any form of a word when searching, and Ultralingua displays conjugations in all standard tenses. This popular feature makes conjugating verbs easy.   FEATURES - Spell out any number in English text - Tap any word to easily access translations, verb conjugations, and Google search - Find recent translation, verb, and number searches in the history tool  - This app includes 50,000 definitions under 30,000 headwords - Search results returned as you type (this feature can be turned on or off in the menu) - Ability to cut, copy, and paste into the dictionary  The app requires an Internet connection to use, which helps you avoid reaching install limits on your device. However, this also means you’ll be temporarily unable to use the app if your service is interrupted.  Ultralingua dictionaries are available for English, Spanish, French, Italian, Portuguese, German, and more. Internet connection required.","version":"1.0.2","versionNote":"","homeURL":"http:\/\/www.ultralingua.com\/","supportURL":"http:\/\/ultralingua.com\/en\/email.htm","custsupportemail":"escalate@ultralingua.com","custsupportphonenum":"..","copyright":"(c) 2010 Ultralingua, Inc.","licenseURL":"","locale":"en_US","appSize":145616,"installSize":4234287,"isEncrypted":false,"adultRating":false,"islocationbased":false,"lastModifiedTime":"2010-06-28T19:31:09.000+0000","mediaLink":null,"mediaIcon":null,"attributes":{"provides":{"noApp":false,"dockMode":false,"universalSearch":false,"connectors":[],"services":[],"optimizedUserExperience":false}},"price":19.99,"currency":"USD","isAdvertized":false,"filename":"com.ultralingua.palmpre.dictionaries.eneo_1.0.2_all.ipk","free":false,"touchpad_exclusive":false,"images":{"1":{"thumbnail":"350\/en\/images\/1\/S\/en-eo-dict-search-eo.png","screenshot":"350\/en\/images\/1\/L\/en-eo-dict-search-eo.png","orientation":"P","device":"P"},"2":{"thumbnail":"350\/en\/images\/2\/S\/en-eo-dict-result-en.png","screenshot":"350\/en\/images\/2\/L\/en-eo-dict-result-en.png","orientation":"P","device":"P"},"3":{"thumbnail":"350\/en\/images\/3\/S\/en-eo-dict-popup-eo.png","screenshot":"350\/en\/images\/3\/L\/en-eo-dict-popup-eo.png","orientation":"P","device":"P"},"4":{"thumbnail":"350\/en\/images\/4\/S\/en-eo-history.png","screenshot":"350\/en\/images\/4\/L\/en-eo-history.png","orientation":"P","device":"P"},"5":{"thumbnail":"350\/en\/images\/5\/S\/en-eo-conj-en-002.png","screenshot":"350\/en\/images\/5\/L\/en-eo-conj-en-002.png","orientation":"P","device":"P"}}}