{"publicApplicationId":"com.sierrablanco.app.sudokuplus","description":"SudokuPlus is a “must have” game for your phone. It is the premier version of the popular Sudoku game designed specifically for the Palm Prē and Pixi. SudokuPlus is being introduced at just $2.99 (regular $4.99) until the end of the year.   Sudoku is not only a fun, stimulating game, but a mind exercise that millions world-wide play to sharpen their intellect. Frank Longo, author of over 60 Sudoku books, provides the puzzles for SudokuPlus. These puzzles range from very simple beginner games to extremely difficult games. You will always be challenged.  SudokuPlus has many helpful features and options not found in other Sudoku games. Special \"Beginner Mode\" settings make it easy for beginning players to learn Sudoku. Other settings remove the manual aspects of the game so players can focus on logic, not erasing notations. For all players, the SudokuPlus incremental solution engine can provide hints and clues at every step of puzzle solving.  Custom games can be entered from external sources such as newspapers and books. Any game can be saved at any state of play to reopen and resume later. So you can enter a batch of games from one of your Sudoku books, save a game part way through and begin another, or just save a good puzzle to share with someone later. SudokuPlus can also make the puzzles more interesting or challenging by making the values letters, shapes, smiley faces, or familiar icons instead of numerals.  Sierra Blanco Systems is dedicated to providing quality products and customer support. Visit www.SudokuForPre.com for more information.","version":"1.2.0","versionNote":"App should be playable on pixi. It recognizes smaller screen and adjusts accordingly. Play on pixi depends more heavily on keyboard shortcuts than pre, but using keyboard is best way to play in both cases.  Three accounts have been set up for palm to use on www.SudokuForPre.com:  Palm1\/82thuxkt3 Palm2\/93etknvx1 Palm3\/qnev2f69u  ","homeURL":"http:\/\/www.sierrablanco.com","supportURL":"http:\/\/www.SudokuForPre.com","custsupportemail":"support@sudokuForPre.com","custsupportphonenum":"949.521.0819","copyright":"Copyright 2009 Sierra Blanco Systems","licenseURL":"","locale":"en_US","appSize":2631946,"installSize":4441188,"isEncrypted":false,"adultRating":false,"islocationbased":false,"lastModifiedTime":"2009-11-06T21:22:44.000+0000","mediaLink":null,"mediaIcon":null,"attributes":{"provides":{"noApp":false,"dockMode":false,"universalSearch":false,"connectors":[],"services":[],"optimizedUserExperience":false}},"price":2.99,"currency":"USD","isAdvertized":false,"filename":"com.sierrablanco.app.sudokuplus_1.2.0_all.ipk","free":false,"touchpad_exclusive":false,"images":{"1":{"thumbnail":"388\/en\/images\/1\/S\/showInvalid.jpg","screenshot":"388\/en\/images\/1\/L\/showInvalid.jpg","orientation":"P","device":"P"},"2":{"thumbnail":"388\/en\/images\/2\/S\/Conflicted9RC.png","screenshot":"388\/en\/images\/2\/L\/Conflicted9RC.png","orientation":"P","device":"P"},"3":{"thumbnail":"388\/en\/images\/3\/S\/imagesOfGameInPlay.png","screenshot":"388\/en\/images\/3\/L\/imagesOfGameInPlay.png","orientation":"P","device":"P"}}}