{"publicApplicationId":"com.splashdata.app.mcraigpro","description":"mCraig is a powerful tool for browsing your local Craigslist postings on your WebOS device (Palm Pre and Palm Pixi)  To get started, tap the Search button on the bottom left, then tap the Location field. Select your Country, State, and City - you can even select your local region in your city, such as \"Los Angeles > SF Valley.\"  Then tap the Category field to select from the list of Craigslist categories, such as \"For Sale.\"  You can then choose a Subcategory such as \"Bikes.\"  Tap the Filters field to set filter preferences - limit results by only those that have images, search only in the title text, or set a price range for the items you are searching. For example, set the range of rent that you are looking for in apartment listings. Then tap Set Filters.  If you just want to Browse all listings based on these criteria, you can just tap Search at this point.  But you can narrow down the results a lot better by entering some search terms in the search box before you hit the Search button.  A bonus feature in mCraig is the ability to save Bookmarks of searches you often perform. To do this, set all the Category and Filter preferences that you want for your search as well as any search terms, then tap the PLUS button at the top right, and you will be able to bookmark the search for the next time you need it.   You will find Bookmarks by tapping the center tab on the bottom toolbar. You will also find a browsing History here which shows you what searches you performed recently. Craigslist Pro has more categories and locations now...","version":"1.1.4","versionNote":"","homeURL":"http:\/\/www.splashdata.com","supportURL":"http:\/\/splashdata.helpserve.com","custsupportemail":"palm@splashdata.com","custsupportphonenum":"..","copyright":"Copyright 2010 SplashData, Inc.","licenseURL":"","locale":"en_US","appSize":541374,"installSize":7761787,"isEncrypted":false,"adultRating":false,"islocationbased":true,"lastModifiedTime":"2010-07-15T14:41:17.000+0000","mediaLink":null,"mediaIcon":null,"attributes":{"provides":{"noApp":false,"dockMode":false,"universalSearch":false,"connectors":[],"services":[],"optimizedUserExperience":false}},"price":2.99,"currency":"USD","isAdvertized":false,"filename":"com.splashdata.app.mcraigpro_1.1.4_all.ipk","free":false,"touchpad_exclusive":false,"images":{"1":{"thumbnail":"390\/en\/images\/1\/S\/search.png","screenshot":"390\/en\/images\/1\/L\/search.png","orientation":"P","device":"P"},"2":{"thumbnail":"390\/en\/images\/2\/S\/results.png","screenshot":"390\/en\/images\/2\/L\/results.png","orientation":"P","device":"P"},"3":{"thumbnail":"390\/en\/images\/3\/S\/details.png","screenshot":"390\/en\/images\/3\/L\/details.png","orientation":"P","device":"P"},"4":{"thumbnail":"390\/en\/images\/4\/S\/filters.png","screenshot":"390\/en\/images\/4\/L\/filters.png","orientation":"P","device":"P"}}}