{"publicApplicationId":"com.graucoastal.crapstogo","description":"This app makes the dice game of Craps easy for everyone to learn and play.  Ever watched Craps being played at a casino and become totally lost just keeping track of the point?  Or what about all the different possible bets on the table?  Or are you an old pro who wants to test out new betting strategies just to see if you might have discovered a way to beat the odds?  No matter your skill level this app is for you.  Your bankroll comes loaded with $1,000.  The table is ready for you to select your bet. Tap on the pass line and a $5 bet is placed on pass, shake your phone and the dice roll out.  Was a point established?  Did you Crap Out?  Did you win with a 7 or 11?  The app tells you what happened on a message line on the bottom of the screen.  Want to add odds to your pass bet, tap pass again and its done.  Want to place a hardways or single roll bet? Scroll up the table and tap on the Hard 4 or the Any Craps. Want to look back over what happened?  The app provides an outcomes page where you can scroll back through the prior rolls to see each roll of the dice, the point, and the results of your bets.  Your bankroll automatically keeps up with your betting so in a glance you know how its going.  And don't worry, once your bankroll is depleted you can add to it without hitting up your credit card.  All in all, the app supports over 25 different bet possibilities all with payouts to your bankroll similar to the big casinos.  So what's stopping you?  Download now so you can become a pro in time for your next visit to Las Vegas or a local casino.  Update 1.0.2 – Timeout turns screen off after 3 minutes of no rolls, added On\/Off Puck, Come Bet moved to point   Update 1.0.3 - Bank total calculation bug fix.","version":"1.0.3","versionNote":"","homeURL":"http:\/\/graucoastal.com","supportURL":"http:\/\/graucoastal.com\/webos\/crapstogo\/","custsupportemail":"support@graucoastal.com","custsupportphonenum":"","copyright":"Copyright 2010 Grau Coastal Construction, Inc.","licenseURL":"","locale":"en_US","appSize":139028,"installSize":2260072,"isEncrypted":false,"adultRating":false,"islocationbased":false,"lastModifiedTime":"2010-07-21T14:00:10.000+0000","mediaLink":null,"mediaIcon":null,"attributes":{"provides":{"noApp":false,"dockMode":false,"universalSearch":false,"connectors":[],"services":[],"optimizedUserExperience":false}},"price":1.99,"currency":"USD","isAdvertized":false,"filename":"com.graucoastal.crapstogo_1.0.3_all.ipk","free":false,"touchpad_exclusive":false,"images":{"1":{"thumbnail":"4081\/en\/images\/1\/S\/ctg1.png","screenshot":"4081\/en\/images\/1\/L\/ctg1.png","orientation":"P","device":"P"},"2":{"thumbnail":"4081\/en\/images\/2\/S\/ctg2.png","screenshot":"4081\/en\/images\/2\/L\/ctg2.png","orientation":"P","device":"P"},"3":{"thumbnail":"4081\/en\/images\/3\/S\/ctg3.png","screenshot":"4081\/en\/images\/3\/L\/ctg3.png","orientation":"P","device":"P"},"4":{"thumbnail":"4081\/en\/images\/4\/S\/crapstogo5.png","screenshot":"4081\/en\/images\/4\/L\/crapstogo5.png","orientation":"P","device":"P"},"5":{"thumbnail":"4081\/en\/images\/5\/S\/crapstogo8.png","screenshot":"4081\/en\/images\/5\/L\/crapstogo8.png","orientation":"P","device":"P"}}}