{"publicApplicationId":"com.palmdts.beeptestendurance","description":"Beep Test Endurance is an endurance running test based on the U.K. version and contains no rest period between shuttles. Beep tests are very popular with athletes playing field sports and anyone else looking to know and track their fitness level. Simply mark off 22 yards (or 20 meters) with two cones, press the start button, and start running. Your goal is to make it to the other cone before the first beep then back to the original cone before the second beep. Continue running between the cones and when you reach a cone before the corresponding beep simply press the check mark. If you don't make it to the cone in time press the X. Each run to a cone is called a shuttle and when you miss three shuttles in a row you are out. The shuttles are arranged into stages and each stage brings a decrease in the time allowed per shuttle. Use Beep Test Endurance to test your endurance level and see if you can improve it! Keep your eye out for future updates, improvements, and Beep Test Interval.  **Added ability to choose different starting stages**","version":"1.1.0","versionNote":"","homeURL":"http:\/\/www.thebelli.com","supportURL":"http:\/\/www.thebelli.com","custsupportemail":"drag.stats@yahoo.com","custsupportphonenum":"","copyright":"Pending","licenseURL":"","locale":"en_US","appSize":118826,"installSize":1933503,"isEncrypted":false,"adultRating":false,"islocationbased":false,"lastModifiedTime":"2010-07-20T02:29:11.000+0000","mediaLink":null,"mediaIcon":null,"attributes":{"provides":{"noApp":false,"dockMode":false,"universalSearch":false,"connectors":[],"services":[],"optimizedUserExperience":false}},"price":0.99,"currency":"USD","isAdvertized":false,"filename":"com.palmdts.beeptestendurance_1.1.0_all.ipk","free":false,"touchpad_exclusive":false,"images":{"1":{"thumbnail":"4105\/en\/images\/1\/S\/beeptestendurance_2010-13-07_122739.png","screenshot":"4105\/en\/images\/1\/L\/beeptestendurance_2010-13-07_122739.png","orientation":"P","device":"P"}}}