{"publicApplicationId":"com.dblpartners.clepbiology","description":"Upward Mobility’s CLEP Biology Exam Prep software for Palm webOS is the perfect tool to help students prepare for the CLEP Biology subject test. \n\nThis module contains 175 simulated exam questions addressing nearly all the topics commonly covered on the exam, including:\nCellular Biology\nMolecular Biology\nPopulation Biology\nClassical Genetics\nOrganismal Biology\nEvolution and Diversity\n\nEach question is followed by a clear and insightful explanation paired with a Key Takeaway that summarizes the key learning point of the question, ensuring comprehensive understanding of the material. \n\n\nUse as a practice test, study material or refresher! This module designed specifically for the CLEP, but would also be beneficial in studying for the Advanced Placement (AP), A-Levels, PRAXIS II, GED, MCAT and ASVAB exams as well as an introductory level Biology class at the college level.\n\nAuthor:\n\nDr. Joe Barber Jr. is a freelance writer located in Memphis, TN. He received his PhD in Pharmacology from the University of Michigan.  Since 2007, he has worked as a freelance writer in the biomedical sciences, medical, and heath fields.\n\nDr. Barber has received numerous awards, including the Rackham Graduate School Merit Fellowship and the American Association for Cancer Research Minority Scholar Award. He has published research in major research publications and has presented research in venues throughout the world.\n\n\nAbout Upward Mobility\n\nUpward Mobility creates high quality management education and test preparation material that is witty, engaging, and adds value in the learning process.  We hire only expert writers who have strong knowledge in the subject matter and put all of our materials through a thorough review process.\n\nWe are a double bottom line company committed to education in the developing world. Some of the profits will be used to deploy education via mobile phone in emerging countries.","version":"1.0.4","versionNote":"minor content updates","homeURL":"http:\/\/upwardpro.com","supportURL":"http:\/\/upwardpro.com","custsupportemail":"info@upwardpro.com","custsupportphonenum":"","copyright":"DBL Partners LLC","licenseURL":"","locale":"en_US","appSize":681160,"installSize":2883584,"isEncrypted":false,"adultRating":false,"islocationbased":false,"lastModifiedTime":"2012-06-01T10:02:52.000+0000","mediaLink":null,"mediaIcon":null,"attributes":{"provides":{"noApp":false,"dockMode":false,"universalSearch":false,"connectors":["null"],"services":[],"optimizedUserExperience":false}},"price":3.99,"currency":"USD","isAdvertized":false,"filename":"com.dblpartners.clepbiology_1.0.4_all.ipk","free":false,"touchpad_exclusive":false,"images":{"1":{"screenshot":"4226\/1.0.4\/en\/images\/1\/L\/1.png","thumbnail":"4226\/1.0.4\/en\/images\/1\/L\/1.png","orientation":"P","device":"P"},"2":{"screenshot":"4226\/1.0.4\/en\/images\/2\/L\/2.png","thumbnail":"4226\/1.0.4\/en\/images\/2\/L\/2.png","orientation":"P","device":"P"},"3":{"screenshot":"4226\/1.0.4\/en\/images\/3\/L\/3.png","thumbnail":"4226\/1.0.4\/en\/images\/3\/L\/3.png","orientation":"P","device":"P"},"4":{"screenshot":"4226\/1.0.4\/en\/images\/4\/L\/4.png","thumbnail":"4226\/1.0.4\/en\/images\/4\/L\/4.png","orientation":"P","device":"P"},"5":{"screenshot":"4226\/1.0.4\/en\/images\/5\/L\/5.png","thumbnail":"4226\/1.0.4\/en\/images\/5\/L\/5.png","orientation":"P","device":"P"}}}