{"publicApplicationId":"com.dblpartners.clepgovernment","description":"Aiming for a high score on your CLEP American Government exam? Look no further! Upward Mobility's CLEP Exam Prep app for Palm webOS provides 120 simulated exam questions with detailed answers.  Each question is paired with a clear and insightful explanation paired with a Key Takeaway that summarizes the key learning point of the question, ensuring comprehensive understanding of the material.  *  This module addresses nearly all the topics commonly covered on the exam, including government policy in the United States, important political events and decisions, key concepts in government relations, the Constitution, and general terminology necessary for success.  ||   Disclaimer: The College-Level Examination Program® (CLEP) and CLEP are trademarks of College Board which had no role in the creation of this product and does not endorse it.  ||  Katie McConnaughey is a freelance writer and editor based in Redmond, Washington. She received her BA in History from Mount Holyoke College in 2004.  Since that time, she has worked in the publishing industry, primarily on children's and YA  literature. Since going freelance in 2007, Katie has edited, written, proofread, and copyedited for a large variety of clients, including Simon & Schuster, Alloy Entertainment, becker&mayer! book producers, Symphony Space, diacriTech, the NYC Department of Health & Mental Hygiene, and a number of private clients.  ||   Upward Mobility creates high quality management education and test preparation material that is witty, engaging, and adds value in the learning process.  We hire only expert writers who have strong knowledge in the subject matter and put all of our materials through a thorough review process.  *   We are a double bottom line company committed to education in the developing world. Some of the profits will be used to deploy education via mobile phone in emerging countries. ","version":"1.0.3","versionNote":"","homeURL":"http:\/\/upwardpro.com","supportURL":"http:\/\/upwardpro.com","custsupportemail":"info@upwardpro.com","custsupportphonenum":"","copyright":"DBL Partners LLC","licenseURL":"","locale":"en_US","appSize":133804,"installSize":2988615,"isEncrypted":false,"adultRating":false,"islocationbased":false,"lastModifiedTime":"2012-06-01T05:00:24.000+0000","mediaLink":null,"mediaIcon":null,"attributes":{"provides":{"noApp":false,"dockMode":false,"universalSearch":false,"connectors":["null"],"services":[],"optimizedUserExperience":false}},"price":3.99,"currency":"USD","isAdvertized":false,"filename":"com.dblpartners.clepgovernment_1.0.3_all.ipk","free":false,"touchpad_exclusive":false,"images":{"1":{"screenshot":"4227\/1.0.3\/en\/images\/1\/L\/1.png","thumbnail":"4227\/1.0.3\/en\/images\/1\/L\/1.png","orientation":"P","device":"P"},"2":{"screenshot":"4227\/1.0.3\/en\/images\/2\/L\/2.png","thumbnail":"4227\/1.0.3\/en\/images\/2\/L\/2.png","orientation":"P","device":"P"},"3":{"screenshot":"4227\/1.0.3\/en\/images\/3\/L\/3.png","thumbnail":"4227\/1.0.3\/en\/images\/3\/L\/3.png","orientation":"P","device":"P"},"4":{"screenshot":"4227\/1.0.3\/en\/images\/4\/L\/4.png","thumbnail":"4227\/1.0.3\/en\/images\/4\/L\/4.png","orientation":"P","device":"P"},"5":{"screenshot":"4227\/1.0.3\/en\/images\/5\/L\/5.png","thumbnail":"4227\/1.0.3\/en\/images\/5\/L\/5.png","orientation":"P","device":"P"}}}