{"publicApplicationId":"com.dblpartners.apworldhistory2.0","description":"Aiming for a high score on your AP World History exam? Look no further! Whether you are taking the test for the first time or striving to improve your score, Upward Mobility's AP World History Exam Prep software for Palm webOS  is the perfect tool to help students properly prepare for the multiple choice portion of this competitive college preparatory test.\n\nOver 150 simulated exam questions over nearly all topics on the exam, including ancient world civilizations, such as the Shang, Sumarian, and Harrapan Civilizations, and up through the Kyoto Protocol and modern political struggles. \n\nEach multiple-choice question is paired with a clear and thoughtful explanation and a highly-detailed Key Takeaway that summarizes the main learning point of the question, time period, or figure discussed, ensuring a comprehensive understanding of the material.\n\nAbout the Author:\n\nKatie McConnaughey is a freelance writer and editor based in Redmond, Washington. She received her BA in History from Mount Holyoke College in 2004.\n\nSince that time, she has worked in the publishing industry, primarily on children's and YA  literature. Since going freelance in 2007, Katie has edited, written, proofread, and copyedited for a large variety of clients, including Simon & Schuster, Alloy Entertainment, becker&mayer! book producers, Symphony Space, diacriTech, the NYC Department of Health & Mental Hygiene, and a number of private clients.\n\nAbout Upward Mobility\n\nUpward Mobility creates high quality management education and test preparation material that is witty, engaging, and adds value in the learning process.  We hire only expert writers who have strong knowledge in the subject matter and put all of our materials through a thorough review process.\n\nWe are a double bottom line company committed to education in the developing world. Some of the profits will be used to deploy education via mobile phone in emerging countries.","version":"1.0.3","versionNote":"","homeURL":"http:\/\/upwardpro.com","supportURL":"http:\/\/upwardpro.com","custsupportemail":"info@upwardpro.com","custsupportphonenum":"","copyright":"DBL Partners LLC","licenseURL":"","locale":"en_US","appSize":142744,"installSize":3018207,"isEncrypted":false,"adultRating":false,"islocationbased":false,"lastModifiedTime":"2012-06-01T04:51:46.000+0000","mediaLink":null,"mediaIcon":null,"attributes":{"provides":{"noApp":false,"dockMode":false,"universalSearch":false,"connectors":["null"],"services":[],"optimizedUserExperience":false}},"price":3.99,"currency":"USD","isAdvertized":false,"filename":"com.dblpartners.apworldhistory2.0_1.0.3_all.ipk","free":false,"touchpad_exclusive":false,"images":{"1":{"screenshot":"4236\/1.0.3\/en\/images\/1\/L\/1.png","thumbnail":"4236\/1.0.3\/en\/images\/1\/L\/1.png","orientation":"P","device":"P"},"2":{"screenshot":"4236\/1.0.3\/en\/images\/2\/L\/2.png","thumbnail":"4236\/1.0.3\/en\/images\/2\/L\/2.png","orientation":"P","device":"P"},"3":{"screenshot":"4236\/1.0.3\/en\/images\/3\/L\/3.png","thumbnail":"4236\/1.0.3\/en\/images\/3\/L\/3.png","orientation":"P","device":"P"},"4":{"screenshot":"4236\/1.0.3\/en\/images\/4\/L\/4.png","thumbnail":"4236\/1.0.3\/en\/images\/4\/L\/4.png","orientation":"P","device":"P"},"5":{"screenshot":"4236\/1.0.3\/en\/images\/5\/L\/5.png","thumbnail":"4236\/1.0.3\/en\/images\/5\/L\/5.png","orientation":"P","device":"P"}}}