{"publicApplicationId":"com.dblpartners.eppp","description":"The Examination for Professional Practice in Psychology Exam Prep app is Upward Mobility’s focused Palm webOS exam preparation application for the EPPP Exam. This module contains a targeted curriculum of nearly 500 useful questions that address the knowledge required of the successful certified psychologist.  *  On a basic level, the EPPP Exam identifies and assesses whether a prospective psychologist has the competency and skills to practice successfully and to be credentialed. Additionally, the exam identifies a working knowledge of patient care, ethical and legal issues, assessing and diagnosing patients, research methods, statistics, and general knowledge of psychology and behavior. By assessing learned knowledge in practical questions, Upward Mobility’s EPPP Exam Prep will help to successfully bridge the gap between your education and practical patient application.  *  The intuitive Study Mode interface allows you to track your progress through the application and return to difficult questions during your review.  Test mode allows you to take the course as a sample EPPP Exam and quickly review the questions and areas in which you may need extra help.  ||  Upward Mobility creates high quality management education and test preparation material that is witty, engaging, and adds value in the learning process.  We hire only expert writers who have strong knowledge in the subject matter and put all of our materials through a thorough review process.  *   We are a double bottom line company committed to education in the developing world. Some of the profits will be used to deploy education via mobile phone in emerging countries.","version":"1.0.3","versionNote":"","homeURL":"http:\/\/upwardpro.com","supportURL":"http:\/\/upwardpro.com","custsupportemail":"info@upwardpro.com","custsupportphonenum":"","copyright":"DBL Partners LLC","licenseURL":"","locale":"en_US","appSize":215934,"installSize":3408875,"isEncrypted":false,"adultRating":false,"islocationbased":false,"lastModifiedTime":"2012-06-01T05:11:31.000+0000","mediaLink":null,"mediaIcon":null,"attributes":{"provides":{"noApp":false,"dockMode":false,"universalSearch":false,"connectors":["null"],"services":[],"optimizedUserExperience":false}},"price":6.99,"currency":"USD","isAdvertized":false,"filename":"com.dblpartners.eppp_1.0.3_all.ipk","free":false,"touchpad_exclusive":false,"images":{"1":{"screenshot":"4290\/1.0.3\/en\/images\/1\/L\/1.png","thumbnail":"4290\/1.0.3\/en\/images\/1\/L\/1.png","orientation":"P","device":"P"},"2":{"screenshot":"4290\/1.0.3\/en\/images\/2\/L\/2.png","thumbnail":"4290\/1.0.3\/en\/images\/2\/L\/2.png","orientation":"P","device":"P"},"3":{"screenshot":"4290\/1.0.3\/en\/images\/3\/L\/3.png","thumbnail":"4290\/1.0.3\/en\/images\/3\/L\/3.png","orientation":"P","device":"P"},"4":{"screenshot":"4290\/1.0.3\/en\/images\/4\/L\/4.png","thumbnail":"4290\/1.0.3\/en\/images\/4\/L\/4.png","orientation":"P","device":"P"},"5":{"screenshot":"4290\/1.0.3\/en\/images\/5\/L\/5.png","thumbnail":"4290\/1.0.3\/en\/images\/5\/L\/5.png","orientation":"P","device":"P"}}}