{"publicApplicationId":"com.dblpartners.ilrealestate","description":"Want to ace your Illinois real estate salesperson, broker or agent exam?  Look no further!  This study app for palm webOS from Upward Mobility contains 644 simulated exam questions covering essential vocabulary, general real estate knowledge,  and state exam specific topics.  Each question is paired with a detailed explanation written by professional writers and real estate experts.  *  Contents:  233 Real Estate Vocabulary Questions - Covers key vocabulary across the real estate business.  In many cases, people struggle to articulate definitions even if generally they know what they mean.  This is a major barrier on tough exams and this app will help with that,  200 General Topic Questions - Questions that develop your overall knowledge of real estate concepts and US laws\/regulations, 211 Illinois Specific Questions - Focus on key areas of content for the Illinois sales person \/ real estate agent exam.  *  Relevant cities include Chicago, Aurora, Rockford, Naperville, Joliet, Springfield, North Peoria, Elgin and Waukegan.  *  This app addresses all topics on the exam, including Legal Aspects, Encumbrances, Real Estate Law, Financing Escrow, Contracts, Taxation, Subdivision, Business Opportunities, Land Descriptions, Appraisal, and Vocabulary \/ Definitions.  ||  Realtor Prep is a joint venture between United Real Estate Media and Upward Mobility.  ||  Upward Mobility creates high quality management education and test preparation material that is witty, engaging, and adds value in the learning process.  We hire only expert writers who have strong knowledge in the subject matter and put all of our materials through a thorough review process.  *   We are a double bottom line company committed to education in the developing world. Some of the profits will be used to deploy education via mobile phone in emerging countries. ","version":"1.0.3","versionNote":"","homeURL":"http:\/\/upwardpro.com","supportURL":"http:\/\/upwardpro.com","custsupportemail":"info@upwardpro.com","custsupportphonenum":"","copyright":"DBL Partners LLC","licenseURL":"","locale":"en_US","appSize":196188,"installSize":3398126,"isEncrypted":false,"adultRating":false,"islocationbased":false,"lastModifiedTime":"2010-07-28T02:00:59.000+0000","mediaLink":null,"mediaIcon":null,"attributes":{"provides":{"noApp":false,"dockMode":false,"universalSearch":false,"connectors":[],"services":[],"optimizedUserExperience":false}},"price":8.99,"currency":"USD","isAdvertized":false,"filename":"com.dblpartners.ilrealestate_1.0.3_all.ipk","free":false,"touchpad_exclusive":false,"images":{"1":{"thumbnail":"4295\/en\/images\/1\/S\/1.png","screenshot":"4295\/en\/images\/1\/L\/1.png","orientation":"P","device":"P"},"2":{"thumbnail":"4295\/en\/images\/2\/S\/2.png","screenshot":"4295\/en\/images\/2\/L\/2.png","orientation":"P","device":"P"},"3":{"thumbnail":"4295\/en\/images\/3\/S\/3.png","screenshot":"4295\/en\/images\/3\/L\/3.png","orientation":"P","device":"P"},"4":{"thumbnail":"4295\/en\/images\/4\/S\/4.png","screenshot":"4295\/en\/images\/4\/L\/4.png","orientation":"P","device":"P"},"5":{"thumbnail":"4295\/en\/images\/5\/S\/5.png","screenshot":"4295\/en\/images\/5\/L\/5.png","orientation":"P","device":"P"}}}