{"publicApplicationId":"com.dblpartners.cbcp","description":"Upward Mobility’s CBCP Exam Prep for webOS contains a targeted curriculum of 125 simulated exam questions to address key topics in business continuity.  This app contains expertly structured questions with detailed answers that can be used for exam prep or professional training.  Use this as a refresher or last minute review for the valuable Certified Business Continuity Professional title.  *  This app is based on the latest version of the Disaster Recovery Institute (DRI) Professional Practices.  Topics include: Project Initiation and Management, Risk Evaluation and Control, Business Impact Analysis, Developing Business Continuity Strategies, Emergency Response and Operations, Developing and Implementing Business Continuity Plans, Awareness and Training Programs, Exercising and Maintaining Business Continuity Plans, Public Relations and Crisis Coordination, and Coordination with External Agencies  ||  The primary writer and editor for the content was Ted Chan, CBCP.  Ted is an experienced consultant who holds a MBA from MIT’s Sloan School of Management. ||   The Certified Business Continuity Professional (CBCP) designation is an internationally recognised professional certification issued by the Disaster Recovery Institute for business continuity management. A certified expert must pass a detailed exam consisting of ten domains and prove his\/hers experience in at least five domains for minimum two years.  ||  Upward Mobility creates high quality management education and test preparation material that is witty, engaging, and adds value in the learning process.  We hire only expert writers who have strong knowledge in the subject matter and put all of our materials through a thorough review process.  *   We are a double bottom line company committed to education in the developing world. Some of the profits will be used to deploy education via mobile phone in emerging countries.","version":"1.0.3","versionNote":"","homeURL":"http:\/\/upwardpro.com","supportURL":"http:\/\/upwardpro.com","custsupportemail":"info@upwardpro.com","custsupportphonenum":"","copyright":"DBL Partners LLC","licenseURL":"","locale":"en_US","appSize":144816,"installSize":3013915,"isEncrypted":false,"adultRating":false,"islocationbased":false,"lastModifiedTime":"2012-06-01T04:52:19.000+0000","mediaLink":null,"mediaIcon":null,"attributes":{"provides":{"noApp":false,"dockMode":false,"universalSearch":false,"connectors":["null"],"services":[],"optimizedUserExperience":false}},"price":4.99,"currency":"USD","isAdvertized":false,"filename":"com.dblpartners.cbcp_1.0.3_all.ipk","free":false,"touchpad_exclusive":false,"images":{"1":{"screenshot":"4303\/1.0.3\/en\/images\/1\/L\/1.png","thumbnail":"4303\/1.0.3\/en\/images\/1\/L\/1.png","orientation":"P","device":"P"},"2":{"screenshot":"4303\/1.0.3\/en\/images\/2\/L\/2.png","thumbnail":"4303\/1.0.3\/en\/images\/2\/L\/2.png","orientation":"P","device":"P"},"3":{"screenshot":"4303\/1.0.3\/en\/images\/3\/L\/3.png","thumbnail":"4303\/1.0.3\/en\/images\/3\/L\/3.png","orientation":"P","device":"P"},"4":{"screenshot":"4303\/1.0.3\/en\/images\/4\/L\/4.png","thumbnail":"4303\/1.0.3\/en\/images\/4\/L\/4.png","orientation":"P","device":"P"},"5":{"screenshot":"4303\/1.0.3\/en\/images\/5\/L\/5.png","thumbnail":"4303\/1.0.3\/en\/images\/5\/L\/5.png","orientation":"P","device":"P"}}}