{"publicApplicationId":"com.dblpartners.cissp","description":"The Certified Information Systems Security Professional Exam Prep is Upward Mobility’s focused Palm webOS app for the CISSP Exam, as regulated by the International Information Systems Security Certification Consortium (ISC). This module contains a targeted curriculum of 350 simulated exam questions dealing with the successful application of system maintenance and security.  Each question is paired with a clear and insightful explanation and a Key Takeaway that summarizes the key learning point of the question, ensuring comprehensive understanding of the material.  *  The CISSP Exam Prep covers ten core knowledge areas: application security, access control, business continuity and disaster recovery, risk management and information security, cryptography, environmental security, operations security, legal issues, network security and telecommunications, and security systems design.  *  As defined by the ISC, the purpose of the CISSP is to test qualified security professionals upon a standardized compendium of security information, relevant to professionals around the world. Upward Mobility’s CISSP Exam Prep will help you to bridge the gap between your system security knowledge and practical hands-on application.  ||  Upward Mobility creates high quality management education and test preparation material that is witty, engaging, and adds value in the learning process.  We hire only expert writers who have strong knowledge in the subject matter and put all of our materials through a thorough review process.  *   We are a double bottom line company committed to education in the developing world. Some of the profits will be used to deploy education via mobile phone in emerging countries. **This app is neither associated with nor endorse by the ISC.","version":"1.0.4","versionNote":"","homeURL":"http:\/\/upwardpro.com","supportURL":"http:\/\/upwardpro.com","custsupportemail":"info@upwardpro.com","custsupportphonenum":"","copyright":"DBL Partners LLC","licenseURL":"","locale":"en_US","appSize":210202,"installSize":2162688,"isEncrypted":false,"adultRating":false,"islocationbased":false,"lastModifiedTime":"2012-06-01T10:02:52.000+0000","mediaLink":null,"mediaIcon":null,"attributes":{"provides":{"noApp":false,"dockMode":false,"universalSearch":false,"connectors":["null"],"services":[],"optimizedUserExperience":false}},"price":4.99,"currency":"USD","isAdvertized":false,"filename":"com.dblpartners.cissp_1.0.4_all.ipk","free":false,"touchpad_exclusive":false,"images":{"1":{"screenshot":"4309\/1.0.4\/en\/images\/1\/L\/ph_photo3.jpg","thumbnail":"4309\/1.0.4\/en\/images\/1\/S\/ph_photo3.jpg","orientation":"P","device":"P"},"2":{"screenshot":"4309\/1.0.4\/en\/images\/2\/L\/ph_photo3.jpg","thumbnail":"4309\/1.0.4\/en\/images\/2\/S\/ph_photo3.jpg","orientation":"P","device":"P"},"3":{"screenshot":"4309\/1.0.4\/en\/images\/3\/L\/ph_photo3.jpg","thumbnail":"4309\/1.0.4\/en\/images\/3\/S\/ph_photo3.jpg","orientation":"P","device":"P"}}}