{"publicApplicationId":"com.dblpartners.70-680","description":"Upward Mobility's 70-680 Configuring Windows 7 Exam Prep app for Palm webOS is a valuable tool written by certified experts.  This module contains a targeted curriculum of 107 simulated exam questions dealing with topics on the Windows 7 exam.  It can also be used for a new Windows 7 user\/technician who wishes to master configuring the system.  *  In our 70-680 module, each question is paired with a clear and insightful explanation paired with a Key Takeaway that summarizes the key learning point of the question, ensuring comprehensive understanding of the material.   Not only that, Key Takeaways support the answer with important insights on how to practically apply the knowledge in a real world situation so you can be more successful in your career.  This module combines questions that focus on core concepts and vocabulary, as well as scenarios that simulate the ones a technician would face in real life.  ||  The Microsoft Certified Technology Specialist (MCTS) certifications provide the foundation for Microsoft Certification. These certifications are designed to validate your skills on the features and functionality of key technologies. You can show your depth of knowledge in one specific technology, earn multiple MCTS certifications to show breadth across different products, or build on the MCTS to earn a Microsoft Certified IT Professional (MCITP) credential.  ||   Upward Mobility creates high quality management education and test preparation material that is witty, engaging, and adds value in the learning process.  We hire only expert writers who have strong knowledge in the subject matter and put all of our materials through a thorough review process.  *   We are a double bottom line company committed to education in the developing world. Some of the profits will be used to deploy education via mobile phone in emerging countries.","version":"1.0.4","homeURL":"http:\/\/upwardpro.com","supportURL":"http:\/\/upwardpro.com","custsupportemail":"","custsupportphonenum":"","copyright":"DBL Partners LLC","licenseURL":"http:\/\/upwardpro.com","locale":null,"appSize":"200662","installSize":"200662","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"3.99","currency":"USD","filename":"com.dblpartners.70-680_1.0.4_all.ipk","free":false,"images":[{"thumbnail":"4318\/icon\/S\/icon_1_0_4.png","screenshot":"4318\/icon\/S\/icon_1_0_4.png","orientation":"P","device":"P"},{"thumbnail":"4318\/icon\/S\/icon_1_0_4.png","screenshot":"4318\/icon\/S\/icon_1_0_4.png","orientation":"P","device":"P"},{"thumbnail":"4318\/icon\/S\/icon_1_0_4.png","screenshot":"4318\/icon\/S\/icon_1_0_4.png","orientation":"P","device":"P"},{"thumbnail":"4318\/icon\/S\/icon_1_0_4.png","screenshot":"4318\/icon\/S\/icon_1_0_4.png","orientation":"P","device":"P"},{"thumbnail":"4318\/icon\/S\/icon_1_0_4.png","screenshot":"4318\/icon\/S\/icon_1_0_4.png","orientation":"P","device":"P"}]}