{"publicApplicationId":"com.dblpartners.realtorpreptexas","description":"Want to ace your Texas real estate exam?  Look not further!  This app for the Palm webOS contains 419 questions covering essential vocabulary and state exam specific knowledge.  Each question is paired with a detailed explanation written by professional writers and real estate experts. *  Contents:  233 Real Estate Vocabulary Questions - Covers key vocabulary across the real estate business.  In many cases, people struggle to articulate definitions even if generally they know what they mean.  This is a major barrier on tough exams and this app will help with that.  186 Texas Specific Questions - Focus on key areas of content for the Texas sales person \/ real estate agent exam.  *  This app addresses nearly all topics on the exam, including Legal Aspect, Encumbrances, Real Estate Law, Financing Escrow, Contracts, Taxation, Subdivision, Business Opportunities, Land Descriptions, Appraisal, and Vocabulary \/ Definitions.  *  Key Cities Covered: Houston, Dallas, San Antonio, Austin, El Paso, Fort Worth, Arlington, Corpus Christi, Plano, Garland, Lubbock, Irving  ||  Realtor Prep is a joint venture between United Real Estate Media and Upward Mobility.  ||  Upward Mobility creates high quality management education and test preparation material that is witty, engaging, and adds value in the learning process.  We hire only expert writers who have strong knowledge in the subject matter and put all of our materials through a thorough review process.  *   We are a double bottom line company committed to education in the developing world. Some of the profits will be used to deploy education via mobile phone in emerging countries. ","version":"1.0.3","versionNote":"","homeURL":"http:\/\/upwardpro.com","supportURL":"http:\/\/upwardpro.com","custsupportemail":"info@upwardpro.com","custsupportphonenum":"","copyright":"DBL Partners LLC","licenseURL":"","locale":"en_US","appSize":127086,"installSize":3103617,"isEncrypted":false,"adultRating":false,"islocationbased":false,"lastModifiedTime":"2010-07-29T19:05:01.000+0000","mediaLink":null,"mediaIcon":null,"attributes":{"provides":{"noApp":false,"dockMode":false,"universalSearch":false,"connectors":[],"services":[],"optimizedUserExperience":false}},"price":8.99,"currency":"USD","isAdvertized":false,"filename":"com.dblpartners.realtorpreptexas_1.0.3_all.ipk","free":false,"touchpad_exclusive":false,"images":{"1":{"thumbnail":"4339\/en\/images\/1\/S\/1.png","screenshot":"4339\/en\/images\/1\/L\/1.png","orientation":"P","device":"P"},"2":{"thumbnail":"4339\/en\/images\/2\/S\/2.png","screenshot":"4339\/en\/images\/2\/L\/2.png","orientation":"P","device":"P"},"3":{"thumbnail":"4339\/en\/images\/3\/S\/3.png","screenshot":"4339\/en\/images\/3\/L\/3.png","orientation":"P","device":"P"},"4":{"thumbnail":"4339\/en\/images\/4\/S\/4.png","screenshot":"4339\/en\/images\/4\/L\/4.png","orientation":"P","device":"P"},"5":{"thumbnail":"4339\/en\/images\/5\/S\/5.png","screenshot":"4339\/en\/images\/5\/L\/5.png","orientation":"P","device":"P"}}}