{"publicApplicationId":"com.dblpartners.naplex","description":"The North American Pharmacist Licensure Exam Prep is Upward Mobility’s focused exam preparation app for Palm webOS for the NAPLEX Exam. This module contains a targeted curriculum of more than 400 useful questions dealing with the successful knowledge of the practice of pharmacy.  *  On a basic level, the NAPLEX Exam identifies and assesses whether a prospective pharmacist has the ability to identify and demonstrate safe pharmacological standards and optimize outcomes in patients.  *  Additionally, the exam identifies a working knowledge of safe methods to prepare and dispense various kinds of medications. By assessing learned knowledge in practical real-life scenario questions, Upward Mobility’s NAPLEX Exam Prep will help to bridge the gap between your pharmacotherapy knowledge and practical patient\/client application.  ||  The intuitive Study Mode interface allows you to track your progress through the application and return to difficult questions during your review.  Test mode allows you to take the course as a sample NAPLEX Exam and quickly review the questions and areas in which you may need extra help.  ||  Upward Mobility creates high quality management education and test preparation material that is witty, engaging, and adds value in the learning process.  We hire only expert writers who have strong knowledge in the subject matter and put all of our materials through a thorough review process.  *   We are a double bottom line company committed to education in the developing world. Some of the profits will be used to deploy education via mobile phone in emerging countries..  || Upward Mobility is not affiliated with and this app is not endorsed by the NABP.","version":"1.0.4","versionNote":"Minor content updates.","homeURL":"http:\/\/upwardpro.com","supportURL":"http:\/\/upwardpro.com","custsupportemail":"info@upwardpro.com","custsupportphonenum":"","copyright":"DBL Partners LLC","licenseURL":"","locale":"en_US","appSize":173240,"installSize":2031616,"isEncrypted":false,"adultRating":false,"islocationbased":false,"lastModifiedTime":"2012-06-01T09:37:53.000+0000","mediaLink":null,"mediaIcon":null,"attributes":{"provides":{"noApp":false,"dockMode":false,"universalSearch":false,"connectors":["null"],"services":[],"optimizedUserExperience":false}},"price":7.99,"currency":"USD","isAdvertized":false,"filename":"com.dblpartners.naplex_1.0.4_all.ipk","free":false,"touchpad_exclusive":false,"images":{"1":{"screenshot":"4340\/1.0.4\/en\/images\/1\/L\/1.png","thumbnail":"4340\/1.0.4\/en\/images\/1\/L\/1.png","orientation":"P","device":"P"},"2":{"screenshot":"4340\/1.0.4\/en\/images\/2\/L\/2.png","thumbnail":"4340\/1.0.4\/en\/images\/2\/L\/2.png","orientation":"P","device":"P"},"3":{"screenshot":"4340\/1.0.4\/en\/images\/3\/L\/3.png","thumbnail":"4340\/1.0.4\/en\/images\/3\/L\/3.png","orientation":"P","device":"P"},"4":{"screenshot":"4340\/1.0.4\/en\/images\/4\/L\/4.png","thumbnail":"4340\/1.0.4\/en\/images\/4\/L\/4.png","orientation":"P","device":"P"},"5":{"screenshot":"4340\/1.0.4\/en\/images\/5\/L\/5.png","thumbnail":"4340\/1.0.4\/en\/images\/5\/L\/5.png","orientation":"P","device":"P"}}}