{"publicApplicationId":"com.dblpartners.70-294final","description":"Upward Mobility’s 70-294 Exam Prep (Planning, Implementing, and Maintaining a Microsoft Windows Server 2003 Active Directory Infrastructure) app for Palm webOS is a valuable tool written by certified experts to help you achieve this valuable certification.  This module contains a targeted curriculum of 101 simulated exam questions dealing with topics on the Network Infrastructure Exam.   *  In our 70-294 module, each question is paired with a clear and insightful explanation paired with a Key Takeaway that summarizes the key learning point of the question, ensuring comprehensive understanding of the material.   Not only that, Key Takeaways support the answer with important insights on how to practically apply the knowledge in a real world situation so you can be more successful in your career.  This module combines questions that focus on core concepts and vocabulary of network infrastructure and security, as well as scenarios that simulate the ones a technician would face in real life.  ||   The Microsoft Certified Systems Engineer (MCSE) on Windows Server 2003 credential is intended for IT professionals who work in the typically complex computing environment of medium to large companies.  *  An MCSE candidate should have at least one year of experience implementing and administering a a large network.  ||  Upward Mobility creates high quality management education and test preparation material that is witty, engaging, and adds value in the learning process.  We hire only expert writers who have strong knowledge in the subject matter and put all of our materials through a thorough review process.  *   We are a double bottom line company committed to education in the developing world. Some of the profits will be used to deploy education via mobile phone in emerging countries.","version":"1.0.3","homeURL":"http:\/\/upwardpro.com","supportURL":"http:\/\/upwardpro.com","custsupportemail":"","custsupportphonenum":"","copyright":"DBL Partners LLC","licenseURL":"http:\/\/upwardpro.com","locale":null,"appSize":"153524","installSize":"153524","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"3.99","currency":"USD","filename":"com.dblpartners.70-294final_1.0.3_all.ipk","free":false,"images":[{"thumbnail":"4342\/en\/images\/1\/L\/1.png","screenshot":"4342\/en\/images\/1\/L\/1.png","orientation":"P","device":"P"},{"thumbnail":"4342\/en\/images\/2\/L\/2.png","screenshot":"4342\/en\/images\/2\/L\/2.png","orientation":"P","device":"P"},{"thumbnail":"4342\/en\/images\/3\/L\/3.png","screenshot":"4342\/en\/images\/3\/L\/3.png","orientation":"P","device":"P"},{"thumbnail":"4342\/en\/images\/4\/L\/4.png","screenshot":"4342\/en\/images\/4\/L\/4.png","orientation":"P","device":"P"},{"thumbnail":"4342\/en\/images\/5\/L\/5.png","screenshot":"4342\/en\/images\/5\/L\/5.png","orientation":"P","device":"P"}]}