{"publicApplicationId":"com.tearn.ks5","description":"Keys is an advanced, unique learning platform that simplifies complex subjects, aids memorization, and improves your scores on public exams.  Unlike trivial, boring glossary lists, Keys centralizes and livens the wealth of information on the web directly onto your touch device with a tap.  - Our thoughtful concept maps organize hundreds of terms into chapters and units - telling stories that simplify learning via subject context - Unique flow selectors ease access to terms and chapters - Each term has a subject specific definition with live links to relevant web pages - Terms use age appropriate words for kids, teens, and adults - depending on the specific app - Supporting images from search embed with no typing required - to associate terms with thousands of rich, graphical representations on the web, thus promoting unconscious competence (ie painless learning) - Classic flash card, match, and slots activities maintain interest during repetitive exposure - while stimulating kinesthetic neural bonds in your memory cortex - Innovative Pictionary with a search-bot game for testing comprehension - Unique, responsive animations for the best user experience on touch devices  Keys makes learning fun for all ages. Join the 100,000 plus who have downloaded Keys apps.   This 1,000-page book targets Fund Representative preparation for the Series 6 exam. It is part of a 4-book series targeting stocks, active investing, Series 6 fund rep preparation, and Series 7 Securities representative certification. ","version":"4.8.0","versionNote":"","homeURL":"http:\/\/blog.tearn.com","supportURL":"http:\/\/keys.tearn.com","custsupportemail":"djc8080@gmail.com","custsupportphonenum":"","copyright":"copyright 2010 tEarn Media","licenseURL":"","locale":"en_US","appSize":230272,"installSize":1813462,"isEncrypted":false,"adultRating":false,"islocationbased":false,"lastModifiedTime":"2010-07-30T04:36:00.000+0000","mediaLink":null,"mediaIcon":null,"attributes":{"provides":{"noApp":false,"dockMode":false,"universalSearch":false,"connectors":[],"services":[],"optimizedUserExperience":false}},"price":0,"currency":"USD","isAdvertized":false,"filename":"com.tearn.ks5_4.8.0_all.ipk","free":false,"touchpad_exclusive":false,"images":{"1":{"thumbnail":"4354\/en\/images\/1\/S\/s50.jpg","screenshot":"4354\/en\/images\/1\/L\/s50.jpg","orientation":"P","device":"P"},"2":{"thumbnail":"4354\/en\/images\/2\/S\/s51.jpg","screenshot":"4354\/en\/images\/2\/L\/s51.jpg","orientation":"P","device":"P"},"3":{"thumbnail":"4354\/en\/images\/3\/S\/s53.jpg","screenshot":"4354\/en\/images\/3\/L\/s53.jpg","orientation":"P","device":"P"},"4":{"thumbnail":"4354\/en\/images\/4\/S\/s52.jpg","screenshot":"4354\/en\/images\/4\/L\/s52.jpg","orientation":"P","device":"P"},"5":{"thumbnail":"4354\/en\/images\/5\/S\/s54.jpg","screenshot":"4354\/en\/images\/5\/L\/s54.jpg","orientation":"P","device":"P"}}}