{"publicApplicationId":"com.dblpartners.praxispsychology","description":"Upward Mobility’s Praxis II Psychology Exam Prep software for Palm webOS is the perfect tool to help prospective teachers prepare for the Praxis subject test.  *  The module contains 150 simulated exam questions addressing nearly all the topics commonly covered on the exam.  Each question is followed by a clear and insightful explanation paired with a Key Takeaway. The key takeaway summarizes the key learning point of the question, ensuring comprehensive understanding of the material.  *  Our focus is not to blanket you with hundreds of questions, but rather to focus on the key concepts in reviewing for the exam. We recognize your time is valuable, so each question is structured to help you master an important area of knowledge for the test.  Topics include Physiological Psychology, Perception, Sensation and Cognition; Emotion, Motivation, and Learning; Statistics and Research Methodology; Abnormal Psychology, Personality and Social Psychology; and Human Growth and Development * This exam is also effective review for an introductory level Psychology class at the college level, or as a course-in-an-app for someone who wishes to learn the material on their own.   ||   Upward Mobility creates high quality management education and test preparation material that is witty, engaging, and adds value in the learning process.  We hire only expert writers who have strong knowledge in the subject matter and put all of our materials through a thorough review process.  *   We are a double bottom line company committed to education in the developing world. Some of the profits will be used to deploy education via mobile phone in emerging countries.\n","version":"1.0.3","versionNote":"","homeURL":"http:\/\/upwardpro.com","supportURL":"http:\/\/upwardpro.com","custsupportemail":"info@upwardpro.com","custsupportphonenum":"","copyright":"DBL Partners LLC","licenseURL":"","locale":"en_US","appSize":140910,"installSize":3030524,"isEncrypted":false,"adultRating":false,"islocationbased":false,"lastModifiedTime":"2012-06-01T05:19:10.000+0000","mediaLink":null,"mediaIcon":null,"attributes":{"provides":{"noApp":false,"dockMode":false,"universalSearch":false,"connectors":["null"],"services":[],"optimizedUserExperience":false}},"price":3.99,"currency":"USD","isAdvertized":false,"filename":"com.dblpartners.praxispsychology_1.0.3_all.ipk","free":false,"touchpad_exclusive":false,"images":{"1":{"screenshot":"4371\/1.0.3\/en\/images\/1\/L\/1.png","thumbnail":"4371\/1.0.3\/en\/images\/1\/L\/1.png","orientation":"P","device":"P"},"2":{"screenshot":"4371\/1.0.3\/en\/images\/2\/L\/2.png","thumbnail":"4371\/1.0.3\/en\/images\/2\/L\/2.png","orientation":"P","device":"P"},"3":{"screenshot":"4371\/1.0.3\/en\/images\/3\/L\/3.png","thumbnail":"4371\/1.0.3\/en\/images\/3\/L\/3.png","orientation":"P","device":"P"},"4":{"screenshot":"4371\/1.0.3\/en\/images\/4\/L\/4.png","thumbnail":"4371\/1.0.3\/en\/images\/4\/L\/4.png","orientation":"P","device":"P"},"5":{"screenshot":"4371\/1.0.3\/en\/images\/5\/L\/5.png","thumbnail":"4371\/1.0.3\/en\/images\/5\/L\/5.png","orientation":"P","device":"P"}}}