{"publicApplicationId":"com.dblpartners.casefinal","description":"Upward Mobility's PMLiftoff app for Palm webOS contains a targeted curriculum of 209 questions addressing key topics in project management with wit, humor and actionable business advice.  *  Each question is paired with a clear and insightful explanation and a Key Takeaway to bridge the gap between conceptual knowledge and practical application.  *   Each question has been custom-written to teach a concept from the Project Management Institute's Book of Knowledge, and Areas covered focus on the BoK expertise groupings: Communications Management, Integration Management, Cost Management, Scope Management, Risk Management, Procurement Management, Time Management, Quality Management, Human Resources Management, Professional Responsibility, and Project Management Framework  *  PMLiftoff's sister product is PMConcepts.  PMConcepts is designed specifically for people taking the PMI's PMP exam.  The two products are similar, so we do not recommend the purchase of both.  However, PMLiftoff's actionable takeaways are focused on professional growth rather than test tips.  ||  PMLiftoff was written and edited by Project Management Institute certified project managers (PMPs). The primary editor for the content was Ted Chan, an experienced PMP who holds a MBA from MIT’s Sloan School of Management. Ted has also been a professional writer and appeared in many major publications including ESPN.com  ||  Upward Mobility creates high quality management education and test preparation material that is witty, engaging, and adds value in the learning process.  We hire only expert writers who have strong knowledge in the subject matter and put all of our materials through a thorough review process.  *   We are a double bottom line company committed to education in the developing world. Some of the profits will be used to deploy education via mobile phone in emerging countries.","version":"1.0.3","versionNote":"","homeURL":"http:\/\/upwardpro.com","supportURL":"http:\/\/upwardpro.com","custsupportemail":"info@upwardpro.com","custsupportphonenum":"","copyright":"DBL Partners LLC","licenseURL":"","locale":"en_US","appSize":284028,"installSize":3800396,"isEncrypted":false,"adultRating":false,"islocationbased":false,"lastModifiedTime":"2012-06-01T04:51:35.000+0000","mediaLink":null,"mediaIcon":null,"attributes":{"provides":{"noApp":false,"dockMode":false,"universalSearch":false,"connectors":["null"],"services":[],"optimizedUserExperience":false}},"price":14.99,"currency":"USD","isAdvertized":false,"filename":"com.dblpartners.casefinal_1.0.3_all.ipk","free":false,"touchpad_exclusive":false,"images":{"1":{"screenshot":"4378\/1.0.3\/en\/images\/1\/L\/1.png","thumbnail":"4378\/1.0.3\/en\/images\/1\/L\/1.png","orientation":"P","device":"P"},"2":{"screenshot":"4378\/1.0.3\/en\/images\/2\/L\/2.png","thumbnail":"4378\/1.0.3\/en\/images\/2\/L\/2.png","orientation":"P","device":"P"},"3":{"screenshot":"4378\/1.0.3\/en\/images\/3\/L\/3.png","thumbnail":"4378\/1.0.3\/en\/images\/3\/L\/3.png","orientation":"P","device":"P"},"4":{"screenshot":"4378\/1.0.3\/en\/images\/4\/L\/4.png","thumbnail":"4378\/1.0.3\/en\/images\/4\/L\/4.png","orientation":"P","device":"P"},"5":{"screenshot":"4378\/1.0.3\/en\/images\/5\/L\/5.png","thumbnail":"4378\/1.0.3\/en\/images\/5\/L\/5.png","orientation":"P","device":"P"}}}