{"publicApplicationId":"com.dblpartners.sixsigmablack","description":"Upward Mobility’s Six Sigma Black Belt test prep app for Palm webOS contains 150 simulated exam questions addressing key topics for this important certification from the American Society for Quality (ASQ).  Each question is paired with a clear and insightful explanation with a Key Takeaway that summarizes the key learning point of the question, ensuring comprehensive understanding of the material.   *  This app would also be useful for anyone studying for IASSC's Black Belt certification (CGB), or who wants to improve their general Six Sigma \/ quality management skills.  It is also an effective refresher for those who need to be re-certified.  ||  The primary editors for the content were Ted Chan, an experienced project manager who holds a MBA from MIT’s Sloan School of Management, and Eric Chan, an ASQ certified industrial engineer.   ||   The Certified Six Sigma Black Belt is a professional who can explain Six Sigma philosophies and principles, including supporting systems and tools. A Black Belt should demonstrate team leadership, understand team dynamics and assign team member roles and responsibilities. Black Belts have a thorough understanding of all aspects of the DMAIC model in accordance with Six Sigma principles. They have basic knowledge of Lean enterprise concepts, are able to identify non-value-added elements and activities and are able to use specific tools.   ||    Disclaimer: Upward Mobility is not associated with the ASQ, IASSC or any other professional organization.   ||  Upward Mobility creates high quality management education and test preparation material that is witty, engaging, and adds value in the learning process.  We hire only expert writers who have strong knowledge in the subject matter and put all of our materials through a thorough review process.  *   We are a double bottom line company committed to education in the developing world. Some of the profits will be used to deploy education via mobile phone in emerging countries.","version":"1.0.3","versionNote":"","homeURL":"http:\/\/upwardpro.com","supportURL":"http:\/\/upwardpro.com","custsupportemail":"info@upwardpro.com","custsupportphonenum":"","copyright":"DBL Partners LLC","licenseURL":"","locale":"en_US","appSize":186804,"installSize":3349677,"isEncrypted":false,"adultRating":false,"islocationbased":false,"lastModifiedTime":"2012-06-01T05:33:36.000+0000","mediaLink":null,"mediaIcon":null,"attributes":{"provides":{"noApp":false,"dockMode":false,"universalSearch":false,"connectors":["null"],"services":[],"optimizedUserExperience":false}},"price":4.99,"currency":"USD","isAdvertized":false,"filename":"com.dblpartners.sixsigmablack_1.0.3_all.ipk","free":false,"touchpad_exclusive":false,"images":{"1":{"screenshot":"4381\/1.0.3\/en\/images\/1\/L\/1.png","thumbnail":"4381\/1.0.3\/en\/images\/1\/L\/1.png","orientation":"P","device":"P"},"2":{"screenshot":"4381\/1.0.3\/en\/images\/2\/L\/2.png","thumbnail":"4381\/1.0.3\/en\/images\/2\/L\/2.png","orientation":"P","device":"P"},"3":{"screenshot":"4381\/1.0.3\/en\/images\/3\/L\/3.png","thumbnail":"4381\/1.0.3\/en\/images\/3\/L\/3.png","orientation":"P","device":"P"},"4":{"screenshot":"4381\/1.0.3\/en\/images\/4\/L\/4.png","thumbnail":"4381\/1.0.3\/en\/images\/4\/L\/4.png","orientation":"P","device":"P"},"5":{"screenshot":"4381\/1.0.3\/en\/images\/5\/L\/5.png","thumbnail":"4381\/1.0.3\/en\/images\/5\/L\/5.png","orientation":"P","device":"P"}}}