{"publicApplicationId":"com.dblpartners.nbdebundle","description":"Upward Mobility’s National Board Dental Exam Bundle app for Palm webOS is a valuable tool to help you pass the important American Dental Association (ADA) NBDE Part I and Part II exams.  This Bundle gives you a 20% savings over buying the apps separately. *  This practice exam\/review module contains 800 questions written by professional writers with concise, but detailed explanations ensure the comprehension needed for the exam.  400 questions in this module address Part I, and 400 address Part II.  Topics include:\n(Part I) Anatomic Sciences, Biochemistry, Physiology,  Microbiology, Pathology, Dental Anatomy, and Occlusion. (Part II) Endodontics, Operative Dentistry, Oral and Maxillofacial Surgery\/Pain Control, Oral Diagnosis, Orthodontics\/Pediatric Dentistry, Patient Management, Periodontics, Pharmacology, Prosthodontics  ||  The National Board Dental Exam (NBDE) assists state dental boards in determining qualifications of dentists who seek licensure to practice dentistry. The examination assesses the ability to understand important information from basic biomedical and dental sciences and also the ability to apply such information in a problem-solving context.  ||  Upward Mobility creates high quality management education and test preparation material that is witty, engaging, and adds value in the learning process.  We hire only expert writers who have strong knowledge in the subject matter and put all of our materials through a thorough review process.  *   We are a double bottom line company committed to education in the developing world. Some of the profits will be used to deploy education via mobile phone in emerging countries.  ||  Upward Mobility is not affiliated with and this app is not endorsed by the ADA.","version":"1.0.4","versionNote":"minor content upgrades.","homeURL":"http:\/\/upwardpro.com","supportURL":"http:\/\/upwardpro.com","custsupportemail":"info@upwardpro.com","custsupportphonenum":"","copyright":"DBL Partners LLC","licenseURL":"","locale":"en_US","appSize":225816,"installSize":2359296,"isEncrypted":false,"adultRating":false,"islocationbased":false,"lastModifiedTime":"2012-06-01T09:39:32.000+0000","mediaLink":null,"mediaIcon":null,"attributes":{"provides":{"noApp":false,"dockMode":false,"universalSearch":false,"connectors":["null"],"services":[],"optimizedUserExperience":false}},"price":15.99,"currency":"USD","isAdvertized":false,"filename":"com.dblpartners.nbdebundle_1.0.4_all.ipk","free":false,"touchpad_exclusive":false,"images":{"1":{"screenshot":"4390\/1.0.4\/en\/images\/1\/L\/1.png","thumbnail":"4390\/1.0.4\/en\/images\/1\/L\/1.png","orientation":"P","device":"P"},"2":{"screenshot":"4390\/1.0.4\/en\/images\/2\/L\/2.png","thumbnail":"4390\/1.0.4\/en\/images\/2\/L\/2.png","orientation":"P","device":"P"},"3":{"screenshot":"4390\/1.0.4\/en\/images\/3\/L\/3.png","thumbnail":"4390\/1.0.4\/en\/images\/3\/L\/3.png","orientation":"P","device":"P"},"4":{"screenshot":"4390\/1.0.4\/en\/images\/4\/L\/4.png","thumbnail":"4390\/1.0.4\/en\/images\/4\/L\/4.png","orientation":"P","device":"P"},"5":{"screenshot":"4390\/1.0.4\/en\/images\/5\/L\/5.png","thumbnail":"4390\/1.0.4\/en\/images\/5\/L\/5.png","orientation":"P","device":"P"}}}