{"publicApplicationId":"com.dblpartners.nclexpn","description":"Upward Mobility’s NCLEX-PN Exam Prep app for Palm webOS is a valuable tool to help you pass this important practical nursing certification exam administered by the NCSBN.    *  As part of our social mission of making quality health care education more universally affordable, we are making this app available for $9.99, off from the normal price of $17.99.  || All of our app content is created exclusively for Upward Mobility by expert writers who have strong knowledge in the subject matter and all of our materials undergo a thorough review process.\"  ||  This practice module contains 500 questions written by professional writers with concise, but detailed explanations to help you prepare for this test.  This module covers all topics on the exam, including Safe and Effective Care Environment Questions, Health Promotion and Maintenance Questions, Psychosocial Integrity Questions, Physiological Integrity Questions  ||  While this module is designed for the NCLEX exam, it would also be helpful on medical board tests such as the USMLE, the MCAT, other international licensure tests, and any other professional  exam that requires deep knowledge in the topic areas below.  ||  NCLEX (National Council Licensure EXamination) is an examination for the licensing of nurses in the United States administered by the National Council of State Boards of Nursing.  Upward Mobility has no affiliation with and this app is not endorsed by the NCSBN  ||   Upward Mobility creates high quality management education and test preparation material that is witty, engaging, and adds value in the learning process.  *   We are a double bottom line company committed to education in the developing world. Some of the profits will be used to deploy education via mobile phone in emerging countries.","version":"1.0.3","versionNote":"","homeURL":"http:\/\/upwardpro.com","supportURL":"http:\/\/upwardpro.com","custsupportemail":"info@upwardpro.com","custsupportphonenum":"","copyright":"DBL Partners LLC","licenseURL":"","locale":"en_US","appSize":208142,"installSize":3398128,"isEncrypted":false,"adultRating":false,"islocationbased":false,"lastModifiedTime":"2012-06-01T05:39:34.000+0000","mediaLink":null,"mediaIcon":null,"attributes":{"provides":{"noApp":false,"dockMode":false,"universalSearch":false,"connectors":["null"],"services":[],"optimizedUserExperience":false}},"price":9.99,"currency":"USD","isAdvertized":false,"filename":"com.dblpartners.nclexpn_1.0.3_all.ipk","free":false,"touchpad_exclusive":false,"images":{"1":{"screenshot":"4396\/1.0.3\/en\/images\/1\/L\/1.png","thumbnail":"4396\/1.0.3\/en\/images\/1\/L\/1.png","orientation":"P","device":"P"},"2":{"screenshot":"4396\/1.0.3\/en\/images\/2\/L\/2.png","thumbnail":"4396\/1.0.3\/en\/images\/2\/L\/2.png","orientation":"P","device":"P"},"3":{"screenshot":"4396\/1.0.3\/en\/images\/3\/L\/3.png","thumbnail":"4396\/1.0.3\/en\/images\/3\/L\/3.png","orientation":"P","device":"P"},"4":{"screenshot":"4396\/1.0.3\/en\/images\/4\/L\/4.png","thumbnail":"4396\/1.0.3\/en\/images\/4\/L\/4.png","orientation":"P","device":"P"},"5":{"screenshot":"4396\/1.0.3\/en\/images\/5\/L\/5.png","thumbnail":"4396\/1.0.3\/en\/images\/5\/L\/5.png","orientation":"P","device":"P"}}}