{"publicApplicationId":"com.igolf.mobile","description":"Improve your scores with this FREE golf GPS application that utilizes professionally mapped GPS distances to the front, center, back of the green and custom points, along with listings for more than 33,000 golf courses worldwide. Upgrade to a Premium Membership and view interactive maps with distance to any point on the hole for detailed shot planning. The added Swing Analysis feature allows golfers to upload and compare their swing with friends, family, golf groups, and celebrities using their Pre or Pixi smartphone. FREE iGolf Mobile membership provides access to the following features: distances to the front, center, back of the green and custom points; Swing Analysis; shot distance measurement; scorekeeping for up to four players; handicap\/statistic tracking; auto hole advance and auto course recognition; the latest golf news, reviews and opinion articles; as well as Premium Preview -  an interactive map of the first hole on every golf course. In addition to all of the FREE features, Premium iGolf Mobile members receive the added benefit of interactive hole maps with multi-level zoom for detailed shot planning; distances to any point on the hole and from that point to the green; expanded video upload abilities in Swing Analysis; as well as quick view front, center, and back of green distances. Thousands of golfers rely on the accuracy and reliability of iGolf products and services every day; ensuring that golf GPS data has been tested and verified on the course. iGolf employs a full-time, dedicated mapping and audit team to verify that all golf course maps and GPS data is updated and accurate. This is not a trial offer, and there is no charge to access distance to the front, center, back of the green, custom points and listings for over 33,000 courses.","version":"2.5.0","versionNote":"","homeURL":"http:\/\/www.igolf.com","supportURL":"http:\/\/www.igolf.com","custsupportemail":"support@l1inc.com","custsupportphonenum":"","copyright":"Copyright 2011 L1 Technologies, Inc.","licenseURL":"","locale":"en_US","appSize":5588346,"installSize":27361280,"isEncrypted":false,"adultRating":false,"islocationbased":true,"lastModifiedTime":"2011-04-11T19:18:52.000+0000","mediaLink":null,"mediaIcon":null,"attributes":{"provides":{"noApp":false,"dockMode":false,"universalSearch":false,"connectors":[],"services":[],"optimizedUserExperience":false}},"price":0,"currency":"USD","isAdvertized":false,"filename":"com.igolf.mobile_2.5.0_all.ipk","free":false,"touchpad_exclusive":false,"images":{"1":{"thumbnail":"4603\/en\/images\/1\/S\/PalmPreScreenshots1.png","screenshot":"4603\/en\/images\/1\/L\/PalmPreScreenshots1.png","orientation":"P","device":"P"},"2":{"thumbnail":"4603\/en\/images\/2\/S\/fcbpalm.JPG","screenshot":"4603\/en\/images\/2\/L\/fcbpalm.JPG","orientation":"P","device":"P"},"3":{"thumbnail":"4603\/en\/images\/3\/S\/PalmPreScreenshots3.png","screenshot":"4603\/en\/images\/3\/L\/PalmPreScreenshots3.png","orientation":"P","device":"P"},"4":{"thumbnail":"4603\/en\/images\/4\/S\/PalmPreScreenshots4.png","screenshot":"4603\/en\/images\/4\/L\/PalmPreScreenshots4.png","orientation":"P","device":"P"},"5":{"thumbnail":"4603\/en\/images\/5\/S\/PalmPreScreenshots5.png","screenshot":"4603\/en\/images\/5\/L\/PalmPreScreenshots5.png","orientation":"P","device":"P"}}}