{"publicApplicationId":"com.dblpartners.mcdst","description":"Upward Mobility’s Microsoft Certified Desktop Support Technician (MCDST) 70-271 and 70-272 Exam Prep app for Palm webOS is the perfect tool written by certified experts to help you achieve this valuable certification. Each of the 128 simulated exam questions is paired with an explanatory answer and a Key Takeaway. The Key Takeaway is designed to ensure that the crucial learning point of the question is mastered. Not only that, Key Takeaways support the answer with important insights on how to practically apply the knowledge in a real world situation so you can be more successful in your career. *  This module covers both exams: 70-271: Supporting Users and Troubleshooting a Windows XP Operating System and 70-272: Supporting Users and Troubleshooting Desktop Applications on a Windows XP Operating System || What is the MCDST certification? A MCDST certificate holder is proven to hold the set of skills required to excel in roles such as help desk technician, customer support representative, computer support specialist, technical support representative, and technical support specialist. The MCDST certification is widely recognized by clients and employers. ||   Upward Mobility creates high quality management education and test preparation material that is witty, engaging, and adds value in the learning process.  We hire only expert writers who have strong knowledge in the subject matter and put all of our materials through a thorough review process.  *   We are a double bottom line company committed to education in the developing world. Some of the profits will be used to deploy education via mobile phone in emerging countries.","version":"1.0.3","homeURL":"http:\/\/upwardpro.com","supportURL":"http:\/\/upwardpro.com","custsupportemail":"","custsupportphonenum":"","copyright":"DBL Partners LLC","licenseURL":"http:\/\/upwardpro.com","locale":null,"appSize":"208808","installSize":"208808","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"4.99","currency":"USD","filename":"com.dblpartners.mcdst_1.0.3_all.ipk","free":false,"images":[{"thumbnail":"4636\/en\/images\/1\/L\/1.png","screenshot":"4636\/en\/images\/1\/L\/1.png","orientation":"P","device":"P"},{"thumbnail":"4636\/en\/images\/2\/L\/2.png","screenshot":"4636\/en\/images\/2\/L\/2.png","orientation":"P","device":"P"},{"thumbnail":"4636\/en\/images\/3\/L\/3.png","screenshot":"4636\/en\/images\/3\/L\/3.png","orientation":"P","device":"P"},{"thumbnail":"4636\/en\/images\/4\/L\/4.png","screenshot":"4636\/en\/images\/4\/L\/4.png","orientation":"P","device":"P"},{"thumbnail":"4636\/en\/images\/5\/L\/5.png","screenshot":"4636\/en\/images\/5\/L\/5.png","orientation":"P","device":"P"}]}