{"publicApplicationId":"com.dblpartners.humanresources","description":"The PHR Exam Prep is Upward Mobility’s focused exam preparation app for Palm webOS for HRCI’s Professional in Human Resources (PHR) Certification Exam. This module contains a targeted curriculum of 150 questions dealing with the successful knowledge required for early-career Human Resources Professionals.  || All of our app content is created exclusively for Upward Mobility by expert writers who have strong knowledge in the subject matter and all of our materials undergo a thorough review process.   || On a basic level, PHR Exam Prep identifies and assesses whether an early-career HR Professional has the necessary skills, knowledge, and know-how to implement Human Resources programs and to provide a supportive working environment for all professionals in their work organization. *   Additionally, the exam identifies a core knowledge of HR Management and Practice, including: Human Resource Development, Strategic Management, Total Rewards, Workforce Planning\/Employment, Risk Management, and Employee\/Labor Relations. *  By assessing learned workplace knowledge in practical real-life scenario questions, Upward Mobility’s PHR Exam Prep will help to bridge the gap between your experiences working in Human Resources and the knowledge base you need to move ahead in your career. The intuitive Study Mode interface allows you to track your progress through the application and return to difficult questions during your review. Test mode allows you to take the course as a sample PHR Exam and quickly review the questions and areas in which you may need extra help.  ||  Upward Mobility creates high quality management education and test preparation material that is witty, engaging, and adds value in the learning process.  *   We are a double bottom line company committed to education in the developing world. Some of the profits will be used to deploy education via mobile phone in emerging countries.","version":"1.0.3","versionNote":"","homeURL":"http:\/\/upwardpro.com","supportURL":"http:\/\/upwardpro.com","custsupportemail":"info@upwardpro.com","custsupportphonenum":"","copyright":"DBL Partners LLC","licenseURL":"","locale":"en_US","appSize":137928,"installSize":3009209,"isEncrypted":false,"adultRating":false,"islocationbased":false,"lastModifiedTime":"2012-06-01T05:58:27.000+0000","mediaLink":null,"mediaIcon":null,"attributes":{"provides":{"noApp":false,"dockMode":false,"universalSearch":false,"connectors":["null"],"services":[],"optimizedUserExperience":false}},"price":3.99,"currency":"USD","isAdvertized":false,"filename":"com.dblpartners.humanresources_1.0.3_all.ipk","free":false,"touchpad_exclusive":false,"images":{"1":{"screenshot":"4679\/1.0.3\/en\/images\/1\/L\/1.png","thumbnail":"4679\/1.0.3\/en\/images\/1\/L\/1.png","orientation":"P","device":"P"},"2":{"screenshot":"4679\/1.0.3\/en\/images\/2\/L\/2.png","thumbnail":"4679\/1.0.3\/en\/images\/2\/L\/2.png","orientation":"P","device":"P"},"3":{"screenshot":"4679\/1.0.3\/en\/images\/3\/L\/3.png","thumbnail":"4679\/1.0.3\/en\/images\/3\/L\/3.png","orientation":"P","device":"P"},"4":{"screenshot":"4679\/1.0.3\/en\/images\/4\/L\/4.png","thumbnail":"4679\/1.0.3\/en\/images\/4\/L\/4.png","orientation":"P","device":"P"},"5":{"screenshot":"4679\/1.0.3\/en\/images\/5\/L\/5.png","thumbnail":"4679\/1.0.3\/en\/images\/5\/L\/5.png","orientation":"P","device":"P"}}}