{"publicApplicationId":"com.todaypda.servermonitor","description":"Server Monitor allows you to monitor up to twenty servers. The server addresses you have added will be checked by our server, which means you don't need to keep the application running or keep your phone on. You can even set an email alert address so you will automatically receive an email if one of your given servers addresses is offline (set up to five email addresses). You can also keep the application running and set it to vibrate and \/ or pop-up when a server changes status. Currently we support the following protocols: http, https, ftp, gopher, telnet, dict, file, and ldap. Another option is the possibility to set a magic word. We will then download the content of the given server address and if we don't find the magic word, your server will be listed as offline. With the magic word you can monitor other services, for example MySQL. You can also set the timeout for the list with your servers to refresh and you can set the option whether the back-light of your Palm should stay on as long as the application is opened. The last option is the possibility to connect your server list with other Palm phones. Every new installation of Server Monitor will generate a User ID which you can change, for example to a User ID of someone else. If you change your User ID to the same one of someone else you will see the same list on both phones. And if one edits the servers, changes will automatically be visible on the other phone. You can connect as many phones you want!\n\nFeatures: \n- Up to twenty servers\n- Checking occurs on our servers\n- Set up to five alert email addresses\n- Vibrate or show a pop-up if the application is running and a server changes status\n- Connect your Server Monitor list with others\n- Use a magic word to check other services, like MySQL\n- Support the following protocols: http, https, ftp, gopher, telnet, dict, file, and ldap\n- View the statistic of every server, like: uptime, last check, number of checks, when it was offline, etc.","version":"1.0.0","versionNote":"","homeURL":"http:\/\/www.todaypda.com\/","supportURL":"http:\/\/www.todaypda.com\/","custsupportemail":"webos@todaypda.com","custsupportphonenum":"","copyright":"Copyright 2010 TodayPDA","licenseURL":"","locale":"en_US","appSize":180466,"installSize":2883584,"isEncrypted":false,"adultRating":false,"islocationbased":false,"lastModifiedTime":"2012-06-01T06:42:00.000+0000","mediaLink":"http:\/\/www.youtube.com\/watch?v=z7XQE7TtdNI","mediaIcon":"http:\/\/img.youtube.com\/vi\/z7XQE7TtdNI\/2.jpg","attributes":{"provides":{"noApp":false,"dockMode":false,"universalSearch":false,"connectors":["null"],"services":[],"optimizedUserExperience":false}},"price":1.99,"currency":"USD","isAdvertized":false,"filename":"com.todaypda.servermonitor_1.0.0_all.ipk","free":false,"touchpad_exclusive":false,"images":{"1":{"screenshot":"4726\/1.0.0\/en\/images\/1\/L\/servermonitor_1.png","thumbnail":"4726\/1.0.0\/en\/images\/1\/L\/servermonitor_1.png","orientation":"P","device":"P"},"2":{"screenshot":"4726\/1.0.0\/en\/images\/2\/L\/servermonitor_2.png","thumbnail":"4726\/1.0.0\/en\/images\/2\/L\/servermonitor_2.png","orientation":"P","device":"P"},"3":{"screenshot":"4726\/1.0.0\/en\/images\/3\/L\/servermonitor_3.png","thumbnail":"4726\/1.0.0\/en\/images\/3\/L\/servermonitor_3.png","orientation":"P","device":"P"},"4":{"screenshot":"4726\/1.0.0\/en\/images\/4\/L\/servermonitor_4.png","thumbnail":"4726\/1.0.0\/en\/images\/4\/L\/servermonitor_4.png","orientation":"P","device":"P"},"5":{"screenshot":"4726\/1.0.0\/en\/images\/5\/L\/servermonitor_5.png","thumbnail":"4726\/1.0.0\/en\/images\/5\/L\/servermonitor_5.png","orientation":"P","device":"P"}}}