{"publicApplicationId":"com.roalapps.drsteel","description":"Dr. Steel is a man of many talents with one simple goal. To make the world a better place. Through entertainment, vision and passion, Dr. Steel feeds the hungry masses who starve for happiness.\n\n\"It all comes down to having fun. We spend our lives trapped, when all we really want to do is play. So, let the people play! Let us build a Utopian Playland.\" ~Dr. Steel\n\nAnd to answer the question, \"Is this a cult?\"\n\nSkewed religious obsession, strange rituals and poison Kool-Aid. These are things generally associated with the stigma of the word “cult”.\n\nHowever vague the true definition of a cult might be, there is one singular element which rings true throughout all organizations considered to be cults; that is religion.\n\nThe Army of The Toy Soldiers accepts all of mankind (as well as various species of primates should the uniforms look funny on them) and holds no discrimination due to age, race or gender. Likewise, all forms of religious interests are welcomed to be held by members of The Toy Soldiers.\n\nThough Dr. Steel does not personally advocate any one specific brand of religion, his vision for locating one’s inner talents and unique vision could be interpreted as a spiritual journey. Dr. Steel’s aim is to encourage everyone to search out and utilize their unique, creative spark and to manifest great things in the world. Most importantly, his goal is to encourage the world to have a lot more fun.\n\nThe Army of The Toy Soldiers are those who share this vision, regardless of their religious orientation. To this, the Toy Soldiers are not a cult, but they are indeed an army in the sense of the word:\n\nArmy n. A large number of people united for a specific purpose.\n\nWe would only add “to have fun”.","version":"1.1.2","versionNote":"","homeURL":"http:\/\/www.repositoryofalunatic.com","supportURL":"http:\/\/www.repositoryofalunatic.com","custsupportemail":"support@repositoryofalunatic.com","custsupportphonenum":"","copyright":"Copyright 2010 RoaL Applications","licenseURL":"","locale":"en_US","appSize":768222,"installSize":5373952,"isEncrypted":false,"adultRating":false,"islocationbased":false,"lastModifiedTime":"2010-09-13T15:38:03.000+0000","mediaLink":null,"mediaIcon":null,"attributes":{"provides":{"noApp":false,"dockMode":false,"universalSearch":false,"connectors":[],"services":[],"optimizedUserExperience":false}},"price":0,"currency":"USD","isAdvertized":false,"filename":"com.roalapps.drsteel_1.1.2_all.ipk","free":false,"touchpad_exclusive":false,"images":{"1":{"thumbnail":"4950\/en\/images\/1\/S\/drsteel_2010-12-09_014804.png","screenshot":"4950\/en\/images\/1\/L\/drsteel_2010-12-09_014804.png","orientation":"P","device":"P"},"2":{"thumbnail":"4950\/en\/images\/2\/S\/drsteel_2010-12-09_014806.png","screenshot":"4950\/en\/images\/2\/L\/drsteel_2010-12-09_014806.png","orientation":"P","device":"P"},"3":{"thumbnail":"4950\/en\/images\/3\/S\/drsteel_2010-12-09_014809.png","screenshot":"4950\/en\/images\/3\/L\/drsteel_2010-12-09_014809.png","orientation":"P","device":"P"},"4":{"thumbnail":"4950\/en\/images\/4\/S\/drsteel_2010-12-09_014815.png","screenshot":"4950\/en\/images\/4\/L\/drsteel_2010-12-09_014815.png","orientation":"P","device":"P"}}}