{"publicApplicationId":"com.xybyresoft.memoryupgrade","description":"This is a memory upgrade for YOU. Your WebOS device has plenty of memory, so let your phone remember everything for you! Provide the details of what you want to remember (keywords, text, lists, images), and instantly recall them later. When you want to recall a memory, just start typing in the search field, and matching results will automatically appear as you type.\n\nYou can store individual pieces of information (e.g. what size are my air filters?), shopping lists, and even images. Want to make sure you don't forget where you parked? Take a picture! Assign it a keyword of \"park\", and you'll easily locate it later.\n\nMemoryUpgrade is fast! Your memories are stored in a database for fast performance and reliability. With MemoryUpgrade, you can have thousands of memories and recall any one of them in a split second!\n\nWhat if you want to use the same keywords for more than one thing? Not a problem! You can use the same keywords for as many memories as you like, and when you type in the keywords later, all of the matching memories will be displayed in a list. Just select the memory from the list to view\/edit it, or press the Copy icon to copy the data to the clipboard. \n\nWhat if you want to remember sensitive information, such as passwords? You can set the secret flag, which will mask the data in the results list with asterisks, yet you will still be able to copy the actual data to the clipboard by pressing the Copy icon. This allows you to use your sensitive data without worrying about that person looking over your shoulder.\n\nDo you already have some data in a text file or spreadsheet? Do you want to enter your data more quickly using your computer? MemoryUpgrade can import tab-delimited text files.\n\n* v1.2.3 added support for attaching existing files and images","version":"1.2.3","versionNote":"","homeURL":"http:\/\/xybyresoft.com","supportURL":"http:\/\/xybyresoft.com","custsupportemail":"support@xybyresoft.com","custsupportphonenum":"","copyright":"Copyright 2010 Xybyresoft","licenseURL":"","locale":"en_US","appSize":77248,"installSize":2260992,"isEncrypted":false,"adultRating":false,"islocationbased":false,"lastModifiedTime":"2012-06-01T12:08:29.000+0000","mediaLink":"http:\/\/www.youtube.com\/watch?v=qtPM0hziJ94","mediaIcon":"http:\/\/img.youtube.com\/vi\/qtPM0hziJ94\/2.jpg","attributes":{"provides":{"noApp":false,"dockMode":false,"universalSearch":false,"connectors":["null"],"services":[],"optimizedUserExperience":false}},"price":0.99,"currency":"USD","isAdvertized":false,"filename":"com.xybyresoft.memoryupgrade_1.2.3_all.ipk","free":false,"touchpad_exclusive":false,"images":{"1":{"screenshot":"497\/1.2.3\/en\/images\/1\/L\/mu_appstore1.png","thumbnail":"497\/1.2.3\/en\/images\/1\/L\/mu_appstore1.png","orientation":"P","device":"P"},"2":{"screenshot":"497\/1.2.3\/en\/images\/2\/L\/mu_appstore2.png","thumbnail":"497\/1.2.3\/en\/images\/2\/L\/mu_appstore2.png","orientation":"P","device":"P"},"3":{"screenshot":"497\/1.2.3\/en\/images\/3\/L\/mu_appstore3.png","thumbnail":"497\/1.2.3\/en\/images\/3\/L\/mu_appstore3.png","orientation":"P","device":"P"}}}