{"publicApplicationId":"com.galacticheadquarters.tapotrontrial","description":"Play guitar, synthesizer and drums in one app using an innovative touchboard. Tapotron(TM) is a new musical instrument designed for touch-sensitive smartphones. It is easy to play because the touchboard layout matches the natural positions of your fingertips on the phone. This unique layout allows for ten notes instead of an octave, letting you play melodies easier. When you need to move to a higher or lower range, there are several overlapping notes, meaning that you don't need to switch between ranges as often as you would with an octave keyboard.\n======\nNEW IN THIS VERSION: Added synthesizer lead sound. Presets now include synthesizer lead, synthesizer pads, drums (retro XR-909 sounds) and nylon string guitar. Use the back gesture to access the new sounds.\n======\nWatch the video to learn to play. The white circles are like the white keys on a piano. The smaller black circles are like the black keys. The E in the lower right is the lowest note, and is equivalent to the low E on a guitar.\n======\nTo switch ranges, use the + and - keys.  There are three ranges. The D and A circles have dots to indicate that they are \"pivot\" notes when switching ranges.  For example, if you are playing an ascending scale and reach the top G (upper left), tap the +, and continue the scale upward with the A marked with a dot. The notes below the A overlap the lower range. Similarly, on a descending scale, when you play low E (lower right), tap the - button and continue your scale downward with the marked D.  The notes above the marked D overlap the higher range you just left. (Tip: the thumb can be a good choice for the - button.) Apologies to left-handed people for this right-handed layout. We're planning a left-handed version.\n======\nConnect external speakers for highest quality sound.\n======\nTapotron is a trademark of Galactic Headquarters and is currently available exclusively for webOS Palm Pre.","version":"1.0.3","versionNote":"","homeURL":"http:\/\/galacticheadquarters.com","supportURL":"http:\/\/galacticheadquarters.com\/tapotron","custsupportemail":"appsupport@galacticheadquarters.com","custsupportphonenum":"","copyright":"Copyright 2010 Galactic Headquarters, LLC.","licenseURL":"","locale":"en_US","appSize":58324212,"installSize":72482816,"isEncrypted":false,"adultRating":false,"islocationbased":false,"lastModifiedTime":"2010-09-13T16:03:37.000+0000","mediaLink":"http:\/\/www.youtube.com\/watch?v=wsvtxRT3_a8","mediaIcon":"http:\/\/img.youtube.com\/vi\/wsvtxRT3_a8\/2.jpg","attributes":{"provides":{"noApp":false,"dockMode":false,"universalSearch":false,"connectors":[],"services":[],"optimizedUserExperience":false}},"price":0,"currency":"USD","isAdvertized":false,"filename":"com.galacticheadquarters.tapotrontrial_1.0.3_all.ipk","free":false,"touchpad_exclusive":false,"images":{"1":{"thumbnail":"4991\/en\/images\/1\/S\/fingerboard-screenshot.png","screenshot":"4991\/en\/images\/1\/L\/fingerboard-screenshot.png","orientation":"P","device":"P"},"2":{"thumbnail":"4991\/en\/images\/2\/S\/mainmenu.png","screenshot":"4991\/en\/images\/2\/L\/mainmenu.png","orientation":"P","device":"P"},"3":{"thumbnail":"4991\/en\/images\/3\/S\/drumfingerboard.png","screenshot":"4991\/en\/images\/3\/L\/drumfingerboard.png","orientation":"P","device":"P"}}}