{"publicApplicationId":"com.mobifusion.mobirdr.gita","description":"\"Not just a literal translation, but the most authentic transcreation of the Bhagavad Gita \nRead the original Sanskrit Slokas, alongside its English transcreation \nDiscover the purpose and goal of human existence \nRealize God within you. \nBecome an effective leader by understanding the spiritual crux of vital management concepts like motivation, excellence in work, attitude towards work, decision making,achieving one’s goals \nDiscover a step-by-step process towards self-realization \nOf all the English rendering of the Bhagavad Gita, Prof P Lal’s version preserves the dignity and grace of the original epic poem. The Bhagavad Gita, Hinduism’s core sacred text, is in fact an excerpt from the great Indian epic, the Mahabharata. P Lal’s rendition of Hinduism’s core sacred text is both poetic and swift to read, remaining consistently faithful to the oral and musical tradition of Vyasa. \n\nThe Bhagavad Gita is a dialogue on and of Dharma. It enshrines the essential values of the Vedic, Upanishadic and epic traditions -- shruti (the revealed) and smriti (the remembered). Its structure is informal question and answer; its mode is enquiry and search; its goal is self-discovery and spiritual illumination.\n\nMany great thinkers from our time, such as Albert Einstein, Mahatma Gandhi and Albert Schweizer as well as Madhvacarya, Sankara and Ramanuja from bygone ages have all contemplated and deliberated upon its timeless message. The primary purpose of the Bhagavad- Gita is to illuminate for all of humanity the realization of the true nature of divinity; it is the only scripture in the world to claim that God resides in each one of us and is present in all living beings.\n\nThe author has been a delegate to the P.E.N International Writer’s Conference and a Visiting Professor at the Universities of Hofstra, Illinois, Ohio. He is the recipient of the prestigious Pamda Shree award and is currently completing a sloka-by-sloka transcreation of the Mahabharata.\n\"","version":"1.0.0","versionNote":"","homeURL":"http:\/\/mobifusion.com","supportURL":"http:\/\/mobifusion.com","custsupportemail":"support@mobifusion.com","custsupportphonenum":"01244213081","copyright":"copyright","licenseURL":"","locale":"en_US","appSize":2067854,"installSize":26869760,"isEncrypted":false,"adultRating":false,"islocationbased":false,"lastModifiedTime":"2012-06-01T07:22:18.000+0000","mediaLink":null,"mediaIcon":null,"attributes":{"provides":{"noApp":false,"dockMode":false,"universalSearch":false,"connectors":["null"],"services":[],"optimizedUserExperience":false}},"price":3.99,"currency":"USD","isAdvertized":false,"filename":"com.mobifusion.mobirdr.gita_1.0.0_all.ipk","free":false,"touchpad_exclusive":false,"images":{"1":{"screenshot":"5092\/1.0.0\/en\/images\/1\/L\/screen2.jpg","thumbnail":"5092\/1.0.0\/en\/images\/1\/L\/screen2.jpg","orientation":"P","device":"P"},"2":{"screenshot":"5092\/1.0.0\/en\/images\/2\/L\/screen3.jpg","thumbnail":"5092\/1.0.0\/en\/images\/2\/L\/screen3.jpg","orientation":"P","device":"P"},"3":{"screenshot":"5092\/1.0.0\/en\/images\/3\/L\/screen4.jpg","thumbnail":"5092\/1.0.0\/en\/images\/3\/L\/screen4.jpg","orientation":"P","device":"P"},"4":{"screenshot":"5092\/1.0.0\/en\/images\/4\/L\/screen5.jpg","thumbnail":"5092\/1.0.0\/en\/images\/4\/L\/screen5.jpg","orientation":"P","device":"P"},"5":{"screenshot":"5092\/1.0.0\/en\/images\/5\/L\/screen5.jpg","thumbnail":"5092\/1.0.0\/en\/images\/5\/L\/screen5.jpg","orientation":"P","device":"P"}}}