{"publicApplicationId":"com.smarteragent.realestate.phila","description":"Find a townhome in Old City, see all homes for sale on the Main Line, check out how much condos are selling for in Center City or gaze at pictures of your dream house at the shore – all from your phone! Whether you’re buying, selling or just interested in the market, Philadelphia Real Estate by Smarter Agent brings the most comprehensive real estate data to your phone. Philadelphia Real Estate includes three property search options in one powerful app: \n\n1. Homes for Sale: View ALL homes for sale in Philadelphia and the surrounding PA, NJ and DE counties. You now have access to the same data as a real estate agent but from the convenience of your phone! This access is provided by local REALTORS® who offer mobile search through the Smarter Agent mobile platform.   \n\n2. Recently Sold: See prices of homes sold within the last three years.\n\n3. Rental search: Not ready to buy? Search local apartments and home rentals.\n\nThe GPS search, where available, pinpoints your location and pulls up all homes for sale around you. You can also search for homes by address, city or zip code. With the touch of a button, you can see the price, square footage, estimated mortgage, taxes, features, descriptions, pictures and more! You can also refine your search based on property type, price range and the number of beds and baths to find just what you’re looking for. \n\nSave your favorite homes so you can quickly access them later or text property info to a friend. Use the “Send to a Friend” feature to share the app with any cell phone user!\n\nIf you have questions about a property or want a tour, the “Call” feature will connect you to a local agent who provides mobile access to properties within the Philadelphia Real Estate app. An agent can also provide you with their own personalized mobile app to search. \n\nYou will not receive any calls from a REALTOR® unless you press “Call” to ask for help.","version":"1.2.8","versionNote":"","homeURL":"http:\/\/www.smarteragent.com","supportURL":"http:\/\/www.smarteragent.com","custsupportemail":"palm@smarteragent.com","custsupportphonenum":"8007271787","copyright":"copyright","licenseURL":"","locale":"en_US","appSize":209490,"installSize":5210112,"isEncrypted":false,"adultRating":false,"islocationbased":true,"lastModifiedTime":"2010-09-23T16:11:08.000+0000","mediaLink":null,"mediaIcon":null,"attributes":{"provides":{"noApp":false,"dockMode":false,"universalSearch":false,"connectors":[],"services":[],"optimizedUserExperience":false}},"price":0,"currency":"USD","isAdvertized":false,"filename":"com.smarteragent.realestate.phila_1.2.8_all.ipk","free":false,"touchpad_exclusive":false,"images":{"1":{"thumbnail":"5130\/en\/images\/1\/S\/PalmOS_Smarter_Agent_Philadephia_App_Search_Details.png","screenshot":"5130\/en\/images\/1\/L\/PalmOS_Smarter_Agent_Philadephia_App_Search_Details.png","orientation":"P","device":"P"},"2":{"thumbnail":"5130\/en\/images\/2\/S\/PalmOS_Smarter_Agent_Philadephia_App_Search_Map.png","screenshot":"5130\/en\/images\/2\/L\/PalmOS_Smarter_Agent_Philadephia_App_Search_Map.png","orientation":"P","device":"P"},"3":{"thumbnail":"5130\/en\/images\/3\/S\/PalmOS_Smarter_Agent_Philadephia_App.png","screenshot":"5130\/en\/images\/3\/L\/PalmOS_Smarter_Agent_Philadephia_App.png","orientation":"P","device":"P"}}}