{"publicApplicationId":"com.dblpartners.arthistory","description":"Aiming for a high score on your AP Art History exam? Look no further! Upward Mobility's AP Art History Exam Prep software for Palm webOS is the perfect tool to help students to ace this competitive test. The module presents original 130 realistic questions, covering: architecture, printing and drawing, sculpture, and other forms of media from ancient through medieval, through the Renaissance and into the present. The module also effectively covers art pieces and movements from a wide variety of cultures, highlighting traditions in Africa, Asia, the Near East, Oceania, and more. *  Each multiple-choice question is paired with a clear and thoughtful explanation and a highly-detailed Key Takeaway that summarizes the main learning point of the art piece, concept, or theory being discussed, ensuring a comprehensive understanding of the material. Addressing nearly all of the topics covered on the exam, this AP Art History Exam Prep app is ideal to test key definitions, pieces, movements, artists, concepts, and theories. Whether you are taking the test for the first time or striving to improve your score, this app will be a highly useful addition to your exam preparation!  ||  Upward Mobility creates high quality management education and test preparation material that is witty, engaging, and adds value in the learning process.  *   We are a double bottom line company committed to education in the developing world. Some of the profits will be used to deploy education via mobile phone in emerging countries.  ||  Upward Mobility is not affiliated with and this app is not endorsed by the College Board.","version":"1.0.4","versionNote":"Minor content fixes.","homeURL":"http:\/\/upwardpro.com","supportURL":"http:\/\/upwardpro.com","custsupportemail":"info@upwardpro.com","custsupportphonenum":"","copyright":"DBL Partners LLC","licenseURL":"","locale":"en_US","appSize":470082,"installSize":2490368,"isEncrypted":false,"adultRating":false,"islocationbased":false,"lastModifiedTime":"2012-06-01T09:58:02.000+0000","mediaLink":null,"mediaIcon":null,"attributes":{"provides":{"noApp":false,"dockMode":false,"universalSearch":false,"connectors":["null"],"services":[],"optimizedUserExperience":false}},"price":3.99,"currency":"USD","isAdvertized":false,"filename":"com.dblpartners.arthistory_1.0.4_all.ipk","free":false,"touchpad_exclusive":false,"images":{"1":{"screenshot":"5165\/1.0.4\/en\/images\/1\/L\/1.png","thumbnail":"5165\/1.0.4\/en\/images\/1\/L\/1.png","orientation":"P","device":"P"},"2":{"screenshot":"5165\/1.0.4\/en\/images\/2\/L\/2.png","thumbnail":"5165\/1.0.4\/en\/images\/2\/L\/2.png","orientation":"P","device":"P"},"3":{"screenshot":"5165\/1.0.4\/en\/images\/3\/L\/3.png","thumbnail":"5165\/1.0.4\/en\/images\/3\/L\/3.png","orientation":"P","device":"P"},"4":{"screenshot":"5165\/1.0.4\/en\/images\/4\/L\/4.png","thumbnail":"5165\/1.0.4\/en\/images\/4\/L\/4.png","orientation":"P","device":"P"},"5":{"screenshot":"5165\/1.0.4\/en\/images\/5\/L\/5.png","thumbnail":"5165\/1.0.4\/en\/images\/5\/L\/5.png","orientation":"P","device":"P"}}}