{"publicApplicationId":"com.tearn.kffree","description":"This app provides the movers of Fashion with 400 animated flash cards that show the works of the top designers, brands, fashion shows, photographers, and media over the past decade - a must have for those actively engaged with the world of fashion. Organized into six chapters by Diana Chang; and part of the arts series of mobile books by Keys.\n\n\nKeys is an advanced, unique learning platform that simplifies complex subjects, aids memorization, and improves your scores on public exams.\n\nUnlike trivial, boring glossary lists, Keys centralizes and livens the wealth of information on the web directly onto your touch device with a tap.\n\n- Our thoughtful concept maps organize hundreds of terms into chapters and units - telling stories that simplify learning via subject context\n- Unique flow selectors ease access to terms and chapters\n- Each term has a subject specific definition with live links to relevant web pages\n- Terms use age appropriate words for kids, teens, and adults - depending on the specific app\n- Supporting images from search embed with no typing required - to associate terms with thousands of rich, graphical representations on the web, thus promoting unconscious competence (ie painless learning)\n- Classic flash card, match, and slots activities maintain interest during repetitive exposure - while stimulating kinesthetic neural bonds in your memory cortex\n- Innovative Pictionary with a search-bot game for testing comprehension\n- Unique, responsive animations for the best user experience on touch devices\n\nKeys makes learning fun for all ages. Join the 200,000 plus who have downloaded Keys apps.","version":"4.8.2","versionNote":"","homeURL":"http:\/\/blog.tearn.com","supportURL":"http:\/\/keys.tearn.com","custsupportemail":"djc8080@gmail.com","custsupportphonenum":"14086684412","copyright":"copyright 2010 TEARN Media","licenseURL":"","locale":"en_US","appSize":124066,"installSize":1114112,"isEncrypted":false,"adultRating":false,"islocationbased":false,"lastModifiedTime":"2010-09-21T02:36:07.000+0000","mediaLink":null,"mediaIcon":null,"attributes":{"provides":{"noApp":false,"dockMode":false,"universalSearch":false,"connectors":[],"services":[],"optimizedUserExperience":false}},"price":0,"currency":"USD","isAdvertized":false,"filename":"com.tearn.kffree_4.8.2_all.ipk","free":false,"touchpad_exclusive":false,"images":{"1":{"thumbnail":"5338\/en\/images\/1\/S\/f0.jpg","screenshot":"5338\/en\/images\/1\/L\/f0.jpg","orientation":"P","device":"P"},"2":{"thumbnail":"5338\/en\/images\/2\/S\/f1.jpg","screenshot":"5338\/en\/images\/2\/L\/f1.jpg","orientation":"P","device":"P"},"3":{"thumbnail":"5338\/en\/images\/3\/S\/f2.jpg","screenshot":"5338\/en\/images\/3\/L\/f2.jpg","orientation":"P","device":"P"},"4":{"thumbnail":"5338\/en\/images\/4\/S\/f3.jpg","screenshot":"5338\/en\/images\/4\/L\/f3.jpg","orientation":"P","device":"P"},"5":{"thumbnail":"5338\/en\/images\/5\/S\/f4.jpg","screenshot":"5338\/en\/images\/5\/L\/f4.jpg","orientation":"P","device":"P"}}}