{"publicApplicationId":"org.webosinternals.pressizola-free","description":"This is the exact same game that is available in a paid version.  The proceeds from the paid version help WebOS Internals, if you would like a nice easy way to donate consider purchasing the paid version of Pressi Zola or VisualBoyAdvance! **UPDATED** Game should load faster and added a penguin to the main menu (tap it, I dare ya) **\n\nPressi Zola is a board game that can be played with two players or you can play on your own against the computer. The goal of the game is quite simple: block your opponent by destroying the fields which surround him without being blocked yourself. Every turn of play, each player must first move to some adjacent field and then destroy a field of his choice. The first player who cannot move anymore loses the game.\n\nPressi Zola is a port of the game Do'SSi Zo'la by the fine people at http:\/\/dossizola.sourceforge.net\/.  I have done a few bugixes and feature additions (namely sound).  The game uses mp3's from your usb partition as the background music and music volume can be changed by tapping the music text while playing  There are many more features planned for this game and I am always willing to accept recommendations from anyone who uses it.  Please note that a portion of the proceeds will go to WebOS Internals.\n\nPLANNED UPDATES: \n\n-A few more backgrounds\/tile images, Pixi support, Fulfilling user requests.\n\nPlease contact me if you have any issues with this game as I cannot respond to Reviews.  I promise all problems will be handled as fast as I can.","version":"1.6.4","versionNote":"","homeURL":"http:\/\/www.webos-internals.org","supportURL":"http:\/\/www.webos-internals.org","custsupportemail":"cryptk@gmail.com","custsupportphonenum":"","copyright":"copyright 2010 Cryptk Coding","licenseURL":"","locale":"en_US","appSize":9071350,"installSize":10387456,"isEncrypted":false,"adultRating":false,"islocationbased":false,"lastModifiedTime":"2010-09-27T16:58:04.000+0000","mediaLink":null,"mediaIcon":null,"attributes":{"provides":{"noApp":false,"dockMode":false,"universalSearch":false,"connectors":[],"services":[],"optimizedUserExperience":false}},"price":0,"currency":"USD","isAdvertized":false,"filename":"org.webosinternals.pressizola-free_1.6.4_all.ipk","free":false,"touchpad_exclusive":false,"images":{"1":{"thumbnail":"5357\/en\/images\/1\/S\/Screenshot1.png","screenshot":"5357\/en\/images\/1\/L\/Screenshot1.png","orientation":"P","device":"P"},"2":{"thumbnail":"5357\/en\/images\/2\/S\/Screenshot2.png","screenshot":"5357\/en\/images\/2\/L\/Screenshot2.png","orientation":"P","device":"P"},"3":{"thumbnail":"5357\/en\/images\/3\/S\/Screenshot3.png","screenshot":"5357\/en\/images\/3\/L\/Screenshot3.png","orientation":"P","device":"P"}}}