{"publicApplicationId":"com.alderangaming.wizards2","description":"An evil has overthrown this land.  The king hasn’t been quite himself since the attack on the kingdom of Elvenwood 77 years ago.  The sea captain’s treasure has gone missing, and the Wizard’s Council has lost the scent of the evil source.  With the world in turmoil, a hero rises from the unlikeliest of places to protect and save the land.\n\n*  Play as a Brawler, Marksman, or the devastating Spellczar!  All three play differently!\n\n*  Live an epic tale, venturing to all corners of the world, with 180+ quests to experience!\n\n* Now as you level you’re able to create your character in the way you want to play.  Pick which statistics and abilities your character will specialize in!\n\n*  Using the new Quick Time Event system, now you can Dodge, Avoid Traps, and Find Artifacts using your speed and reflexes!\n\n*  Experience the new Effect System as action gets even more real!\n\n*  Over 36 abilities, 36 weapons, armor and items and 40+ monsters and bosses! \n\n*  Best your friends using the Wizard’s Leaderboard and Achievements!  See your gameplay statistics and Global Stats, which includes all of your rankings and abilities used for up to 10 of your characters!\n\n*  Witness your enemies employing amazing combos, and unleash your combos onto them!\n\n*  After clearing the game you unlock a Boss Rush mode, allowing you to relive the end game, as it increases in difficulty!\n\n--Please DO NOT leave bad reviews for technical issues! Email us if you run into problems playing the game. A Revew is NOT an appropriate place to post technical support issues. --","version":"1.0.9","versionNote":"","homeURL":"http:\/\/www.alderangaming.com","supportURL":"http:\/\/www.alderangaming.com","custsupportemail":"alderangaming@gmail.com","custsupportphonenum":"","copyright":"Copyright 2011 Alderan Gaming, LLC","licenseURL":"","locale":"en_US","appSize":5434514,"installSize":18317312,"isEncrypted":false,"adultRating":false,"islocationbased":false,"lastModifiedTime":"2012-06-01T09:04:27.000+0000","mediaLink":"http:\/\/www.youtube.com\/watch?v=dak2cLvGEAE","mediaIcon":"http:\/\/img.youtube.com\/vi\/dak2cLvGEAE\/2.jpg","attributes":{"provides":{"noApp":false,"dockMode":false,"universalSearch":false,"connectors":["null"],"services":[],"optimizedUserExperience":false}},"price":1.99,"currency":"USD","isAdvertized":false,"filename":"com.alderangaming.wizards2_1.0.9_all.ipk","free":false,"touchpad_exclusive":false,"images":[]}