{"publicApplicationId":"de.draegerit.app.saberultimatepixi","description":"** New in 1.8.6: fixed some severe transparency issues ** \n\nFinally, here it is: a beautifully designed, quality lightsaber for WebOS... the best out there! Saber Ultimate was developed from the ground up using the PDK for native code and offers the responsiveness we have all been waiting for. It just works! \n\nTap the hilt to turn it on or off. Hold your phone like you would actually hold the hilt of a saber. Swing slowly from left to right and vice versa for a swing-sound. Make sure to make left-right-left movements with your hand for the swinging, don't roll\/rotate the device itself too much. Move the phone rapidly like you would hit someone to hear the clashing sound. \n\nIf you tap the screen while the saber is active you will have a fullscreen close-up. If you are in fullscreen-mode, tap again or do the back-gesture to get back. By tapping on the glowing buttons you can intuitively pick the hilt & the color of your preference, turn the music on or off, and activate the incredible Vader breath. If you do the forward-gesture while the saber is on, you can switch between the colors... even in fullscreen-mode! \n\nIf you tap on the icon in the upper right corner you will see the settings. Navigate to the different pages with back-\/forward-gestures, or just tap on the settings-header. In the settings, you can customize your lightsaber even further: turn off the confirming beeps, change the sensitivity, turn off the animation of the saber, hide the music-volume slider, and much more! All settings, including the music-volume, will be saved when you exit the app. \n\nFight your friends with your Pixi or Veer and have fun, for FREE! I hope you like it :)","version":"1.8.6","versionNote":"fixed some severe transparency issues","homeURL":"http:\/\/www.draegerit.de","supportURL":"http:\/\/www.draegerit.de","custsupportemail":"blacklight@draegerit.de","custsupportphonenum":"","copyright":"Copyright 2011 Draeger IT","licenseURL":"","locale":"en_US","appSize":2528962,"installSize":4358144,"isEncrypted":false,"adultRating":false,"islocationbased":false,"lastModifiedTime":"2011-07-22T08:27:19.000+0000","mediaLink":null,"mediaIcon":null,"attributes":{"provides":{"noApp":false,"dockMode":false,"universalSearch":false,"connectors":[],"services":[],"optimizedUserExperience":false}},"price":0,"currency":"USD","isAdvertized":false,"filename":"de.draegerit.app.saberultimatepixi_1.8.6_all.ipk","free":false,"touchpad_exclusive":false,"images":{"1":{"thumbnail":"5390\/en\/images\/1\/S\/ph_screen1_v18.png","screenshot":"5390\/en\/images\/1\/L\/ph_screen1_v18.png","orientation":"P","device":"P"},"2":{"thumbnail":"5390\/en\/images\/2\/S\/ph_screen3_v18.png","screenshot":"5390\/en\/images\/2\/L\/ph_screen3_v18.png","orientation":"P","device":"P"},"3":{"thumbnail":"5390\/en\/images\/3\/S\/ph_screen4_v18.png","screenshot":"5390\/en\/images\/3\/L\/ph_screen4_v18.png","orientation":"P","device":"P"}}}