{"publicApplicationId":"org.preware.docs","description":"The official source for information about Preware, WebOS Internals, and Homebrew Applications, Patches and Overclocking Kernels.\n\nRod Whitby (the founder\/lead of WebOS Internals, and architect of the Preware webOS homebrew ecosystem) has gathered together an extensive collection of official documentation about the Preware Homebrew Installer and other Homebrew Applications, Patches and Overclocking Kernels.\n\nProceeds from the sale of this application go directly to supporting the development of Preware and other free homebrew applications.\n\nPreware Homebrew Documentation includes step-by-step guides with many helpful screenshots for installing Preware, and other Hombrew Applications, Patches and Overclocking Kernels.  Don't settle for second-hand information - get your homebrew information directly from the developers who wrote the Preware application & created the homebrew standards and ecosystem.\n\nPlease tell your friends about this application to help spread awareness of the thousands of safe, high quality, free homebrew applications, patches and kernels that are available in Preware for your webOS device.\n\nYou can expect regular updates of this application containing the latest homebrew information from WebOS Internals, and please follow @webosinternals on Twitter for up-to-the-minute homebrew news.\n\nIf you have any problems when installing Preware or any of the other items in this application, just use the official reference documentation and PreCentral.net forum links throughout the application and on the Help page to get direct access to a large community of users and developers who will be happy to help you get the most out of your homebrew journey.","version":"3.0.0","versionNote":"","homeURL":"http:\/\/www.webos-internals.org\/","supportURL":"http:\/\/bit.ly\/webos-phd","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010-2011 Rod Whitby, WebOS Internals","licenseURL":"","locale":"en_US","appSize":2642112,"installSize":6881280,"isEncrypted":false,"adultRating":false,"islocationbased":false,"lastModifiedTime":"2012-06-02T02:48:21.000+0000","mediaLink":"http:\/\/www.youtube.com\/watch?v=FdBXpZBMQmw#t=1982s","mediaIcon":"http:\/\/img.youtube.com\/vi\/FdBXpZBMQmw\/2.jpg","attributes":{"provides":{"noApp":false,"dockMode":false,"universalSearch":false,"connectors":["null"],"services":[],"optimizedUserExperience":true}},"price":0.99,"currency":"USD","isAdvertized":false,"filename":"org.preware.docs_3.0.0_all.ipk","free":false,"touchpad_exclusive":true,"images":{"1":{"screenshot":"5582\/3.0.0\/en\/images\/1\/L\/tb_docs_2011-30-08_162153.png","thumbnail":"5582\/3.0.0\/en\/images\/1\/S\/tb_docs_2011-30-08_162153.png","orientation":"L","device":"T"},"2":{"screenshot":"5582\/3.0.0\/en\/images\/2\/L\/tb_docs_2011-30-08_162241.png","thumbnail":"5582\/3.0.0\/en\/images\/2\/S\/tb_docs_2011-30-08_162241.png","orientation":"L","device":"T"},"3":{"screenshot":"5582\/3.0.0\/en\/images\/3\/L\/tb_docs_2011-30-08_163334.png","thumbnail":"5582\/3.0.0\/en\/images\/3\/S\/tb_docs_2011-30-08_163334.png","orientation":"L","device":"T"}}}