{"publicApplicationId":"com.scriptmatic.palm.hypnosis.learnalanguage","description":"Are you trying to learn spanish? French? German? Italian? Portugese? Latin? Japanese? Chinese? Or any other foreign language? \n\nSometimes we can have a strong desire to learn a language but we have subconscious blocks that are holding us back from really learning it as good as we can. It is a fact that children learn languages much faster than adults. This is because as children our subconscious minds are more dominant over our conscious minds. This program helps you to mold your subconscious mind to absorb the language you are trying to learn. It literally helps you to have the same kind of receptivity as a child does. Don't worry, you won't start being childish! \n\nThe session helps you to do the following: Feel comfortable speaking this language. No longer fear speaking to native speakers. Helps you retain, remember, and focus on this language. Helps you to think effectively IN this language. Helps you to remove any subconscious negativity such \"you can't learn this language\" that you may have picked up through the years. Helps your mind \"shift\" back and forth between languages as needed. Speak this language with joy and confidence! Instead of fear and worry about you making mistakes. Helps the language quickly and easily \"flow\" into your mind when speaking it. Helps you feel more comfortable making mistakes, in order to help you accelerate your learning of the language.\n\nIf you are currently trying to learn a language, or are even just simply taking a class on the subject, this program will give you enormous benefits you will probably never even realize! Have fun ENJOYING learning this new language. This program supports all language learning. Even English! As long as you can understand what is being said.","version":"1.0.0","versionNote":"","homeURL":"http:\/\/www.hypnosisinmurfreesboro.com","supportURL":"http:\/\/www.hypnosisinmurfreesboro.com","custsupportemail":"benjamindefoor@gmail.com","custsupportphonenum":"","copyright":"Copyright 2010 EHYP Productions.","licenseURL":"","locale":"en_US","appSize":19015278,"installSize":20152320,"isEncrypted":false,"adultRating":false,"islocationbased":false,"lastModifiedTime":"2012-06-01T09:25:23.000+0000","mediaLink":null,"mediaIcon":null,"attributes":{"provides":{"noApp":false,"dockMode":false,"universalSearch":false,"connectors":["null"],"services":[],"optimizedUserExperience":false}},"price":2.99,"currency":"USD","isAdvertized":false,"filename":"com.scriptmatic.palm.hypnosis.learnalanguage_1.0.0_all.ipk","free":false,"touchpad_exclusive":false,"images":{"1":{"screenshot":"5703\/1.0.0\/en\/images\/1\/L\/screen_shot_main.png","thumbnail":"5703\/1.0.0\/en\/images\/1\/L\/screen_shot_main.png","orientation":"P","device":"P"},"2":{"screenshot":"5703\/1.0.0\/en\/images\/2\/L\/screen_shot_audio.png","thumbnail":"5703\/1.0.0\/en\/images\/2\/L\/screen_shot_audio.png","orientation":"P","device":"P"}}}