{"publicApplicationId":"com.imperialpenguin.dragtreepalm","description":"There are other practice trees out there, but you aren't some armchair drag racer, you are a Saturday night warrior, seasoned by the smell of high octane and the feel of your car powering down the track. You need a practice tree app that boasts the features of dedicated hardware trees costing up to a hundred times more. Finally, there's an app for you. \n\nDrag Tree includes many advanced features to actually improve your times, not just amuse you between commercials while you watch other people living YOUR dream.\n\nNOTE: On some devices, the touchscreen isn't quite sensitive enough to give accurate results. If you feel your device is giving bad results, you can open the keyboard and use any button in place of touching the \"GO\" button.\n\n- Four tree types including Full 0.500, Pro 0.400, Full 0.400, & Pro .500.\n\n- Fully adjustable delay box featuring adjustable bump down and bump up controls for post release fine tuning.\n\n- The delay box features both cross over launching and cross talk style trees.\n\n- Perfect RT is adjustable from .400\/.500 or .000.\n\n- Controls are adjustable to launch on release of the button or the press of the button.\n\n\nStatistics are automatically saved after each run to allow you to keep better track of your performance. A total of six statistics are tracked. These include:\n\nNumber of Runs\nAverage RT\nQuickest RT\nBest RT\nWorse RT\nRedlight %","version":"1.0.1","homeURL":"http:\/\/www.imperialpenguin.com","supportURL":"http:\/\/www.imperialpenguin.com","custsupportemail":"","custsupportphonenum":"","copyright":"copyright 2010 Imperial Penguin","licenseURL":"http:\/\/www.imperialpenguin.com","locale":null,"appSize":"377054","installSize":"377054","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"2.99","currency":"USD","filename":"com.imperialpenguin.dragtreepalm_1.0.1_all.ipk","free":false,"images":[{"thumbnail":"5748\/images\/1\/L\/ss1.png","screenshot":"5748\/images\/1\/L\/ss1.png","orientation":"P","device":"P"},{"thumbnail":"5748\/images\/2\/L\/ss3.png","screenshot":"5748\/images\/2\/L\/ss3.png","orientation":"P","device":"P"},{"thumbnail":"5748\/images\/3\/L\/ss2.png","screenshot":"5748\/images\/3\/L\/ss2.png","orientation":"P","device":"P"}]}