{"publicApplicationId":"org.munson.pwdhash","description":"Do you use the same usernames & passwords at many different web sites? Did you realize that by doing so an attacker could break into one site and gain access to many more using your credentials?\n\nThe good folks at the Stanford Security Laboratory have proposed a solution called PwdHash. It hashes your password with the site’s domain name to generate a unique, theft-resistant password for each site you log in to. JavaScript computes the password hash on your machine so your password is never communicated over the Internet. The resulting hashed password can then be pasted into a web login form. Stanford provides PwdHash as a web site and as a Firefox add-on. Learn more at https:\/\/www.pwdhash.com.\n\nThis app brings PwdHash functionality to the webOS platform. It uses the same algorithms, without any modifications, as the Stanford PwdHash web site. Thus, you can use this app to generate the same passwords on your webOS device as you do on the PwdHash web site. To use it, simply copy the URL of the site you’re logging in to, paste it into PwdHash, enter your password, tap the button to generate a hashed password, and copy and paste it back into your web login form. (And thank Palm for a multitasking device!)\n\nThis app is open source for your peace of mind. There’s a link in the app where you can view the code online.\n\nThis app is provided \"as is\" with no warranties expressed or implied. Use at your own risk.","version":"0.8.1","versionNote":"","homeURL":"http:\/\/www.munson.org","supportURL":"http:\/\/www.munson.org\/apps\/pwdhash\/","custsupportemail":"support@munson.org","custsupportphonenum":"","copyright":"Copyright 2010. Tom Munson. All Rights Reserved.","licenseURL":"","locale":"en_US","appSize":244638,"installSize":1572864,"isEncrypted":false,"adultRating":false,"islocationbased":false,"lastModifiedTime":"2010-12-16T04:46:37.000+0000","mediaLink":null,"mediaIcon":null,"attributes":{"provides":{"noApp":false,"dockMode":false,"universalSearch":false,"connectors":[],"services":[],"optimizedUserExperience":false}},"price":0,"currency":"USD","isAdvertized":false,"filename":"org.munson.pwdhash_0.8.1_all.ipk","free":false,"touchpad_exclusive":false,"images":{"1":{"thumbnail":"5787\/en\/images\/1\/S\/shot1.png","screenshot":"5787\/en\/images\/1\/L\/shot1.png","orientation":"P","device":"P"},"2":{"thumbnail":"5787\/en\/images\/2\/S\/shot2.png","screenshot":"5787\/en\/images\/2\/L\/shot2.png","orientation":"P","device":"P"}}}