{"publicApplicationId":"com.caldantechpub.scatter","description":"Scatter is a simple game. Just tap the screen with your finger. That is the easy part. It is much harder to get the timing and placement of that tap to create a chain reaction which captures all the scattered balls. Each ball as a fixed amount of time it will remain on the screen after it has been hit. Then it will shrink away never to be seen again. To win, you have to complete all of the levels. There are two ways to play: Chaos and Puzzle modes. Chaos lets most everything run free and you need to capture most of the balls on the screen to complete each level. There are 3 sets of chaos modes with ten levels each. The puzzle mode is much more controlled and you will need to figure out just the right place and time to tap to recover the other balls. Basic puzzles contain only the balls moving around the screen. Wall puzzles use walls to complicate the puzzles by limiting the movement of the balls. Fuse delay puzzles include walls and allow some of the balls to keep moving after they are captured leaving a path of destruction in their wake. Each level has a fixed score you will receive for completing the level. In addition for every ball you recover beyond the required number, you will get a bonus of 100 points. That is the good news. The bad news is that if you fail to complete the level, you will lose 100 points. Your final score comes from all of the level scores, bonus scores and failed attempts you make at each level. There are 23 puzzle levels and 30 chaos levels.  ","version":"0.8.67","versionNote":"","homeURL":"http:\/\/www.caldantech.com","supportURL":"http:\/\/www.caldantech.com","custsupportemail":"support@caldantech.com","custsupportphonenum":"..","copyright":"Copyright 2009 Caldantech. All rights reserved","licenseURL":"","locale":"en_US","appSize":1066360,"installSize":2003486,"isEncrypted":false,"adultRating":false,"islocationbased":false,"lastModifiedTime":"2009-12-04T23:04:55.000+0000","mediaLink":null,"mediaIcon":null,"attributes":{"provides":{"noApp":false,"dockMode":false,"universalSearch":false,"connectors":[],"services":[],"optimizedUserExperience":false}},"price":0.99,"currency":"USD","isAdvertized":false,"filename":"com.caldantechpub.scatter_0.8.67_all.ipk","free":false,"touchpad_exclusive":false,"images":{"1":{"thumbnail":"593\/en\/images\/1\/S\/game.jpg","screenshot":"593\/en\/images\/1\/L\/game.jpg","orientation":"P","device":"P"},"2":{"thumbnail":"593\/en\/images\/2\/S\/front.jpg","screenshot":"593\/en\/images\/2\/L\/front.jpg","orientation":"P","device":"P"},"3":{"thumbnail":"593\/en\/images\/3\/S\/info.jpg","screenshot":"593\/en\/images\/3\/L\/info.jpg","orientation":"P","device":"P"}}}