{"publicApplicationId":"com.innuvate.dicetool","description":"The Ultimate Dice Tool Kit is a dynamic, fun dice creation and rolling app for anybody who loves games using dice - from classic boardgames to roleplaying games to just flipping a coin!  The Ultimate Dice Took Kit is the only REALISTIC dice app for the WebOS platform.  You can choose the dice you wish to roll (using 2, 4, 6, 8, 10, 12 and 20-sided dice), customize their appearances and what is said on their faces, and much more. The interface is quick and easy to use. And the best part is you shake the phone to roll the dice!  Version 2.0 has all these features, plus some added perks users asked for!  The biggest of these additions is sound!  Plus, there are increased appearance options, including a way to add textures to dice (creative folks can add glitter, marble looks, and more).  Dice with pips (traditional 6-siders) are a visual option.  Individual dice may be locked so they will not roll while others on the screen do, a must-have for re-rolling.  A \"roll\" button was added so you don't have to shake the phone if you'd rather not do so.  Finally, an innovative system is in place so you can tailor dice set-ups, creating unique backgrounds and dice for different games or RPG characters.  All this is added, plus the program runs SIGNIFICANTLY faster with fewer bugs than before.  If you haven't bought this app, now is the time to join our growing community.  And if you have the prior version, now is the time to upgrade.  Support fellow gamers - use Ultimate Dice Tool Kit.  And see you at GenCon Indy 2010.","version":"2.0.0","versionNote":"","homeURL":"http:\/\/www.innuvate.com","supportURL":"http:\/\/www.innuvate.com\/support","custsupportemail":"innuvate@gmail.com","custsupportphonenum":"..","copyright":"Copyright 2009 Innuvate Industries","licenseURL":"","locale":"en_US","appSize":681440,"installSize":5084828,"isEncrypted":false,"adultRating":false,"islocationbased":false,"lastModifiedTime":"2010-04-13T02:13:00.000+0000","mediaLink":null,"mediaIcon":null,"attributes":{"provides":{"noApp":false,"dockMode":false,"universalSearch":false,"connectors":[],"services":[],"optimizedUserExperience":false}},"price":2.99,"currency":"USD","isAdvertized":false,"filename":"com.innuvate.dicetool_2.0.0_all.ipk","free":false,"touchpad_exclusive":false,"images":{"1":{"thumbnail":"596\/en\/images\/1\/S\/dicetool_2010-11-04_175053.png","screenshot":"596\/en\/images\/1\/L\/dicetool_2010-11-04_175053.png","orientation":"P","device":"P"},"2":{"thumbnail":"596\/en\/images\/2\/S\/dicetool_2010-11-04_175447.png","screenshot":"596\/en\/images\/2\/L\/dicetool_2010-11-04_175447.png","orientation":"P","device":"P"},"3":{"thumbnail":"596\/en\/images\/3\/S\/dicetool_2010-11-04_180030.png","screenshot":"596\/en\/images\/3\/L\/dicetool_2010-11-04_180030.png","orientation":"P","device":"P"}}}