{"publicApplicationId":"com.cellhigh.glucosediary","description":"If you’re ready to take control of your Blood Sugar, Glucose Diary can help you.  GD helps you track your blood sugar easily with only a few screen taps. GD allows for tracking of glucose levels, insulin, food, carbs, medication, exercise, weight, BP, stress levels, sleep and a host of extras like injection sites, symptoms and lab test results all with just a few screen taps.  Enter as little or as much data as you need.  Create new items, new medication names, new insulin brand name, new symptoms etc. in your selectable lists.  Glucose readings are color coded for easy assessment and can be entered in mg\/dL or mmol\/L. The app has several reports and graphs that show numerous statistics including overall averages, minimum, maximum, weekly and daily distributions.  GD makes it easy to perform tasks like graphing your patterns, emailing reports, including graphical attachments to your doctor and advisors. Glucose Diary will also allow you to export your data to a spread sheet, backup data offline and all, again, with just a few screen taps.  This is one of the most helpful tools for you and your doctors.  It helps you and your doctor understand and analyze your progress easily, accurately and with fewer mistakes.\n\nStart using Glucose Diary immediately and take control of your blood glucose.  Once you’ve used it for a while, you will be able to customize numerous features to make it work the way you like, making it easier to take control, improve your health, reduce your medication and lower your health costs.\n\nSupport for Glucose Diary includes a support website, good documentation and a public forum for suggestions, questions and answers.\n\nWe work very hard on making our products complete, easy to use and appealing.  We always welcome any suggestion or ideas you might have to improve our products.","version":"1.1.4","versionNote":"","homeURL":"http:\/\/cellHigh.com","supportURL":"http:\/\/cellHigh.com","custsupportemail":"support@cellHigh.com","custsupportphonenum":"","copyright":"Copyright 2010 cellHigh","licenseURL":"","locale":"en_US","appSize":272668,"installSize":8093696,"isEncrypted":false,"adultRating":false,"islocationbased":false,"lastModifiedTime":"2012-06-01T11:36:35.000+0000","mediaLink":"http:\/\/www.youtube.com\/watch?v=YoRMifOx9Rc","mediaIcon":"http:\/\/img.youtube.com\/vi\/YoRMifOx9Rc\/2.jpg","attributes":{"provides":{"noApp":false,"dockMode":false,"universalSearch":false,"connectors":["null"],"services":[],"optimizedUserExperience":false}},"price":4.99,"currency":"USD","isAdvertized":false,"filename":"com.cellhigh.glucosediary_1.1.4_all.ipk","free":false,"touchpad_exclusive":false,"images":{"1":{"screenshot":"5971\/1.1.4\/en\/images\/1\/L\/gd-palm-screenshot1.png","thumbnail":"5971\/1.1.4\/en\/images\/1\/L\/gd-palm-screenshot1.png","orientation":"P","device":"P"},"2":{"screenshot":"5971\/1.1.4\/en\/images\/2\/L\/gd-palm-screenshot2.png","thumbnail":"5971\/1.1.4\/en\/images\/2\/L\/gd-palm-screenshot2.png","orientation":"P","device":"P"},"3":{"screenshot":"5971\/1.1.4\/en\/images\/3\/L\/gd-palm-screenshot3.png","thumbnail":"5971\/1.1.4\/en\/images\/3\/L\/gd-palm-screenshot3.png","orientation":"P","device":"P"},"4":{"screenshot":"5971\/1.1.4\/en\/images\/4\/L\/gd-palm-screenshot4.png","thumbnail":"5971\/1.1.4\/en\/images\/4\/L\/gd-palm-screenshot4.png","orientation":"P","device":"P"},"5":{"screenshot":"5971\/1.1.4\/en\/images\/5\/L\/gd-palm-screenshot5.png","thumbnail":"5971\/1.1.4\/en\/images\/5\/L\/gd-palm-screenshot5.png","orientation":"P","device":"P"}}}