{"publicApplicationId":"com.atommo.app.rkc","description":"It's the Grand Opening of the Roadkill Cafe and Slim LaChance is out to build a reputation for serving the best redneck cuisine in three counties. Collect roadkills, dodge traffic, and keep your customers satisfied before they blow their tops.\n\nComplete Cafe mode to unlock unlimited Arcade mode, and additional difficulties. Try to outscore players around the world on the international scoreboard!\n\nRoadkill Cafe also includes the following mini-games:\n\nSurvivor - The next time someone tells you to go play in traffic, you'll have the option of trying this simulator first. Dodge traffic for as long as you can. \n\nVengeance - Why did the chicken cross the road? Vengeance! Bloodthirsty chickens with a taste for rednecks are on the loose. Luckily rhinos hate chickens. Try not to get killed in the melee.\n\nRampage - What's a road trip without roadkills? Go for a ride on the Infinity Highway, dodging traffic and flattening fauna. Rack up the points the farther you go, but try and stay between the lines.\n\n---\n\nDynamic fingertip controls - Control your character from any point on the screen. Simply release and touch another location to retake control.\nDon't want to get fingerprints on the screen? Take advantage of your devices motion detection to control the player!\nPositional sound - Swarms of chickens never sounded so deadly.\nChallenges - Try and beat all 16 challenges. From ridiculously easy to insanely hard. \n \nContains scenes of cartoon violence, use of firearms, and recycling.","version":"1.0.1","homeURL":"http:\/\/www.atommo.com","supportURL":"http:\/\/www.atommo.com","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2008-2010 Atommo","licenseURL":"http:\/\/www.atommo.com","locale":null,"appSize":"4387400","installSize":"4387400","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"0.99","currency":"USD","filename":"com.atommo.app.rkc_1.0.1_all.ipk","free":false,"images":[{"thumbnail":"6029\/images\/1\/L\/1.jpg","screenshot":"6029\/images\/1\/L\/1.jpg","orientation":"P","device":"P"},{"thumbnail":"6029\/images\/2\/L\/2.jpg","screenshot":"6029\/images\/2\/L\/2.jpg","orientation":"P","device":"P"},{"thumbnail":"6029\/images\/3\/L\/3.jpg","screenshot":"6029\/images\/3\/L\/3.jpg","orientation":"P","device":"P"},{"thumbnail":"6029\/images\/4\/L\/4.jpg","screenshot":"6029\/images\/4\/L\/4.jpg","orientation":"P","device":"P"},{"thumbnail":"6029\/images\/5\/L\/5.jpg","screenshot":"6029\/images\/5\/L\/5.jpg","orientation":"P","device":"P"}]}