{"publicApplicationId":"com.rbtwhiz.fuel","description":"- 0.9.22 fixes issues with exporting to and\/or importing from Google Docs; specifically the 403 SSL error and the ampersand ('&') character error.\n\n*** NOTE: If you are updating from a previous version of the app, it is recommended that you export all of your collected data prior to downloading and installing this version. ***\n\n** IF YOU ENCOUNTER A PROBLEM OR NEED HELP, PLEASE USE THE PROVIDED SUPPORT CHANNELS. THE \"REVIEWS\" SECTION OF THE APP CATALOG IS NOT THE PROPER CHANNEL TO SEEK TECHNICAL SUPPORT. **\n\n- Are you curious about the efficiency of your car, truck or motorcycle? Do you want to see how your driving habits impact fuel economy & consumption? How about trends in what you've paid for petrol? How much that last trip cost you? Are you tired of carrying that log book around, but you still want to monitor your gas mileage? Prefer something more convenient?\n\nYeah, me too...\n\n- Fuel allows you to track fueling events for your vehicles, whether they run on gasoline or diesel, in your preferred unit of measure, for distance, volume and currency. It will help you when you are traveling abroad by converting the values you see on the pump to the ones you are more comfortable with. Convert between Miles and Kilometers, US Gallons, Imperial Gallons and Litres, Feet and Meters, and numerous currencies (via Google Finance - Currency Converter). It will even allow you to record your location and elevation (via Location Services), and show you the nearby gas stations (via Google Maps). You can set up odometer\/date based service reminders (i.e. oil change, tune-up, tire rotation, etc), and even create your own presets.\n\n- Fuel allows you to manage your data via import & export with a Google Docs account... so your data is accessible in the formats that you decide.","version":"0.9.22","versionNote":"Fixes export\/import errors, to\/from Google Docs.","homeURL":"http:\/\/sites.google.com\/site\/webosrbtwhiz","supportURL":"http:\/\/sites.google.com\/site\/webosrbtwhiz","custsupportemail":"webos_rbtwhiz@googlegroups.com","custsupportphonenum":"","copyright":"Copyright 2010 Rob Whisenant","licenseURL":"","locale":"en_US","appSize":295528,"installSize":4816896,"isEncrypted":false,"adultRating":false,"islocationbased":true,"lastModifiedTime":"2011-10-07T20:56:36.000+0000","mediaLink":null,"mediaIcon":null,"attributes":{"provides":{"noApp":false,"dockMode":false,"universalSearch":false,"connectors":["null"],"services":[],"optimizedUserExperience":false}},"price":0,"currency":"USD","isAdvertized":false,"filename":"com.rbtwhiz.fuel_0.9.22_all.ipk","free":false,"touchpad_exclusive":false,"images":{"1":{"screenshot":"610\/0.9.22\/en\/images\/1\/L\/ph_0916_MainReminder.jpg","thumbnail":"610\/0.9.22\/en\/images\/1\/S\/ph_0916_MainReminder.jpg","orientation":"P","device":"P"},"2":{"screenshot":"610\/0.9.22\/en\/images\/2\/L\/ph_0916_MainSummary.jpg","thumbnail":"610\/0.9.22\/en\/images\/2\/S\/ph_0916_MainSummary.jpg","orientation":"P","device":"P"},"3":{"screenshot":"610\/0.9.22\/en\/images\/3\/L\/ph_0916_Graph.jpg","thumbnail":"610\/0.9.22\/en\/images\/3\/S\/ph_0916_Graph.jpg","orientation":"P","device":"P"},"4":{"screenshot":"610\/0.9.22\/en\/images\/4\/L\/ph_0916_Splash.jpg","thumbnail":"610\/0.9.22\/en\/images\/4\/S\/ph_0916_Splash.jpg","orientation":"P","device":"P"}}}