{"publicApplicationId":"com.jackpot.fallingsand2","description":"***webOS 2.x and VEER compatible! NOT PIXI Compatible. Falling Sand2 was hand selected by HP \/ Palm as a featured app. The famous Falling Sand “game” is back!!! Falling Sand2 is the new and improved version with more features added. The color scheme revamped, the dashboard of elements redone, more functions, more elements, MUCH MORE FUN!!! One of the fastest moving apps and a PDK Hot Apps finalist. Falling Sand2 includes a HELP shortcut on right side of dashboard, and all items \/ elements on the dashboard when tapped, will display text on the screen describing what they are. All keypad functions and secret elements display text on the screen too! So, you can either use HELP to launch the help page, or just tap the dashboard items at the bottom of the game screen, or press any keys on your phone’s keyboard and if it performs a function, you will see it displayed on the screen. You can literally spend minutes to hours interacting with the falling sand and other elements to create amazing visual effects. If you’re not familiar with the \"game\" you can draw on the screen using your finger, using different elements such as water, ice, oil, fire, and watch them interact. You can draw lines, curves and watch the elements pile up or dissolve them. Use the Torch to Burn Plants. :) Fire to melt through iron or stone. Even try tap, hold, then tap with another finger or multi touch spread (like zooming on e-mail and web pages), for psychotic effects. But the most fun is just running the app and experimenting. “Captivating...”, “Very addicting”, “A beautifully executed port of the classic Falling Sand Game”, “The most addicting, intriguing, and relaxing app available”, “Great, fun app that is an awesome time-waster…”, “Wtf I have like 30 3d apps and amazingly fun game but I find myself playing this more and more.”, “WHY IS THIS SO ADDICTING!!!!!”, “There goes my day. I'm so glad to see this ported to WebOS.”, ” Preeeeeetty and relaxing...”","version":"1.0.0","versionNote":"","homeURL":"http:\/\/jackpotideas.com","supportURL":"http:\/\/jackpotideas.com","custsupportemail":"support@jackpotideas.com","custsupportphonenum":"","copyright":"Copyright 2011 J@ckpot ideas Inc.","licenseURL":"","locale":"en_US","appSize":27132,"installSize":163840,"isEncrypted":false,"adultRating":false,"islocationbased":false,"lastModifiedTime":"2012-06-01T10:37:02.000+0000","mediaLink":null,"mediaIcon":null,"attributes":{"provides":{"noApp":false,"dockMode":false,"universalSearch":false,"connectors":["null"],"services":[],"optimizedUserExperience":false}},"price":0.99,"currency":"USD","isAdvertized":false,"filename":"com.jackpot.fallingsand2_1.0.0_all.ipk","free":false,"touchpad_exclusive":false,"images":{"1":{"screenshot":"6114\/1.0.0\/en\/images\/1\/L\/ph_FallingSand2.png","thumbnail":"6114\/1.0.0\/en\/images\/1\/S\/ph_FallingSand2.png","orientation":"P","device":"P"},"2":{"screenshot":"6114\/1.0.0\/en\/images\/2\/L\/ph_fs2.png","thumbnail":"6114\/1.0.0\/en\/images\/2\/S\/ph_fs2.png","orientation":"P","device":"P"},"3":{"screenshot":"6114\/1.0.0\/en\/images\/3\/L\/ph_FallingSand2FeaturedApp.png","thumbnail":"6114\/1.0.0\/en\/images\/3\/S\/ph_FallingSand2FeaturedApp.png","orientation":"P","device":"P"}}}