{"publicApplicationId":"com.mikagika.loancruncher","description":"Buying a house?  You need loanCruncher!  More than just a loan calculator, loanCruncher helps you estimate your full monthly mortgage payment, factoring in things like PMI, closing costs, taxes, etc.    Enter down payment and closing costs in percentage or dollars.  Enter your expected taxes, insurance, and association costs per year, month, half, quarter, or percent of purchase price. loanCruncher then figures out your total monthly cost.  Have a budget and not sure how much house you can get for that amount?  Enter your available cash, budgeted monthly payment, and estimates for the other costs and loanCruncher will figure out a maximum purchase price that would fit your budget.    As you work, loanCruncher automatically updates your result.  If you close loanCruncher, everything you’ve done is restored when you open it again.  You can save up to 5 scenarios and compare them on screen or even email them to yourself.  Thinking about refinancing? Enter your current mortgage information in one scenario, and your proposed refinanced mortgage in another to compare them.  Need an estimate of your payoff amount? Enter your mortgage information, and you can do a payoff calculation, including factoring in your extra regular principal payments.    PMI rates are entered on the preferences screen and can include upfront PMI, monthly PMI, or both.  When your down payment is less than 20%, loanCruncher will automatically apply the PMI rates entered.  And if you just want a simple loan calculation, loanCruncher can do that too, just select “simple loan” instead of “mortgage estimator” in the preferences.  +++++ New in version 1.1.00 – you can now do a simple reverse calculation of the interest rate, term, payment, or principal of a loan given the other three values.","version":"1.1.00","homeURL":"http:\/\/www.mikagika.com\/loanCruncher\/index.html","supportURL":"http:\/\/www.mikagika.com\/loanCruncher\/index.html","custsupportemail":"","custsupportphonenum":"","copyright":"copyright 2009 mikagika, ltd","licenseURL":"http:\/\/www.mikagika.com\/loanCruncher\/index.html","locale":null,"appSize":"40604","installSize":"40604","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.97","currency":"USD","filename":"com.mikagika.loancruncher_1.1.00_all.ipk","free":false,"images":[{"thumbnail":"612\/en\/images\/1\/L\/loancruncher_2009-03-12_193247.png","screenshot":"612\/en\/images\/1\/L\/loancruncher_2009-03-12_193247.png","orientation":"P","device":"P"},{"thumbnail":"612\/en\/images\/2\/L\/loancruncher_2009-03-12_193257.png","screenshot":"612\/en\/images\/2\/L\/loancruncher_2009-03-12_193257.png","orientation":"P","device":"P"},{"thumbnail":"612\/en\/images\/3\/L\/loancruncher_2009-03-12_193323.png","screenshot":"612\/en\/images\/3\/L\/loancruncher_2009-03-12_193323.png","orientation":"P","device":"P"},{"thumbnail":"612\/en\/images\/4\/L\/loancruncher_2010-15-02_213146.png","screenshot":"612\/en\/images\/4\/L\/loancruncher_2010-15-02_213146.png","orientation":"P","device":"P"},{"thumbnail":"612\/en\/images\/5\/L\/loancruncher_2009-03-12_193442.png","screenshot":"612\/en\/images\/5\/L\/loancruncher_2009-03-12_193442.png","orientation":"P","device":"P"}]}