{"publicApplicationId":"com.ican-hypnosis.icanstopsmoking","description":"The benefits of quitting cigarettes are almost immediate - few days after stopping, the nicotine is out of your system - and if that were all there was to stopping, that would be fine because most smokers agree with Mark Twain that stopping smoking is not the problem, '...it’s easy,' he said, 'I've done it thousands of times.'\nNo, the problem is not to stop smoking but to stay stopped! ...And how do you do that? - Only by really dealing with the underlying psychological problem of cigarette and nicotine addiction. This is the difficult part because you may not even have a bad view of cigarettes at all, maybe regarding them as allies or friends - something to turn to in times of reflection and stress.\nHypnotherapy tackles these attitudes to smoking by dealing with both the positive gains from stopping smoking and the deep seated negative roots that cause you to continue to smoke... and here, dealing with the negative roots of smoking is most important because if you don't do this effectively, you soon come to the view that you've been deprived of something and from there it's just a matter of time before you go back to smoking again.\nHypnotherapy deals with both the emotional and psychological aspects of stopping smoking, both negative and positive, and also with the latent and persistent belief that in stopping smoking you have lost something. This is the core of the problem of giving up - an unconscious deep seated conviction that if not eradicated by hypnotherapy, makes a return to smoking inevitable. Hypnotherapy prevents such a relapse by removing these deep-rooted and underlying causes and so makes a return to smoking a complete irrelevance.\niCan hypnosis emphasises the recovery of good health and fitness, a new freedom and renewed energy to do new things previously considered out of reach.","version":"1.0.0","versionNote":"","homeURL":"http:\/\/www.ican-hypnosis.com\/","supportURL":"http:\/\/www.ican-hypnosis.com\/support\/","custsupportemail":"techsupport@ican-hypnosis.com","custsupportphonenum":"","copyright":"copyright 2010 Donald Mackinnon","licenseURL":"","locale":"en_US","appSize":29171978,"installSize":30375936,"isEncrypted":false,"adultRating":false,"islocationbased":false,"lastModifiedTime":"2012-06-01T10:47:22.000+0000","mediaLink":null,"mediaIcon":null,"attributes":{"provides":{"noApp":false,"dockMode":false,"universalSearch":false,"connectors":["null"],"services":[],"optimizedUserExperience":false}},"price":3.99,"currency":"USD","isAdvertized":false,"filename":"com.ican-hypnosis.icanstopsmoking_1.0.0_all.ipk","free":false,"touchpad_exclusive":false,"images":{"1":{"screenshot":"6188\/1.0.0\/en\/images\/1\/L\/icanstopsmoking_2010-13-11_211143.png","thumbnail":"6188\/1.0.0\/en\/images\/1\/L\/icanstopsmoking_2010-13-11_211143.png","orientation":"P","device":"P"}}}