{"publicApplicationId":"com.brighthouselabs.atlnhlfans","description":"Are you a huge Atlanta hockey fan?  If you find yourself always wanting to know exactly what is happening with Atlanta, this is the app for you!\n\nBoasting a sleek design and intuitive interface, Hockey Fans - Atlanta is the best way to follow Atlanta on the go.  \n\nWith Hockey Fans - Atlanta you'll have access to the latest news, stats, standings and scores.  You'll always know what's happening with your team!\n\n\n\nThe app comes loaded with detailed team information so you can know everything about Atlanta.  Wow your friends with your unrivalled knowledge!\n\nAlways know when the team is playing with the full schedule included in the app.  Make sure you never miss a game!  And after each game be sure to check the updated standings to find out where your team is ranked.\n\nIf you can't watch the game, Hockey Fans - Atlanta offers you the next best thing with a built in scores feed.  You'll still be able to check in and see how the game went!  \n\nPlus, you'll receive all the latest Atlanta news as it happens through the rich news feed.  Every time the team wins a game, gives some awesome interviews or makes headlines outside of hockey - you'll hear about it!\n\nWatch the latest Atlanta highlights and interviews as they're posted with the included video updates.  Relive the best moments whenever you want!\n\nAs if all that wasn't enough, you can also chat with other Atlanta fans using the built in chat feature.  Discuss the latest news and make sure your opinion is heard!\n\nThere is no better or more comprehensive tool to stay up to date with Atlanta!  If you are a true Atlanta fan, you owe it to yourself to download Hockey Fans - Atlanta.\n\n\n\n** Brighthouse Labs, and the Hockey Fans- Atlanta application are in no way associated with the NHL or the Atlanta Thrashers. All trademarks are owned by their respective owners.\n\n\n","version":"1.0.0","versionNote":"","homeURL":"http:\/\/www.brighthouselabs.com","supportURL":"http:\/\/www.brighthouselabs.com","custsupportemail":"feedback@brighthouselabs.com","custsupportphonenum":"..","copyright":"Copyright BrightHouseLabs 2010","licenseURL":"","locale":"en_US","appSize":23346,"installSize":1550083,"isEncrypted":false,"adultRating":false,"islocationbased":false,"lastModifiedTime":"2012-05-31T22:26:55.000+0000","mediaLink":null,"mediaIcon":null,"attributes":{"provides":{"noApp":false,"dockMode":false,"universalSearch":false,"connectors":["null"],"services":[],"optimizedUserExperience":false}},"price":0.99,"currency":"USD","isAdvertized":false,"filename":"com.brighthouselabs.atlnhlfans_1.0.0_all.ipk","free":false,"touchpad_exclusive":false,"images":{"1":{"screenshot":"619\/1.0.0\/en\/images\/1\/L\/Primary.png","thumbnail":"619\/1.0.0\/en\/images\/1\/L\/Primary.png","orientation":"P","device":"P"},"2":{"screenshot":"619\/1.0.0\/en\/images\/2\/L\/Videos.png","thumbnail":"619\/1.0.0\/en\/images\/2\/L\/Videos.png","orientation":"P","device":"P"},"3":{"screenshot":"619\/1.0.0\/en\/images\/3\/L\/Standings.png","thumbnail":"619\/1.0.0\/en\/images\/3\/L\/Standings.png","orientation":"P","device":"P"},"4":{"screenshot":"619\/1.0.0\/en\/images\/4\/L\/News.png","thumbnail":"619\/1.0.0\/en\/images\/4\/L\/News.png","orientation":"P","device":"P"},"5":{"screenshot":"619\/1.0.0\/en\/images\/5\/L\/Schedule.png","thumbnail":"619\/1.0.0\/en\/images\/5\/L\/Schedule.png","orientation":"P","device":"P"}}}