{"publicApplicationId":"com.dblpartners.acsm","description":"Upward Mobility's ACSM Certified Personal Trainer exam prep app Palm webOS is our exclusive study aid designed for the American College of Sports Medicine Certified Personal Trainer exam with application to their Certified Health Fitness Specialist an Exercise Specialist exams.  *   It contains 486 simulated exam questions with detailed explanations.  All of our material is written exclusively for Upward Mobility by expert PT writers and undergo a rigorous review process.  Our Personal Trainer app is designed to assess whether a prospective CPT has the skills and knowledge require to create safe and effective individualized plans for exercise programs based on the best available science and clinical evidence, and to expand and reinforce that knowledge with our detailed explanations.   *   This app covers all core areas of the ACSM Exam Specifications, including: Exercise Prescription and Programming; Exercise Physiology and Related Exercise Science; Health Appraisal and Fitness Exercise Testing;\nClinical and Medical Considerations; Nutrition and Weight Management; Safety, Injury Prevention, and Emergency Procedures; Human Behavior; and  Program Administration, Quality Assurance, and Outcome Assessment.  *  Upward Mobility is not affiliated with nor is this app endorsed by the ACSM  ||  Upward Mobility creates high quality management education and test preparation material that is witty, engaging, and adds value in the learning process.  *   We are a double bottom line company committed to education in the developing world. Some of the profits will be used to deploy education via mobile phone in emerging countries.","version":"1.0.4","versionNote":"","homeURL":"http:\/\/upwardpro.com","supportURL":"http:\/\/upwardpro.com","custsupportemail":"info@upwardpro.com","custsupportphonenum":"","copyright":"DBL Partners LLC","licenseURL":"","locale":"en_US","appSize":178794,"installSize":2129920,"isEncrypted":false,"adultRating":false,"islocationbased":false,"lastModifiedTime":"2012-06-01T19:55:39.000+0000","mediaLink":null,"mediaIcon":null,"attributes":{"provides":{"noApp":false,"dockMode":false,"universalSearch":false,"connectors":["null"],"services":[],"optimizedUserExperience":false}},"price":6.99,"currency":"USD","isAdvertized":false,"filename":"com.dblpartners.acsm_1.0.4_all.ipk","free":false,"touchpad_exclusive":false,"images":{"1":{"screenshot":"6335\/1.0.4\/en\/images\/1\/L\/1.png","thumbnail":"6335\/1.0.4\/en\/images\/1\/L\/1.png","orientation":"P","device":"P"},"2":{"screenshot":"6335\/1.0.4\/en\/images\/2\/L\/2.png","thumbnail":"6335\/1.0.4\/en\/images\/2\/L\/2.png","orientation":"P","device":"P"},"3":{"screenshot":"6335\/1.0.4\/en\/images\/3\/L\/3.png","thumbnail":"6335\/1.0.4\/en\/images\/3\/L\/3.png","orientation":"P","device":"P"},"4":{"screenshot":"6335\/1.0.4\/en\/images\/4\/L\/4.png","thumbnail":"6335\/1.0.4\/en\/images\/4\/L\/4.png","orientation":"P","device":"P"},"5":{"screenshot":"6335\/1.0.4\/en\/images\/5\/L\/5.png","thumbnail":"6335\/1.0.4\/en\/images\/5\/L\/5.png","orientation":"P","device":"P"}}}