{"publicApplicationId":"com.scriptmatic.palm.hypnosis.looseweighthyp","description":"This is a single all-intensive hypnosis audio designed to get results in all areas of weight loss right away. Sometimes it can be very time consuming to listen to multiple audios in a weight loss hypnosis program. I made this single session audio to cover every aspect of losing weight and hypnosis.\n\nThis session is designed to create the strongest effect FAST. After listening, you will have no desire to eat in between meals or at night. You will no longer eat when stressed or bored. You will focus more on well-balanced meals. You will automatically think and eat in smaller portion sizes. You will SLOW DOWN and enjoy the food much more. You will stop when you are satisfied.\u2028\u2028You will have a strong desire for fruits and vegetables and will feel less attracted to, and a reduced desire for, unhealthy foods and sweets and will only feel right having them in smaller portions, less often. \u2028\u2028\n\nAfter listening to this session you will feel a stronger desire to exercise. \u2028\u2028You will find the exercise activities that are realistic for you to do each day.\n\nYou will have more energy each day after listening to this session. You will get out of bed easier in the morning. It will feel easier to make the time to exercise. You will be content knowing that you will go in steps, whether it is simply starting to walk again or running twice per day. You will be content with where you begin to exercise. \n\nI hope you reach all of your weight loss goals. Enjoy.","version":"1.0.0","versionNote":"","homeURL":"http:\/\/ehypproductions.blogspot.com","supportURL":"http:\/\/ehypproductions.blogspot.com","custsupportemail":"palmappsupport@hypnosisinmurfreesboro.com","custsupportphonenum":"","copyright":"copyright","licenseURL":"","locale":"en_US","appSize":20787024,"installSize":22052864,"isEncrypted":false,"adultRating":false,"islocationbased":false,"lastModifiedTime":"2012-06-01T10:44:02.000+0000","mediaLink":null,"mediaIcon":null,"attributes":{"provides":{"noApp":false,"dockMode":false,"universalSearch":false,"connectors":["null"],"services":[],"optimizedUserExperience":false}},"price":2.99,"currency":"USD","isAdvertized":false,"filename":"com.scriptmatic.palm.hypnosis.looseweighthyp_1.0.0_all.ipk","free":false,"touchpad_exclusive":false,"images":{"1":{"screenshot":"6487\/1.0.0\/en\/images\/1\/L\/screen_shot_main.png","thumbnail":"6487\/1.0.0\/en\/images\/1\/L\/screen_shot_main.png","orientation":"P","device":"P"},"2":{"screenshot":"6487\/1.0.0\/en\/images\/2\/L\/screen_shot_audio.png","thumbnail":"6487\/1.0.0\/en\/images\/2\/L\/screen_shot_audio.png","orientation":"P","device":"P"}}}