{"publicApplicationId":"net.jbcg.vocabbuilder","description":"Vocab Builder is an educational utility that will help you learn GRE and SAT vocabulary as well as create and share your own new sets of definitions, word associations, or vocabulary terms.\n\n\nWith version 1.0.003 you can now create and share your own sets of symbols, and characters.\nThe application comes with a set of 80 mathematical symbols and a free demonstration set of Spanish characters is available from the in-app community page.\n\n\nYou can create your own set of flash cards for studying any subject or use the built in GRE and SAT flash cards, with 350 words each, to prep for an upcoming exam.\n\n\nOnce you create your own flash cards you can export them to any email address, import them from an email or choose to share them with the community.  The community page can be found as an option on the application's main menu.\n\n\nDefinition categories submitted for community use will be reviewed by administrators and then (if applicable) be published to the in-app community page.\n\n\nVocab Builder supports flash card mode which allows you to study a set of definition\/word associations.  Vocab Builder will record the amount of time you spend studying each category so you can get an idea of how hard you've been studying.\n\n\nVocab Builder supports a test mode which quizzes you on the word, the definition, or a random choice or either.  Your test results are recorded and categorized by the type of definitions you're testing on.\n\n\nVocab Builder supports a word of the day feature which gives you a word each day to review from either the built in SAT, GRE words or from the words you've downloaded or created on your own.\n\n\nVocab Builder now supports the creation of symbol lists for more complex definitions in subjects such as math, physics, and chemistry.","version":"1.0.019","versionNote":"","homeURL":"http:\/\/www.jbcg.net","supportURL":"http:\/\/www.jbcg.net","custsupportemail":"info@jbcg.net","custsupportphonenum":"","copyright":"Copyright 2011 JBCG","licenseURL":"","locale":"en_US","appSize":138164,"installSize":3538944,"isEncrypted":false,"adultRating":false,"islocationbased":false,"lastModifiedTime":"2011-08-17T10:38:52.000+0000","mediaLink":null,"mediaIcon":null,"attributes":{"provides":{"noApp":false,"dockMode":false,"universalSearch":false,"connectors":["null"],"services":[],"optimizedUserExperience":false}},"price":0,"currency":"USD","isAdvertized":false,"filename":"net.jbcg.vocabbuilder_1.0.019_all.ipk","free":false,"touchpad_exclusive":false,"images":{"1":{"screenshot":"6526\/1.0.019\/en\/images\/1\/L\/ph_vb_sc1.jpg","thumbnail":"6526\/1.0.019\/en\/images\/1\/S\/ph_vb_sc1.jpg","orientation":"P","device":"P"},"2":{"screenshot":"6526\/1.0.019\/en\/images\/2\/L\/ph_vb_sc2.jpg","thumbnail":"6526\/1.0.019\/en\/images\/2\/S\/ph_vb_sc2.jpg","orientation":"P","device":"P"},"3":{"screenshot":"6526\/1.0.019\/en\/images\/3\/L\/ph_vb_sc3.jpg","thumbnail":"6526\/1.0.019\/en\/images\/3\/S\/ph_vb_sc3.jpg","orientation":"P","device":"P"},"4":{"screenshot":"6526\/1.0.019\/en\/images\/4\/L\/ph_vb_sc4.jpg","thumbnail":"6526\/1.0.019\/en\/images\/4\/S\/ph_vb_sc4.jpg","orientation":"P","device":"P"},"5":{"screenshot":"6526\/1.0.019\/en\/images\/5\/L\/ph_vb_sc5.jpg","thumbnail":"6526\/1.0.019\/en\/images\/5\/S\/ph_vb_sc5.jpg","orientation":"P","device":"P"}}}