{"publicApplicationId":"com.webonastick.wfpk","description":"NEW FOR VERSION 1.2.0: Updated to work with WFPK's updated playlist feature.\n\nIf you’re a regular WFPK listener and find yourself wanting to know what song is playing right now or just played, this app is for you.\n\nThis unofficial* fan-authored app features the last ten songs played on WFPK**. Tap a song to copy it to the clipboard, send an email, or search Amazon, Google, or YouTube!\n\nThis app also provides quick access to WFPK’s online streams as well as their web site, and most importantly, a “Donate” button and a call to action, because public radio is awesome and you should totally support it!\n\nIt doesn’t do anything else, but I’m open to suggestions.\n\nWFPK is a listener-supported public radio station in Louisville, Kentucky, USA that features an “adult album alternative” mix as diverse as you’ll find anywhere. Indie rock, folk, alt-country, world music, blues, and everything in between. Old and new alike. The singles and then some. Local artists are also regularly played, and every once in a while, you’ll even hear some of the deejays throw in heavy metal, 80’s retro new wave, rap, and other surprises!\n\nWFPK also broadcasts locally-produced and nationally syndicated specialty programs on blues, bluegrass, alt-country, and other musical genres, as well as jazz music on Sundays.\n\n* THIS IS NOT AN OFFICIAL APP. I am not affiliated with Louisville Public Media, the owner and operator of WPFK. I am, however, a regular listener and financial supporter.\n\n** Data is pulled from publicbroadcasting.net, which is operated by NPR Digital Services and provides playlist data for WFPK.  Songs from all programs may not be included.\n\n&","version":"1.2.0","versionNote":"","homeURL":"http:\/\/webonastick.com\/webos\/","supportURL":"http:\/\/webonastick.com\/webos\/wfpk\/","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010–2011 Darren Embry","licenseURL":"","locale":"en_US","appSize":17218,"installSize":917504,"isEncrypted":false,"adultRating":false,"islocationbased":false,"lastModifiedTime":"2011-04-13T18:35:43.000+0000","mediaLink":null,"mediaIcon":null,"attributes":{"provides":{"noApp":false,"dockMode":false,"universalSearch":false,"connectors":[],"services":[],"optimizedUserExperience":false}},"price":0,"currency":"USD","isAdvertized":false,"filename":"com.webonastick.wfpk_1.2.0_all.ipk","free":false,"touchpad_exclusive":false,"images":{"1":{"thumbnail":"6531\/en\/images\/1\/S\/wfpk_2011-08-04_134944.png","screenshot":"6531\/en\/images\/1\/L\/wfpk_2011-08-04_134944.png","orientation":"P","device":"P"},"2":{"thumbnail":"6531\/en\/images\/2\/S\/wfpk_2011-08-04_134955.png","screenshot":"6531\/en\/images\/2\/L\/wfpk_2011-08-04_134955.png","orientation":"P","device":"P"},"3":{"thumbnail":"6531\/en\/images\/3\/S\/wfpk_2011-08-04_135011.png","screenshot":"6531\/en\/images\/3\/L\/wfpk_2011-08-04_135011.png","orientation":"P","device":"P"}}}