{"publicApplicationId":"com.kalemsoft.nesemdx-pixi","description":"Update: Fixed occasional launch failure issue, added zipped rom support, added on-screen controls for portrait mode and other new features (please check out KalemSoft website for a full release log).\nNesEm is an award winning NES console system emulator. You can play hundreds of NES games, also known as NES roms (not to be confused with SNES roms), with a single application. NesEm comes with two sample NES games. More games can be obtained separately and added to the application simply by placing them into the nesem folder on the Pixi USB drive (if nesem folder does not exist, NesEm will ask you to manually create this folder under the root folder of the USB drive). Just connect your phone to your PC via USB cable and select USB drive mode on your phone when prompted. A new drive will appear on your computer. Open the drive by clicking its icon and create a folder named nesem (all lowercase) there. Then, copy your games with .nes or .zip file extension to the nesem folder. Finally, right click on the drive icon and select eject option to exit the USB drive mode and disconnect your phone from your PC. NesEm will see the games you added next time it is run (sometimes a device reset may be needed for the file system to see the new files added). Note that if games are corrupt, NesEm may refuse to run them. You may use NesToy tool available at KalemSoft website to fix such games. NesEm has the following features. Support for various resolutions including full screen, GameGenie cheats, state saving with screenshots and configurable keyboard controls. ** NesEm was developed from scratch. Many hours were spent on building and testing it over 7 years. It is not based on any Open Source work. We charge for NesEm just to recover part of the effort put towards building and maintaining it for different PALM devices over 7 years. **","version":"1.1.0","homeURL":"http:\/\/www.kalemsoft.com\/support","supportURL":"http:\/\/www.kalemsoft.com\/support","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2003-2010 KalemSoft","licenseURL":"http:\/\/www.kalemsoft.com\/support","locale":null,"appSize":"577606","installSize":"577606","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"4.99","currency":"USD","filename":"com.kalemsoft.nesemdx-pixi_1.1.0_all.ipk","free":false,"images":[{"thumbnail":"6594\/en\/images\/1\/L\/sc3.png","screenshot":"6594\/en\/images\/1\/L\/sc3.png","orientation":"P","device":"P"},{"thumbnail":"6594\/en\/images\/2\/L\/screenshot4.png","screenshot":"6594\/en\/images\/2\/L\/screenshot4.png","orientation":"P","device":"P"},{"thumbnail":"6594\/en\/images\/3\/L\/sc6.png","screenshot":"6594\/en\/images\/3\/L\/sc6.png","orientation":"P","device":"P"},{"thumbnail":"6594\/en\/images\/4\/L\/sc7.png","screenshot":"6594\/en\/images\/4\/L\/sc7.png","orientation":"P","device":"P"}]}