{"publicApplicationId":"com.jiyer.etsybrowser","description":"This app is a must-have if you are shopping for an unique item whether its for yourself or for someone special.   Etsy.com carries so many carefully crafted handmade items you are bound to run into one that you like.  You can also browse through over 50 customized Gift Guides for ideas. Etsy.com is the web's top destination to buy anything handmade sold directly by individuals from all over the world.  The Etsy Browser app brings you on-the-go access to the listings on Etsy right to your phone. You can search by keywords, categories and price.   Alternatively, you can browse through Etsy Gift Guides (e.g. Gifts for Her\/Him, Personalized Gifts, Gifts under $25).Easily flick through the latest in handmade jewelry, clothing, accessories, art, housewares and many more. You will fall in love with the gorgeous graphics.  The app features a stylish design highlighting the crisp, high-resolution images. Seamlessly flick through the images using your phone’s familiar interface.  You may flick through all the items in a list or tap on any item to view a smooth slideshow of all available images for that item. Double-tap or pinch on images to zoom.  Read detailed descriptions for each item and share your favorite items with others via email\/sms. This app is not affiliated with Etsy.com in any way.  We are limited by what Etsy allows us to access on their site. For that reason, we can only pull listings and cannot buy, add favorite, converse with a seller and so on.    To make it easier for you, we provide a button that will open your phone’s browser and take you directly to the item’s page on Etsy.com. Tags: Shopping, craft, handmade, vintage, gift, valentine, geekery, bags, purses, books, magazines, mothers, decor, antique,  pottery, art, children, toys, holidays, supplies, candles, paper, pets, plants, weddings, baby, food, local, bath & beauty, wood work, quilts, bakery, patterns, board games, music, needle craft, knitting, glass, furniture, quirky, dolls, crochet, ceramics","version":"2.0.0","versionNote":"","homeURL":"http:\/\/www.jiyer.com\/etsy","supportURL":"http:\/\/www.jiyer.com\/etsy","custsupportemail":"etsy.browser@jiyer.com","custsupportphonenum":"..","copyright":"copyright 2010 SealsMedia","licenseURL":"","locale":"en_US","appSize":33976,"installSize":2258012,"isEncrypted":false,"adultRating":false,"islocationbased":false,"lastModifiedTime":"2012-06-01T00:03:16.000+0000","mediaLink":null,"mediaIcon":null,"attributes":{"provides":{"noApp":false,"dockMode":false,"universalSearch":false,"connectors":["null"],"services":[],"optimizedUserExperience":false}},"price":1.99,"currency":"USD","isAdvertized":false,"filename":"com.jiyer.etsybrowser_2.0.0_all.ipk","free":false,"touchpad_exclusive":false,"images":{"1":{"screenshot":"670\/2.0.0\/en\/images\/1\/L\/etsybrowser_v2.0.0.meta_1.png","thumbnail":"670\/2.0.0\/en\/images\/1\/L\/etsybrowser_v2.0.0.meta_1.png","orientation":"P","device":"P"},"2":{"screenshot":"670\/2.0.0\/en\/images\/2\/L\/etsybrowser_v2.0.0_2.png","thumbnail":"670\/2.0.0\/en\/images\/2\/L\/etsybrowser_v2.0.0_2.png","orientation":"P","device":"P"},"3":{"screenshot":"670\/2.0.0\/en\/images\/3\/L\/etsybrowser_v2.0.0_3.png","thumbnail":"670\/2.0.0\/en\/images\/3\/L\/etsybrowser_v2.0.0_3.png","orientation":"P","device":"P"},"4":{"screenshot":"670\/2.0.0\/en\/images\/4\/L\/etsybrowser_v2.0.0_4.png","thumbnail":"670\/2.0.0\/en\/images\/4\/L\/etsybrowser_v2.0.0_4.png","orientation":"P","device":"P"},"5":{"screenshot":"670\/2.0.0\/en\/images\/5\/L\/etsybrowser_v2.0.0_5.png","thumbnail":"670\/2.0.0\/en\/images\/5\/L\/etsybrowser_v2.0.0_5.png","orientation":"P","device":"P"}}}