{"publicApplicationId":"com.hawleytronics.docseekfree","description":"The DocSeek (Document Seeker) app was created to fulfill a need; the need to find ebooks and documents without having to sift through countless auction listings or web sites, paying outrageous prices, and\/or getting placed on email spam lists. The one-time price you pay to use DocSeek can pay for itself the very first time you use it! You would pay MUCH MORE for just one ebook in an online auction! And with this invaluable tool you can find unlimited eBooks and documents WITHOUT wasting TIME and MONEY searching web sites or auction listings!\n\nEnter a couple of keywords, select a document type, press the \"SEARCH\" button and you could have hundreds, if not thousands, of documents ready for instant download directly to your mobile device! You can even find most of what you see for SALE on online auctions, but for FREE!\n\nHot Tip#1: Do you wish you had the owners manual to something you own, but don't want to buy it online or try to go find it elsewhere? Use DocSeek to find it online and download it for FREE within minutes!\n\nHot Tip#2: Go on an auction site and search for an ebook for a particular subject you are interested in, and read the auction listings, note how much money they want for it. Run DocSeek and type the search term into the search box of DocSeek, and 9 times out of 10, you can find it for free with DocSeek!\n\nHot Tip#3: Find ebooks and documents using the Hot Tip from above, but take it a step further...search for Hot-Selling ebooks or Wholesale Lists, then download them with DocSeek, and then resell them on your favorite auction sites! You'll have an inside edge to your competition! They are reselling somethey paid a lot for, but you didn't pay anything! 100% PROFIT!","version":"1.0.0","versionNote":"","homeURL":"http:\/\/www.hawleytronics.com","supportURL":"http:\/\/www.documentseeker.com\/apphelp.php","custsupportemail":"docseeksupport@hawleytronics.com","custsupportphonenum":"","copyright":"©2010 HawleyTronics","licenseURL":"","locale":"en_US","appSize":195682,"installSize":1114112,"isEncrypted":false,"adultRating":false,"islocationbased":false,"lastModifiedTime":"2010-12-21T02:24:04.000+0000","mediaLink":null,"mediaIcon":null,"attributes":{"provides":{"noApp":false,"dockMode":false,"universalSearch":false,"connectors":[],"services":[],"optimizedUserExperience":false}},"price":0,"currency":"USD","isAdvertized":false,"filename":"com.hawleytronics.docseekfree_1.0.0_all.ipk","free":false,"touchpad_exclusive":false,"images":{"1":{"thumbnail":"6707\/en\/images\/1\/S\/ss_1.png","screenshot":"6707\/en\/images\/1\/L\/ss_1.png","orientation":"P","device":"P"},"2":{"thumbnail":"6707\/en\/images\/2\/S\/ss_2.png","screenshot":"6707\/en\/images\/2\/L\/ss_2.png","orientation":"P","device":"P"},"3":{"thumbnail":"6707\/en\/images\/3\/S\/ss_3.png","screenshot":"6707\/en\/images\/3\/L\/ss_3.png","orientation":"P","device":"P"},"4":{"thumbnail":"6707\/en\/images\/4\/S\/ss_4.png","screenshot":"6707\/en\/images\/4\/L\/ss_4.png","orientation":"P","device":"P"},"5":{"thumbnail":"6707\/en\/images\/5\/S\/ss_5.png","screenshot":"6707\/en\/images\/5\/L\/ss_5.png","orientation":"P","device":"P"}}}