{"publicApplicationId":"net.wizardapps.rss","description":"Ever wish you had something to read while on the bus or plane? Rhythm News Reader for WebOS allows you to do just that, without needing a constant data connection. With Rhythm, you can search through a massive collection of RSS feeds to find your favorite websites or you can enter a RSS feed URL manually. Ordinary RSS readers will only download the summaries that sites provide. Rhythm, however, downloads the ENTIRE article from the website and caches it for offline viewing. Because you never know when you are going to need something to read, Rhythm has a background updating feature. Wake up to a whole new collection of articles or have something to read on the plane, without having to worry about manually downloading articles to read. The background updating feature can be customized-- you can choose intervals from every five minutes to once a day so that you can fine tune the balance between having longer battery life or more content. Another amazing feature of Rhythm is the unique dashboard interface. Designed with readability in mind, the dashboard rotates through the most recent stories, showing you titles and quick summaries. With one tap you can bring the full app into the foreground to finish reading the story. This feature also works well with the Touchstone-- it blends right into the background, giving you a seamless reading experience that you will not find in any other app.","version":"1.0.3","homeURL":"http:\/\/wizardapps.net\/support.php","supportURL":"http:\/\/wizardapps.net\/support.php","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 WizardApps","licenseURL":"http:\/\/wizardapps.net\/support.php","locale":null,"appSize":"556928","installSize":"556928","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"3.99","currency":"USD","filename":"net.wizardapps.rss_1.0.3_all.ipk","free":false,"images":[{"thumbnail":"6759\/images\/1\/L\/rhythmbeta_2010-12-12_133838.png","screenshot":"6759\/images\/1\/L\/rhythmbeta_2010-12-12_133838.png","orientation":"P","device":"P"},{"thumbnail":"6759\/images\/2\/L\/rhythmbeta_2010-12-12_134737.png","screenshot":"6759\/images\/2\/L\/rhythmbeta_2010-12-12_134737.png","orientation":"P","device":"P"},{"thumbnail":"6759\/images\/3\/L\/rss_2010-12-12_141033.png","screenshot":"6759\/images\/3\/L\/rss_2010-12-12_141033.png","orientation":"P","device":"P"},{"thumbnail":"6759\/images\/4\/L\/rss_2010-12-12_141208.png","screenshot":"6759\/images\/4\/L\/rss_2010-12-12_141208.png","orientation":"P","device":"P"}]}