{"publicApplicationId":"com.appible.alicesadventuresinwonderlandaudio","description":"In this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\nAlice's Adventures in Wonderland (commonly shortened to Alice in Wonderland) is an 1865 novel written by English author Charles Lutwidge Dodgson under the pseudonym Lewis Carroll. It tells the story of a girl named Alice who falls down a rabbit hole into a fantasy world populated by peculiar and anthropomorphic creatures. The tale is filled with allusions to Dodgson's friends. The tale plays with logic in ways that have given the story lasting popularity with adults as well as children. It is considered to be one of the best examples of the \"literary nonsense\" genre, and its narrative course and structure have been enormously influential, especially in the fantasy genre. (Introduction by Wikipedia) \n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.0","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"293822","installSize":"293822","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.2","currency":"USD","filename":"com.appible.alicesadventuresinwonderlandaudio_1.0.0_all.ipk","free":false,"images":[{"thumbnail":"7062\/images\/1\/L\/alicesadventuresinwonderland1.png","screenshot":"7062\/images\/1\/L\/alicesadventuresinwonderland1.png","orientation":"P","device":"P"},{"thumbnail":"7062\/images\/2\/L\/alicesadventuresinwonderland2.png","screenshot":"7062\/images\/2\/L\/alicesadventuresinwonderland2.png","orientation":"P","device":"P"}]}