{"publicApplicationId":"com.appible.babbittaudio","description":"In this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\n    (Summary by Mike Vendetti) Sinclair Lewis’ George F. Babbitt is a complicated and conflicted character. When you think you have his next move figured out he surprises you. As you begin to like him, he does something to evoke the “what a rat” response.\n\n    Male menopause wasn’t a pre Great Depression term, but I would say George has all the symptoms. At a pudgy balding forty six he looks at his life, wife, family and business. He sees himself as a pretty successful business man, but when Tanis, the lonely widow has a leaky roof, he sees an opportunity for perhaps a more fulfilling relationship then he has at home. Add to Tanis a foray into radical politics, and we are about to witness an emotional and financial train wreck with Babbitt at the throttle.\n\n    This is a long story, but well worth listening to. Human nature hasn’t changed much in the last ninety years.\n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.0","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"277648","installSize":"277648","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.2","currency":"USD","filename":"com.appible.babbittaudio_1.0.0_all.ipk","free":false,"images":[{"thumbnail":"7069\/images\/1\/L\/babbitt1.png","screenshot":"7069\/images\/1\/L\/babbitt1.png","orientation":"P","device":"P"},{"thumbnail":"7069\/images\/2\/L\/babbitt2.png","screenshot":"7069\/images\/2\/L\/babbitt2.png","orientation":"P","device":"P"}]}