{"publicApplicationId":"com.appible.dawnoharathegirlwholaughedaudio","description":"In this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\nDawn O’Hara, the Girl Who Laughed was Edna Ferber’s first novel. Dawn, a newspaperwoman working in New York, finds herself back home in Michigan on doctor’s orders. Years of living in boarding-houses and working to pay for the care of her brilliant but mentally ill husband, Peter Orme, have taken their toll. At twenty-eight, Dawn feels like an old woman with no future. But, the loving care of her sister Norah and her family along with the attentions of the handsome German doctor, Ernst Von Gerhard, slowly bring Dawn back to life. With Dr. Von Gerhard’s help, she obtains a newspaper job in Milwaukee and begins a year of new adventures among new people. However, the specter of her husband living in a mental hospital is always present and Dawn fears she may never be free to love again. (Summary by Lee Ann Howlett)\n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.0","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"280670","installSize":"280670","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.2","currency":"USD","filename":"com.appible.dawnoharathegirlwholaughedaudio_1.0.0_all.ipk","free":false,"images":[{"thumbnail":"7071\/images\/1\/L\/dawnoharathegirlwholaughed1.png","screenshot":"7071\/images\/1\/L\/dawnoharathegirlwholaughed1.png","orientation":"P","device":"P"},{"thumbnail":"7071\/images\/2\/L\/dawnoharathegirlwholaughed2.png","screenshot":"7071\/images\/2\/L\/dawnoharathegirlwholaughed2.png","orientation":"P","device":"P"}]}