{"publicApplicationId":"com.appible.kidnappedaudiotext","description":"This Plus version of Kidnapped includes both audio and text so you can follow along or read without the audio.\n\nIn this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\nDavid Balfour, a lad of seventeen and newly orphaned, is directed to go and live with his rich uncle, the master of the estate of Shaws in the lowlands of Scotland near Edinburgh. His uncle, Ebenezer, is shocked to suddenly have his young relative descend on him and tries to rid himself of David with an arranged accident. Failing that, he pays the captain of a brig to kidnap David and sell him into slavery in Carolina.\n\nA collision in the fog brings onboard the brig a survivor, Alan Breck Stewart, who is carrying a dangerous amount of gold on his person. David warns him of a plan by the brig’s captain and crew to overpower him and seize the money, and then finds himself fighting alongside Alan in a battle royale. By good fortune, Alan is handy with a sword and they have access to the firearms locker, and the pair so completely defeat the crew that barely enough hands remain to sail her. Limping to port, she is holed by rocks, and David finds himself a castaway.\n\nBeing in Alan’s presence continues to be a chancy business. (Excerpt of a summary by Mark F. Smith)\n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.0","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"301204","installSize":"301204","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.8","currency":"USD","filename":"com.appible.kidnappedaudiotext_1.0.0_all.ipk","free":false,"images":[{"thumbnail":"7086\/images\/1\/L\/kidnapped1.png","screenshot":"7086\/images\/1\/L\/kidnapped1.png","orientation":"P","device":"P"},{"thumbnail":"7086\/images\/2\/L\/kidnapped2.png","screenshot":"7086\/images\/2\/L\/kidnapped2.png","orientation":"P","device":"P"}]}