{"publicApplicationId":"com.appible.littledorritaudiotext","description":"This Plus version of Little Dorrit includes both audio and text so you can follow along or read without the audio.\n\nIn this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\nBorn in the Marshalsea Prison for Debtors, Amy—Little Dorrit—the daughter of the ruined, but self-respectful William Dorrit, has put her entire heart in caring for her dear father, until one day her humble path is crossed by Arthur Clennam. Their meeting proves providential not only for Amy’s life, but for the whole Dorrit family, whose new rise will, in many ways, be also their fall. As in all his novels, in “Little Dorrit” Dickens ushers us into a fascinating and startlingly rich world of human characters and destinies, where virtue and nobility cross swords with vice and villainy, where strength and weakness intertwine with prejudice and magnanimity and where the author’s inspired pen wields a compelling and unforgettable power over the readers. (Summary by Ellis Christoff)\n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.0","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"279446","installSize":"279446","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.8","currency":"USD","filename":"com.appible.littledorritaudiotext_1.0.0_all.ipk","free":false,"images":[{"thumbnail":"7088\/images\/1\/L\/littledorrit1.png","screenshot":"7088\/images\/1\/L\/littledorrit1.png","orientation":"P","device":"P"},{"thumbnail":"7088\/images\/2\/L\/littledorrit2.png","screenshot":"7088\/images\/2\/L\/littledorrit2.png","orientation":"P","device":"P"}]}