{"publicApplicationId":"com.appible.littlemenaudiotext","description":"This Plus version of Little Men includes both audio and text so you can follow along or read without the audio.\n\nIn this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\n    Little Men (published 1871) is considered the second book of the Little Women trilogy written by Louisa May Alcott. (The book Good Wives (1869) was originally the sequel to the novel Little Women (1868), however those two novels are now usually published as a single volume.) The final book of the trilogy is Jo’s Boys (1886).\n\n    Little Men follows the life of Jo Bhaer and the students who live and learn at the Plumfield Estate School that she runs with her husband. The mischievous kids, whom she loves and cares for as her own, learn valuable lessons as they become proper gentlemen and ladies. We also get cameo appearances of almost all the characters found in the previous books, almost all of them happy and well. (Summary from Wikipedia)\n\n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.0","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"278718","installSize":"278718","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.8","currency":"USD","filename":"com.appible.littlemenaudiotext_1.0.0_all.ipk","free":false,"images":[{"thumbnail":"7089\/images\/1\/L\/littlemen1.png","screenshot":"7089\/images\/1\/L\/littlemen1.png","orientation":"P","device":"P"},{"thumbnail":"7089\/images\/2\/L\/littlemen2.png","screenshot":"7089\/images\/2\/L\/littlemen2.png","orientation":"P","device":"P"}]}