{"publicApplicationId":"com.appible.littlewomenaudiotext","description":"This Plus version of Little Women includes both audio and text so you can follow along or read without the audio.\n\nIn this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\n    Little Women is the classic story of the March family, which consists of Mr. and Mrs. March and their four girls–Practical, yet fashion conscious, Meg, who longs for the nice things they used to have. Rambunctious, book worm, Jo, who wants to become a writer and wishes she were born a boy. Shy and quiet, homeloving, Beth, who loves to play the piano and play with her kitties. Finally, the youngest, artistic, Amy, who longs for an aristocratic nose!\n\n    The story takes place during the American Civil War, and begins with Mr. March away from home as a chaplain to the Union army, while his wife and daughters remain at home to work and wait for his safe return. This book follows their joys and sorrows and scrapes along the path to the girl’s becoming grown up “little women”.\n\n    Many of the scrapes they get into include Laurie–their harum scarum next door neighbor, who becomes their adopted brother. The two families, the March’s and the Laurence’s strike up a lasting friendship, despite their differences in material possessions. (Summary by Mary Anderson)\n\n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.0","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"279934","installSize":"279934","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.8","currency":"USD","filename":"com.appible.littlewomenaudiotext_1.0.0_all.ipk","free":false,"images":[{"thumbnail":"7090\/images\/1\/L\/littlewomen1.png","screenshot":"7090\/images\/1\/L\/littlewomen1.png","orientation":"P","device":"P"},{"thumbnail":"7090\/images\/2\/L\/littlewomen2.png","screenshot":"7090\/images\/2\/L\/littlewomen2.png","orientation":"P","device":"P"}]}