{"publicApplicationId":"com.appible.loveconquersallaudiotext","description":"This Plus version of Love Conquers All includes both audio and text so you can follow along or read without the audio.\n\nIn this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\n    Robert Benchley, 1889-1945, was a writer, humorist and actor of note during the 1920s through the early 1940s. Born in Massachusetts, he spent his early literary career in New York City as an editor, critic and columnist for many of the major magazines of the day.\n\n    Along with George Kaufman, Dorothy Parker and Harpo Marx, he was an original “member” of the Algonquin Round Table. His popularity led him to a side career in radio and film, which took him to California in his later years. Writers as diverse as James Thurber, Woody Allen and Dave Barry have credited Benchley as an influence.\n\n    Love Conquers All, originally published in 1922 is the second collection (of fifteen) gathering together Benchley’s humorous essays and reviews. Some references are dated, of course, but the surreal and mundane targets of Benchley’s wit will be familiar to everyone. This volume collects 63 excellent gems from his early professional work, when Benchley’s enthusiasm and style were approaching their peak.\n    (Summary by Ted Delorme)\n\n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.0","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"280056","installSize":"280056","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.8","currency":"USD","filename":"com.appible.loveconquersallaudiotext_1.0.0_all.ipk","free":false,"images":[{"thumbnail":"7094\/images\/1\/L\/loveconquersall1.png","screenshot":"7094\/images\/1\/L\/loveconquersall1.png","orientation":"P","device":"P"},{"thumbnail":"7094\/images\/2\/L\/loveconquersall2.png","screenshot":"7094\/images\/2\/L\/loveconquersall2.png","orientation":"P","device":"P"}]}