{"publicApplicationId":"com.appible.sonsandloversaudio","description":"In this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\n    This intimate portrait of a coal-miner’s family fastens on each member in turn: Walter Morel, the collier; Gertrude, his wife; and the children: William, Annie, Arthur, and Paul. When Mrs. Morel begins to be estranged from her husband because of his poor financial sense and his drinking habits, she comes to inhabit the lives of her children – most particularly, her sons. She is determined that they will grow to be something more than men that come home blackened with coal dust every day and roaring with drink every night. As each grows up and moves away, she must release him. But Paul, she holds; they have a bond that defies time and the attractions of young women.\n\n    Lawrence originally intended the book’s title to be “Paul Morel” and it is on this son – and his lovers – that he spends the bulk of his tale. The strong mother can make a success of her son, but if he cannot learn to leave his mother’s apron strings, will he really be a better man than his father? (Summary by Mark Smith) \n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.0","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"277906","installSize":"277906","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.2","currency":"USD","filename":"com.appible.sonsandloversaudio_1.0.0_all.ipk","free":false,"images":[{"thumbnail":"7103\/images\/1\/L\/sonsandlovers1.png","screenshot":"7103\/images\/1\/L\/sonsandlovers1.png","orientation":"P","device":"P"},{"thumbnail":"7103\/images\/2\/L\/sonsandlovers2.png","screenshot":"7103\/images\/2\/L\/sonsandlovers2.png","orientation":"P","device":"P"}]}