{"publicApplicationId":"com.appible.theamericanaudio","description":"In this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\nOne of James’s early novels, The American plunges right in to one of the writer’s most enduring subjects, that of the innocent, or at least inexperienced, American abroad, seeking to come to terms with the social customs and conventions of an old European aristocracy (think of Daisy Miller, Portrait of a Lady, The Wings of the Dove and others). The aptly named Christopher Newman, having made a small fortune from business in California, has come to the Old World for the first time, determined to enlarge his experience by learning all he can of it. In Paris he meets an old acquaintance, Tom Tristram, who (though he himself has little interest in educating himself about Europe) shows him around, and introduces him to the young widow Claire de Cintre, whose family – the aristocratic de Bellegardes – distrust his American brashness and commercialism. Claire, nonetheless, agrees to marry him, thus pulling Newman, rather more deeply than he is prepared for, into a society that closely guards its secrets, and forcing him to face new and quite unexpected questions.\n(Introduction by Nicholas Clifford) \n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.0","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"278768","installSize":"278768","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.2","currency":"USD","filename":"com.appible.theamericanaudio_1.0.0_all.ipk","free":false,"images":[{"thumbnail":"7111\/images\/1\/L\/theamerican1.png","screenshot":"7111\/images\/1\/L\/theamerican1.png","orientation":"P","device":"P"},{"thumbnail":"7111\/images\/2\/L\/theamerican2.png","screenshot":"7111\/images\/2\/L\/theamerican2.png","orientation":"P","device":"P"}]}