{"publicApplicationId":"com.appible.theenchantedcastleaudio","description":"In this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\nThree children, forced to remain at school during the holidays, go in search of adventure. What they find is a magic castle straight out of a fairy tale, complete with an enchanted princess at the center of a maze. Or is it? The castle turns out to be just a country estate, and the princess is only the housekeeper’s niece, playing at dressing up. But the magic ring she shows them proves — to her surprise and horror — to really be magic. Soon they are caught in an adventure where statues come alive, lost lovers are reunited, and wishes can be granted — but always for a price. (Summary by Peter Eastman)\n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.0","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"279614","installSize":"279614","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.2","currency":"USD","filename":"com.appible.theenchantedcastleaudio_1.0.0_all.ipk","free":false,"images":[{"thumbnail":"7119\/images\/1\/L\/theenchantedcastle1.png","screenshot":"7119\/images\/1\/L\/theenchantedcastle1.png","orientation":"P","device":"P"},{"thumbnail":"7119\/images\/2\/L\/theenchantedcastle2.png","screenshot":"7119\/images\/2\/L\/theenchantedcastle2.png","orientation":"P","device":"P"}]}