{"publicApplicationId":"com.appible.themanwholosthimselfaudio","description":"In this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\n    Best known for his literary work The Blue Lagoon, which has been made into film several times over, H. De Vere Stacpoole’s first publication was a book titled The Intended  in 1894. Stacpoole was disappointed at its lack of commercial success, and felt the story was too good to let go. He eventually re-worked the book, culminating in The Man Who Lost Himself, a light-hearted story of a luckless American visiting London on yet another of his failed business ventures, when he happens upon a gentleman of status and wealth, who also just happens to be his exact look-alike. (Summary by Roger Melin)\n\n\n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.0","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"279776","installSize":"279776","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.2","currency":"USD","filename":"com.appible.themanwholosthimselfaudio_1.0.0_all.ipk","free":false,"images":[{"thumbnail":"7133\/images\/1\/L\/themanwholosthimself1.png","screenshot":"7133\/images\/1\/L\/themanwholosthimself1.png","orientation":"P","device":"P"},{"thumbnail":"7133\/images\/2\/L\/themanwholosthimself2.png","screenshot":"7133\/images\/2\/L\/themanwholosthimself2.png","orientation":"P","device":"P"}]}