{"publicApplicationId":"com.appible.alittleprincessaudio","description":"In this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\nThe novel tells of the troubles of a wealthy young girl, Sara Crewe, who is sent to an oppressive London boarding school during her father’s campaign in India. Thanks to Capt. Crewe’s money, Sara is treated as a little princess until, one day, word comes of her father’s tragic death. Miss Minchin, the school’s greedy headmistress, wastes no time in putting the now-penniless Sara to work for her room and board. It is only through the friendship of two other girls, her own resolute nature, and some astonishing luck that Sara eventually finds her way back to happiness. (Summary from wikipedia.org)\n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.0","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"279424","installSize":"279424","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.2","currency":"USD","filename":"com.appible.alittleprincessaudio_1.0.0_all.ipk","free":false,"images":[{"thumbnail":"7149\/images\/1\/L\/alittleprincess1.png","screenshot":"7149\/images\/1\/L\/alittleprincess1.png","orientation":"P","device":"P"},{"thumbnail":"7149\/images\/2\/L\/alittleprincess2.png","screenshot":"7149\/images\/2\/L\/alittleprincess2.png","orientation":"P","device":"P"}]}