{"publicApplicationId":"com.appible.commonsenseaudiotext","description":"This Plus version of Common Sense includes both audio and text so you can follow along or read without the audio.\n\nIn this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\nCommon Sense, Paine’s pro-independence monograph published anonymously on 10 January 1776, spread quickly among literate colonists. Within three months, 120,000 copies are alleged to have been distributed throughout the colonies, which themselves totaled only four million free inhabitants, making it the best-selling work in 18th-century America. Its total sales in both America and Europe reached 500,000 copies. It convinced many colonists, including George Washington and John Adams, to seek redress in political independence from the Kingdom of Great Britain, and argued strongly against any compromise short of independence. (Summary from Wikipedia)\n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.0","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"280424","installSize":"280424","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.8","currency":"USD","filename":"com.appible.commonsenseaudiotext_1.0.0_all.ipk","free":false,"images":[{"thumbnail":"7157\/images\/1\/L\/commonsense1.png","screenshot":"7157\/images\/1\/L\/commonsense1.png","orientation":"P","device":"P"},{"thumbnail":"7157\/images\/2\/L\/commonsense2.png","screenshot":"7157\/images\/2\/L\/commonsense2.png","orientation":"P","device":"P"}]}