{"publicApplicationId":"com.appible.fathersandsonsaudio","description":"In this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\nFathers and Sons might be regarded as the first wholly modern novel in Russian Literature (Gogol’s Dead Souls, another main contender, is sometimes referred to as a poem or epic in prose as in the style of Dante’s Divine Comedy). The novel introduces a dual character study, as seen with the gradual breakdown of Bazarov’s and Arkady’s nihilistic opposition to emotional display, especially in the case of Bazarov’s love for Madame Odintsova and Fenichka. This prominent theme of character duality and deep psychological insight would exert an influence on most of the great Russian novels to come, most obviously echoed in the novels of Tolstoy and Dostoevsky.\n\nThe novel is also the first Russian work to gain prominence in the Western world, eventually gaining the approval of well established novelists Gustave Flaubert, Guy de Maupassant, and Henry James, proving that Russian literature owes much to Ivan Turgenev.\n\n(Summary from Wikipedia)\n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.0","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"279050","installSize":"279050","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.2","currency":"USD","filename":"com.appible.fathersandsonsaudio_1.0.0_all.ipk","free":false,"images":[{"thumbnail":"7169\/images\/1\/L\/fathersandsons1.png","screenshot":"7169\/images\/1\/L\/fathersandsons1.png","orientation":"P","device":"P"},{"thumbnail":"7169\/images\/2\/L\/fathersandsons2.png","screenshot":"7169\/images\/2\/L\/fathersandsons2.png","orientation":"P","device":"P"}]}