{"publicApplicationId":"com.appible.heartofdarknessaudio","description":"In this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\n    Set in a time of oppressive colonisation, when large areas of the world were still unknown to Europe, and Africa was literally on maps and minds as a mysterious shadow, Heart of Darkness famously explores the rituals of civilisation and barbarism, and the frighteningly fine line between them.\n\n    We get the tale through a classic unreliable narrator, relating as Marlow, a ship’s captain, tells how he was sent by the Company to retrieve the wayward Kurtz, and was shaken to discover the true depths of darkness in that creature’s, and in his own, soul. Conrad based the work closely on his own terrible experience in the Congo.\n\n    This work has been reinterpreted and adapted into many modern forms, the most well known being the film Apocalypse Now.\n    (Summary written by Marlo Dianne) \n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.0","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"298594","installSize":"298594","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.2","currency":"USD","filename":"com.appible.heartofdarknessaudio_1.0.0_all.ipk","free":false,"images":[{"thumbnail":"7172\/images\/1\/L\/heartofdarkness1.png","screenshot":"7172\/images\/1\/L\/heartofdarkness1.png","orientation":"P","device":"P"},{"thumbnail":"7172\/images\/2\/L\/heartofdarkness2.png","screenshot":"7172\/images\/2\/L\/heartofdarkness2.png","orientation":"P","device":"P"}]}