{"publicApplicationId":"com.appible.peterpanaudio","description":"In this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\n    In both the play and the novel, Peter often visits the “real world” of London to listen in on bedtime stories told by Mary Darling to her children. One night, Peter is spotted, and while trying to escape, he loses his shadow. On returning to claim his shadow, he wakes Mary’s daughter, Wendy Darling. When Wendy succeeds in re-attaching his shadow to him, Peter takes a fancy to her and invites her to Neverland to be a mother to his gang of Lost Boys, the children who are lost in Kensington Gardens. Wendy agrees, and her brothers John and Michael go along. The dangerous and magical flight to Neverland is followed by many adventures. The children are blown out of air by a cannon and Wendy is nearly killed. Peter and the Lost Boys build a little house for Wendy to live in while she recuperates. Soon John and Michael adopt the ways of the Lost Boys, while Wendy plays house in mothering them, all the while invoking the jealousy of Tinker Bell, Tiger Lily, and the mermaids. Peter is often oblivious, concentrating on real and make-believe adventures and on taunting the pirate Captain Hook. Later follows adventures at Mermaids’ Lagoon, the near deaths of Tinker Bell and Peter; a violent pirate\/Indian massacre, and a climactic confrontation with Peter’s nemesis, the pirate Captain Hook of the pirate ship the Jolly Roger.\n\n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.0","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"279836","installSize":"279836","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.2","currency":"USD","filename":"com.appible.peterpanaudio_1.0.0_all.ipk","free":false,"images":[{"thumbnail":"7186\/images\/1\/L\/peterpan1.png","screenshot":"7186\/images\/1\/L\/peterpan1.png","orientation":"P","device":"P"},{"thumbnail":"7186\/images\/2\/L\/peterpan2.png","screenshot":"7186\/images\/2\/L\/peterpan2.png","orientation":"P","device":"P"}]}