{"publicApplicationId":"com.appible.tarzanoftheapesaudio","description":"In this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\nTarzan of the Apes is Burroughs’ exciting, if improbable, story of an English lord, left by the death of his stranded parents in the hands of a motherly African ape who raises him as her own. Although he is aware that he is different from the apes of his tribe, who are neither white nor hairless, he nevertheless regards them as his “people.” When older, larger, stronger apes decide that he an undesirable to be killed or expelled from the tribe, it is fortunate that Tarzan has learned the use of primitive weapons.\n\nAlthough small and weak by ape standards, Tarzan is a human of god-like strength and agility to men who discover him. By studying these people, he gradually decides he is not an ape at all, but human.\n\nAnd when he meets Jane, a beautiful American girl marooned with her father and friends on the hostile coast of Africa, Tarzan conceives love for her. When they are unexpectedly rescued before Tarzan can find a way to reveal his feelings to Jane, he determines to become civilized and follow her into the world of people – to find her and wed her, though he must cross continents and oceans, and compete with two other suitors for her hand.\n\n(Summary by Mark F. Smith)\n\n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.0","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"299790","installSize":"299790","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.2","currency":"USD","filename":"com.appible.tarzanoftheapesaudio_1.0.0_all.ipk","free":false,"images":[{"thumbnail":"7188\/images\/1\/L\/tarzanoftheapes1.png","screenshot":"7188\/images\/1\/L\/tarzanoftheapes1.png","orientation":"P","device":"P"},{"thumbnail":"7188\/images\/2\/L\/tarzanoftheapes2.png","screenshot":"7188\/images\/2\/L\/tarzanoftheapes2.png","orientation":"P","device":"P"}]}