{"publicApplicationId":"com.appible.theadventuresofhuckleberryfinnaudio","description":"In this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\nIn The Adventures of Huckleberry Finn, Mark Twain creates an entertaining adventure of Middle America in the 1800’s – afloat on a raft on the Mississippi River. Huck escapes his civilized life when he arranges his own “murder” and turns back into the backwoods, downriver yokel he started as, and in the process springing a slave, Jim, from bondage.\n\nHuck and Jim experience life as a series of tableaus as the river sweeps them through small towns on their way South. At each stop, Huck engages his talent for mixing fact with bald-faced lies to endlessly get himself out of situations… and of course, putting him into others!\n\nHuck and Jim have run-ins with desperados and family feuds and even manage to get run down by a steamboat. The adventures ratchet up when they are joined on the raft by a self-proclaimed “duke” and a “king” [...] who spend their time in figuring how to fleece the public in the little river towns. And when Jim is captured and threatened with being sent back into slavery, Huck enlists his old buddy Tom Sawyer in a frenzied, desperate, and terribly funny rescue.\n\nI had to clip a lot of laughing from this recording at Twain’s sly, catch-’em-when-they’re-not-looking humor, but you can feel free to enjoy some good belly laughs at this crew of lovable rapscallions! (Summary by Mark F. Smith)\n\n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.0","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"301570","installSize":"301570","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.2","currency":"USD","filename":"com.appible.theadventuresofhuckleberryfinnaudio_1.0.0_all.ipk","free":false,"images":[{"thumbnail":"7190\/images\/1\/L\/theadventuresofhuckleberryfinn1.png","screenshot":"7190\/images\/1\/L\/theadventuresofhuckleberryfinn1.png","orientation":"P","device":"P"},{"thumbnail":"7190\/images\/2\/L\/theadventuresofhuckleberryfinn2.png","screenshot":"7190\/images\/2\/L\/theadventuresofhuckleberryfinn2.png","orientation":"P","device":"P"}]}