{"publicApplicationId":"com.appible.theadventuresofsherlockholmesaudio","description":"In this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\nA collection of twelve short stories featuring Conan Doyle's legendary detective, originally published as single stories in Strand Magazine and subsequently collected into a single volume.\n\nThere is not always a crime committed nor a culprit to find, and when there is, Holmes does not invariably get his man. However, his extraordinary powers of deduction generally solve the mystery, often to the discomfiture of the official police force. Holmes is a man of many facets, and I do not share the common perception of Holmes as cold and humourless: his sense of fun can be sparkling, and there are moments of rare pathos. (Summary by Ruth Golding) \n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.0","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"289572","installSize":"289572","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.2","currency":"USD","filename":"com.appible.theadventuresofsherlockholmesaudio_1.0.0_all.ipk","free":false,"images":[{"thumbnail":"7191\/images\/1\/L\/theadventuresofsherlockholmes1.png","screenshot":"7191\/images\/1\/L\/theadventuresofsherlockholmes1.png","orientation":"P","device":"P"},{"thumbnail":"7191\/images\/2\/L\/theadventuresofsherlockholmes2.png","screenshot":"7191\/images\/2\/L\/theadventuresofsherlockholmes2.png","orientation":"P","device":"P"}]}