{"publicApplicationId":"com.appible.theblockaderunnersaudio","description":"In this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\nWriting at the end of the American Civil War, Verne weaves this story of a Scottish merchant who, in desperation at the interruption of the flow of Southern cotton due to the Union blockade, determines to build his own fast ship and run guns to the Confederates in exchange for the cotton piling up unsold on their wharves. His simple plan becomes complicated by two passengers who board his new ship under false pretenses in order to carry out a rescue mission, one which Capt. Playfair adopts as his own cause. This is going make the Rebels in Charleston rather unhappy with him.\n\nSure, his new ship is fast - but can it escape the cannonballs of both North and South? (Summary by Mark Smith) \n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.0","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"300328","installSize":"300328","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.2","currency":"USD","filename":"com.appible.theblockaderunnersaudio_1.0.0_all.ipk","free":false,"images":[{"thumbnail":"7195\/images\/1\/L\/theblockaderunners1.png","screenshot":"7195\/images\/1\/L\/theblockaderunners1.png","orientation":"P","device":"P"},{"thumbnail":"7195\/images\/2\/L\/theblockaderunners2.png","screenshot":"7195\/images\/2\/L\/theblockaderunners2.png","orientation":"P","device":"P"}]}