{"publicApplicationId":"com.appible.thebookofthenationalparksaudio","description":"In this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\n\n\nIn the preface to this book, published in 1919, he writes, \"In offering the American public a carefully studied outline of its national park system, I have two principal objects. The one is to describe and differentiate the national parks in a manner which will enable the reader to appreciate their importance, scope, meaning, beauty, manifold uses and enormous value to individual and nation. The other is to use these parks, in which Nature is writing in large plain lines the story of America's making, as examples illustrating the several kinds of scenery, and what each kind means in terms of world building; in other words, to translate the practical findings of science into unscientific phrase for the reader's increased profit and pleasure, not only in his national parks but in all other scenic places great and small.\" (summary from wikipedia)  \n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.0","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"280350","installSize":"280350","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.2","currency":"USD","filename":"com.appible.thebookofthenationalparksaudio_1.0.0_all.ipk","free":false,"images":[{"thumbnail":"7197\/images\/1\/L\/thebookofthenationalparks1.png","screenshot":"7197\/images\/1\/L\/thebookofthenationalparks1.png","orientation":"P","device":"P"},{"thumbnail":"7197\/images\/2\/L\/thebookofthenationalparks2.png","screenshot":"7197\/images\/2\/L\/thebookofthenationalparks2.png","orientation":"P","device":"P"}]}