{"publicApplicationId":"com.appible.theearlyhistoryoftheairplaneaudio","description":"In this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\nThe Brothers Orville (1871 - 1948) and Wilbur (1867 – 1912) Wright made the first controlled, powered and sustained heavier-than-air flight, on 17th December 1903. They were not the first to build and fly aircraft, but they invented the controls that were necessary for a pilot to steer the aircraft, which made fixed wing powered flight possible. The Early History of the Airplane consists of three short essays about the beginnings of human flight. The second essay retells the first flight: \"This flight lasted only 12 seconds, but it was nevertheless the first in the history of the world in which a machine carrying a man had raised itself by its own power into the air in full flight, had sailed forward without reduction of speed and had finally landed at a point as high as that from which it started.\" (Introduction by Availle) \n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.0","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"281484","installSize":"281484","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.2","currency":"USD","filename":"com.appible.theearlyhistoryoftheairplaneaudio_1.0.0_all.ipk","free":false,"images":[{"thumbnail":"7200\/images\/1\/L\/theearlyhistoryoftheairplane1.png","screenshot":"7200\/images\/1\/L\/theearlyhistoryoftheairplane1.png","orientation":"P","device":"P"},{"thumbnail":"7200\/images\/2\/L\/theearlyhistoryoftheairplane2.png","screenshot":"7200\/images\/2\/L\/theearlyhistoryoftheairplane2.png","orientation":"P","device":"P"}]}