{"publicApplicationId":"com.hiddenworldhut.adamcarollanetwork","description":"****UPDATE: adds The Film Vault: Our own Bryan Bishop and Anderson Cowen discuss films of all types new and old!****  The Adam Carolla Network for webOS lets you listen to the ACE Network for free from anywhere!  Shows include:  ****The Adam Carolla Podcast: presented by Adam Carolla. Recorded 5 days a week with celebrity guests including: Dr. Drew, Bobby Slaton, Andy Dick, Joel McHale, Seth McFarland, Seth Green, Mike Tyson, and more! Topics are all over the place and there is something for everyone to love.  ****Carcast: presented by Adam Carolla and Sandy Ganz. A weekly show devoted to cars, motor shows, and all things automotive! Includes tips and tricks with those old cars, what is up and coming, and sneak peaks and the newest and hottest stuff on the market.  ****Daves of Thunder: Dave Dameshek and Dave Feeney wax on about all sorts of hooey and applesauce!  ****Sports with Spider and the Henchman: presented by John Salley and Kevin Hench. Your no holds barred weekly source for all the sports news! No censorship, no lawyers.  ****The Parent Experiment: presented by Teressa Strasser and Lynette Carolla, laugh along with the horror stories of parenting gone wrong, whats gone right, and how to work hard not to mess up your kids!   ****Classic Loveline Episodes: listen to archive loveline eppisodes streaming from the internet! Thousands of hours of content!  ****Easily listen to the ACE network from anywhere! This application has feeds for the podcast, the Carcast, the SportsCast all the shows twitter accounts, the unofficial messageboard, a list of links, and an easy way to call into the show.","version":"1.2.0","versionNote":"","homeURL":"http:\/\/www.hiddenworldhut.com","supportURL":"http:\/\/www.hiddenworldhut.com","custsupportemail":"feedback@hiddenworldhut.com","custsupportphonenum":"..","copyright":"Copyright 2010 Hidden World Hut","licenseURL":"","locale":"en_US","appSize":1055088,"installSize":6256417,"isEncrypted":false,"adultRating":false,"islocationbased":false,"lastModifiedTime":"2010-04-27T05:42:22.000+0000","mediaLink":null,"mediaIcon":null,"attributes":{"provides":{"noApp":false,"dockMode":false,"universalSearch":false,"connectors":[],"services":[],"optimizedUserExperience":false}},"price":0,"currency":"USD","isAdvertized":false,"filename":"com.hiddenworldhut.adamcarollanetwork_1.2.0_all.ipk","free":false,"touchpad_exclusive":false,"images":{"1":{"thumbnail":"721\/en\/images\/1\/S\/7.png","screenshot":"721\/en\/images\/1\/L\/7.png","orientation":"P","device":"P"},"2":{"thumbnail":"721\/en\/images\/2\/S\/1.png","screenshot":"721\/en\/images\/2\/L\/1.png","orientation":"P","device":"P"},"3":{"thumbnail":"721\/en\/images\/3\/S\/4.png","screenshot":"721\/en\/images\/3\/L\/4.png","orientation":"P","device":"P"}}}