{"publicApplicationId":"com.appible.thelamplighteraudio","description":"In this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\n    Gertrude began life as an abused child in the care of Nan Grant, a cold and cruel woman. The only human character who was kind to her was the lamplighter, Truman Flint. When Nan, in one of her tantrums, threw Gertrude away from her house, he took her into his care. A few unforgettable people taught Gertrude everything that a young lady has to know. Almost everybody loves and admires Gertrude. But the one she loved best is Willie Sullivan. Will this love stay strong even after 6 years of separation? And will Gertrude, so admired and loved as she is, be happy - once in her life - for herself and not for others? (Summary by Stav Nisser)\n\n\n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.0","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"279720","installSize":"279720","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.2","currency":"USD","filename":"com.appible.thelamplighteraudio_1.0.0_all.ipk","free":false,"images":[{"thumbnail":"7212\/images\/1\/L\/thelamplighter1.png","screenshot":"7212\/images\/1\/L\/thelamplighter1.png","orientation":"P","device":"P"},{"thumbnail":"7212\/images\/2\/L\/thelamplighter2.png","screenshot":"7212\/images\/2\/L\/thelamplighter2.png","orientation":"P","device":"P"}]}