{"publicApplicationId":"com.appible.themachinestopsaudio","description":"In this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\n    The Machine Stops is a short science fiction story. It describes a world in which almost all humans have lost the ability to live on the surface of the Earth. Each individual lives in isolation in a ‘cell’, with all bodily and spiritual needs met by the omnipotent, global Machine. Most humans welcome this development, as they are skeptical and fearful of first-hand experience. People forget that humans created the Machine, and treat it as a mystical entity whose needs supersede their own. Those who do not accept the deity of the Machine are viewed as ‘unmechanical’ and are threatened with “Homelessness”. Eventually, the Machine apocalyptically collapses, and the civilization of the Machine comes to an end. (Wikipedia)\n\n    Comment by book coordinator:\n    A condensed rapidfire of details and ideas imagining a dystopian world. Good thing he made it a short story. And the world he describes feels so appalling, although we are good on the way to be where Forster imagined us – shocker. So imaginative for 1909! Staying at home with the telly and internet and instant messaging and videoconferencing, google and pizza delivery and all flats and all cities look alike. And the loss of Patience! Damn this is good and so true – with one big exception the many buttons for all the machines functions. But how would Forster know of digital interfaces? That would have been too much to foresee. \n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.0","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"296048","installSize":"296048","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.2","currency":"USD","filename":"com.appible.themachinestopsaudio_1.0.0_all.ipk","free":false,"images":[{"thumbnail":"7216\/images\/1\/L\/themachinestops1.png","screenshot":"7216\/images\/1\/L\/themachinestops1.png","orientation":"P","device":"P"},{"thumbnail":"7216\/images\/2\/L\/themachinestops2.png","screenshot":"7216\/images\/2\/L\/themachinestops2.png","orientation":"P","device":"P"}]}