{"publicApplicationId":"com.appible.themysteryofedwindroodaudiotext","description":"This Plus version of The Mystery of Edwin Drood includes both audio and text so you can follow along or read without the audio.\n\nIn this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\nThe Mystery of Edwin Drood is the final novel by Charles Dickens. It is a mystery indeed; the serial novel was just half completed at the time of Dickens’ death – leading to much speculation how it might have ended.\nThe novel is named after Edwin Drood, one of the characters, but it mostly tells the story of his uncle, a choirmaster named John Jasper, who is in love with his pupil, Rosa Bud. Miss Bud is Drood’s fiancée, and has also caught the eye of the high-spirited and hot-tempered Neville Landless! Landless comes from Ceylon with his twin sister, Helena. Neville Landless and Edwin Drood take a dislike to one another the moment they meet.\nThe story is set in Cloisterham, a lightly fictionalised Rochester (in Kent, England). Rochester is close to Dicken’s country house Gad’s Hill Place, where the final chapter was written and where Dickens died.\nAdapted by Alan Chant from the Edwin Drood entry in Wikipedia.\n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.0","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"288518","installSize":"288518","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.8","currency":"USD","filename":"com.appible.themysteryofedwindroodaudiotext_1.0.0_all.ipk","free":false,"images":[{"thumbnail":"7220\/images\/1\/L\/themysteryofedwindrood1.png","screenshot":"7220\/images\/1\/L\/themysteryofedwindrood1.png","orientation":"P","device":"P"},{"thumbnail":"7220\/images\/2\/L\/themysteryofedwindrood2.png","screenshot":"7220\/images\/2\/L\/themysteryofedwindrood2.png","orientation":"P","device":"P"}]}