{"publicApplicationId":"com.appible.thepeopleoftheabyssaudio","description":"In this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\nJack London lived for a time within the grim and grimy world of the East End of London, where half a million people scraped together hardly enough on which to survive. Even if they were able to work, they were paid only enough to allow them a pitiful existence. He grew to know and empathise with these forgotten (or ignored) people as he spoke with them and tasted the workhouse, life on the streets, … and the food, which was cheap, barely nutritious, and foul.\n\nHe writes about his experiences in a fluid and narrative style, making it very clear what he thinks of the social structures which created the Abyss, and of the millionaires who live high on the labours of a people forced to live in squalor. “… The food this managing class eats, the wine it drinks, … the fine clothes it wears, are challenged by eight million mouths which have never had enough to fill them, and by twice eight million bodies which have never been sufficiently clothed and housed.”\n\n(Summary by Peter Yearsley)\n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.0","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"277716","installSize":"277716","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.2","currency":"USD","filename":"com.appible.thepeopleoftheabyssaudio_1.0.0_all.ipk","free":false,"images":[{"thumbnail":"7223\/images\/1\/L\/thepeopleoftheabyss1.png","screenshot":"7223\/images\/1\/L\/thepeopleoftheabyss1.png","orientation":"P","device":"P"},{"thumbnail":"7223\/images\/2\/L\/thepeopleoftheabyss2.png","screenshot":"7223\/images\/2\/L\/thepeopleoftheabyss2.png","orientation":"P","device":"P"}]}