{"publicApplicationId":"com.appible.thepointofhonoraudio","description":"In this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\n    Set during the Napoleonic Wars, “The Point of Honor” (English title: “The Duel”) features two French Hussar officers, D’Hubert and Feraud. Their quarrel over an initially minor incident turns into a bitter, long-drawn out struggle over the following fifteen years, interwoven with the larger conflict that provides its backdrop. At the beginning, Feraud is the one who jealously guards his honor and repeatedly demands satisfaction anew when a duelling encounter ends inconclusively; he aggressively pursues every opportunity to locate and duel his foe. As the story progresses, D’Hubert also finds himself caught up in the contest, unable to back down or walk away.\n\n    This Conrad short story evidently has its genesis in the real duels that two French Hussar officers fought in the Napoleonic era. Their names were Dupont and Fournier, which Conrad disguised slightly, changing Dupont into D’Hubert and Fournier into Feraud. In 1977, it was turned into a movie, “The Duellists”, starring Keith Carradine and Harvey Keitel. (summary adapted from Wikipedia)\n\n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.0","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"277368","installSize":"277368","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.2","currency":"USD","filename":"com.appible.thepointofhonoraudio_1.0.0_all.ipk","free":false,"images":[{"thumbnail":"7226\/images\/1\/L\/thepointofhonor1.png","screenshot":"7226\/images\/1\/L\/thepointofhonor1.png","orientation":"P","device":"P"},{"thumbnail":"7226\/images\/2\/L\/thepointofhonor2.png","screenshot":"7226\/images\/2\/L\/thepointofhonor2.png","orientation":"P","device":"P"}]}