{"publicApplicationId":"com.appible.benhurataleofthechristaudio","description":"In this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\nBen-Hur is a story of two very different heroes. Judah Ben-Hur, a prince of Jerusalem, is involved in an accident to the Roman procurator which is taken to be intentional. He is seized and sent to the fleet as a galley-slave, while his family is imprisoned and the family goods confiscated. When Ben-Hur saves the fleet captain from drowning after his ship is sunk in a fight with pirates, that officer adopts him as son and heir. With Roman training, Ben-Hur distinguishes himself in the arena and the palistrae and appears to be on the way to high military command.\n\nBen-Hur turns his attention to the prophesied King of the Jews, when through the sheik he meets Balthasar, one of the Three Wise Men, and hears of the child born years ago. Will Ben-Hur be the general who brings victories to the King, and finally liberates Israel from the oppressive Roman yoke? In his quest for the answer, Ben-Hur seeks out the Nazarene, now rumored to be The Messiah.\n\nTHAT hero needs no introduction.\n\nCurious about the lack of kingly trappings and ambitions about this man, Ben-Hur begins to suspect that his kingdom is not of this world. And with him, we receive a gut-wrenching eye-witness view of Jesus’ arrest, humiliation, and crucifixion. \n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.0","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"280838","installSize":"280838","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.2","currency":"USD","filename":"com.appible.benhurataleofthechristaudio_1.0.0_all.ipk","free":false,"images":[{"thumbnail":"7241\/images\/1\/L\/benhurataleofthechrist1.png","screenshot":"7241\/images\/1\/L\/benhurataleofthechrist1.png","orientation":"P","device":"P"},{"thumbnail":"7241\/images\/2\/L\/benhurataleofthechrist2.png","screenshot":"7241\/images\/2\/L\/benhurataleofthechrist2.png","orientation":"P","device":"P"}]}