{"publicApplicationId":"com.appible.evelinaaudio","description":"In this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\n    In this epistolary novel, we find a young woman named Evelina, who was raised in rural seclusion until her eighteenth year because of her uncertain parentage. Through a series of harrowing and humorous events that take place in London and an English resort town, Evelina learns how to navigate the complex layers of 18th century society and earn the love of a distinguished and honorable nobleman. This comedy of manners often satirizes the society in which it is set; Evelina is a significant precursor to later works by Jane Austen and Maria Edgeworth, whose novels explore many of the same issues. (from Evelina’s wikipedia entry, modified by ettelocin)\n\n\n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.0","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"285788","installSize":"285788","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.2","currency":"USD","filename":"com.appible.evelinaaudio_1.0.0_all.ipk","free":false,"images":[{"thumbnail":"7249\/images\/1\/L\/evelina1.png","screenshot":"7249\/images\/1\/L\/evelina1.png","orientation":"P","device":"P"},{"thumbnail":"7249\/images\/2\/L\/evelina2.png","screenshot":"7249\/images\/2\/L\/evelina2.png","orientation":"P","device":"P"}]}