{"publicApplicationId":"com.appible.thegreatshadowaudiotext","description":"This Plus version of The Great Shadow includes both audio and text so you can follow along or read without the audio.\n\nIn this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\nSet in an English-Scottish border village during the waning days of the Napoleonic era, this adventure story introduces us to Jock Calder, whose quiet way of life is shattered when a mysterious stranger steps ashore near his home. The stranger changes forever the lives of Jock, his cousin Edie, and his best friend Jim, sending the young men into the jaws of the final battle to defeat The Great Shadow that threatens to devour the whole of Europe. Don't look for Sherlock Holmes in this well-written tale, but do expect a wonderful glimpse of life at the end of the Napoleonic era, including an exciting rendition of The Battle of Waterloo. (Introduction by Christine Dufour) \n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.0","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"301432","installSize":"301432","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.8","currency":"USD","filename":"com.appible.thegreatshadowaudiotext_1.0.0_all.ipk","free":false,"images":[{"thumbnail":"7280\/images\/1\/L\/thegreatshadow1.png","screenshot":"7280\/images\/1\/L\/thegreatshadow1.png","orientation":"P","device":"P"},{"thumbnail":"7280\/images\/2\/L\/thegreatshadow2.png","screenshot":"7280\/images\/2\/L\/thegreatshadow2.png","orientation":"P","device":"P"}]}