{"publicApplicationId":"com.appible.theharboraudio","description":"In this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\n The Harbor  is a fictional account of life on a Brooklyn waterfront through the eyes of Billy as he is growing up. The novel starts with Billy the child, living on the harbor with his father, mother, and sister, Sue. During this time he also meets Eleanor who, at that time, he considers to be strange but later becomes an important character in the novel. His father owns a shipping business, is hard-working, and can think of little else. As a young man, Billy begins to detest the harbor and longs for escape to pursue his lifelong dream of becoming a writer and avoiding his father’s business. With his mother’s blessing, he takes flight to Paris to hone his trade. While in Paris, he meets Joe Kramer (J.K.) and a sometimes stormy relationship begins. J.K. forces him to confront human situations that Billy would prefer not to. Billy eventually returns to the harbor after some years and recognizes changes are taking place in the harbor, and in his life. The harbor becomes a subject for his writing and his personal relationships. Throughout the novel, J.K. continues to make appearances in Billy’s life, challenging him to write about things as they really are and not as Billy’s world of comfort shows them to be. Billy’s life is changed when the harbor goes on strike and he becomes involved in the labor movement. (Summary by Tom Weiss(Partial) \n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.0","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"278878","installSize":"278878","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.2","currency":"USD","filename":"com.appible.theharboraudio_1.0.0_all.ipk","free":false,"images":[{"thumbnail":"7282\/images\/1\/L\/theharbor1.png","screenshot":"7282\/images\/1\/L\/theharbor1.png","orientation":"P","device":"P"},{"thumbnail":"7282\/images\/2\/L\/theharbor2.png","screenshot":"7282\/images\/2\/L\/theharbor2.png","orientation":"P","device":"P"}]}