{"publicApplicationId":"com.appible.themanintheironmaskaudiotext","description":"This Plus version of The Man in the Iron Mask includes both audio and text so you can follow along or read without the audio.\n\nIn this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\nIn this, the last of the Three Musketeers novels, Dumas builds on the true story of a mysterious prisoner held incognito in the French penal system, forced to wear a mask when seen by any but his jailer or his valet.  \nOn one side – Aramis, now a bishop and secretly the Captain-General of the Jesuit Order.\n\nOn the other side – King Louis XIV, selected as the twin who would be king by his mother, and who intends that his brother will never challenge him. Monsieur Colbert, first minister, who is jealous of Fouquet and plots his downfall.\n \n\nAramis discovers the hidden Philippe and hatches a plot to substitute him for the sitting king, putting Louis in Philippe’s cell in the Bastille. This even succeeds… for a short while. But Aramis has not reckoned with a man whose loyalty to the throne exceeds his own welfare and who disastrously reverses the plot. Now it is time for the plotters to scurry to cover, there to figure some way to recover their lost ambitions. ((Portion of) (Summary written by Mark Smith.))\n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.0","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"301620","installSize":"301620","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.8","currency":"USD","filename":"com.appible.themanintheironmaskaudiotext_1.0.0_all.ipk","free":false,"images":[{"thumbnail":"7290\/images\/1\/L\/themanintheironmask1.png","screenshot":"7290\/images\/1\/L\/themanintheironmask1.png","orientation":"P","device":"P"},{"thumbnail":"7290\/images\/2\/L\/themanintheironmask2.png","screenshot":"7290\/images\/2\/L\/themanintheironmask2.png","orientation":"P","device":"P"}]}