{"publicApplicationId":"com.appible.barnabyrudgeaudio","description":"In this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\n    A wayside tavern where the local men drink and gossip; an unsolved, twenty year old murder at a nearby mansion; a very talkative black raven; a London locksmith and his family; a man apparently returned from the dead; a hangman who enjoys his job way too much; an anti-Catholic lord; a large and violent mob; and the British Militia—what do all these things have in common? All have, in some way, touched or been touched by the loveable, young, simple-minded “idiot,” Barnaby Rudge.\n\n    Barnaby’s good nature makes him a joy to most who know him Unfortunately, his eagerness to please and his gullibility make him an easy prey for the unscrupulous. Can he emerge unscathed when once he gets tangled up with the wrong crowd?\n\n    Once again, Dickens has managed to temper the horrific with his characteristic wit and humor, as he tells this tale based on the “no-popery” or Gordon riots of 1780.\n\n    (Note: If the bird in this story seems familiar, it may be because he was the inspiration for Edgar Allen Poe’s poem, “The Raven.”) (Summary by Debra Lynn)\n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.0","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"277716","installSize":"277716","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.2","currency":"USD","filename":"com.appible.barnabyrudgeaudio_1.0.0_all.ipk","free":false,"images":[{"thumbnail":"7308\/images\/1\/L\/barnabyrudge1.png","screenshot":"7308\/images\/1\/L\/barnabyrudge1.png","orientation":"P","device":"P"},{"thumbnail":"7308\/images\/2\/L\/barnabyrudge2.png","screenshot":"7308\/images\/2\/L\/barnabyrudge2.png","orientation":"P","device":"P"}]}