{"publicApplicationId":"com.appible.blackbeautyaudio","description":"In this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\n    Black Beauty is a fictional autobiographical memoir told by a horse, who recounts many tales, both of cruelty and kindness. The title page of the first edition states that it was “Translated from the Original Equine by Anna Sewell.” It was composed in the last years of her life, during which she was confined to her house as an invalid. After its publication in 1877, Sewell lived just long enough to see her first and only novel become an immediate bestseller, as well as it encouraging the better treatment of many cruelly-treated animals.\n\n    Although initially intended for people who work with horses, it soon became a children’s classic. While outwardly teaching animal welfare, it also contains allegorical lessons about how to treat people with kindness, sympathy and respect. The story is narrated in the first person and each short chapter relates an incident in Black Beauty’s life, with Sewell’s detailed observations and extensive descriptions of horse behaviour lending the novel a good deal of verisimilitude.\n\n    Summary adapted from Wikipedia by Cori Samuel, with help.\n\n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.0","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"277694","installSize":"277694","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.2","currency":"USD","filename":"com.appible.blackbeautyaudio_1.0.0_all.ipk","free":false,"images":[{"thumbnail":"7310\/images\/1\/L\/blackbeauty1.png","screenshot":"7310\/images\/1\/L\/blackbeauty1.png","orientation":"P","device":"P"},{"thumbnail":"7310\/images\/2\/L\/blackbeauty2.png","screenshot":"7310\/images\/2\/L\/blackbeauty2.png","orientation":"P","device":"P"}]}