{"publicApplicationId":"com.appible.elegiacsonnetsandotherpoemsaudio","description":"In this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\n    Charlotte Turner Smith (1749 – 1806) was an English poet and novelist. She initiated a revival of the English sonnet, helped establish the conventions of Gothic fiction, and wrote political novels of sensibility.\n\n    It was in 1784, in debtor’s prison with her husband Benjamin, that she wrote and published her first work, Elegiac Sonnets. The work achieved instant success, allowing Charlotte to pay for their release from prison. Smith’s sonnets helped initiate a revival of the form and granted an aura of respectability to her later novels.\n\n    Stuart Curran, the editor of Smith’s poems, has written that Smith is “the first poet in England whom in retrospect we would call Romantic”. She helped shape the “patterns of thought and conventions of style” for the period. Romantic poet William Wordsworth was the most affected by her works. He said of Smith in the 1830s that she was “a lady to whom English verse is under greater obligations than are likely to be either acknowledged or remembered”. By the second half of the nineteenth century, however, Smith was largely forgotten. (Summary by David Barnes)\n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.0","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"280798","installSize":"280798","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.2","currency":"USD","filename":"com.appible.elegiacsonnetsandotherpoemsaudio_1.0.0_all.ipk","free":false,"images":[{"thumbnail":"7320\/images\/1\/L\/elegiacsonnetsandotherpoems1.png","screenshot":"7320\/images\/1\/L\/elegiacsonnetsandotherpoems1.png","orientation":"P","device":"P"},{"thumbnail":"7320\/images\/2\/L\/elegiacsonnetsandotherpoems2.png","screenshot":"7320\/images\/2\/L\/elegiacsonnetsandotherpoems2.png","orientation":"P","device":"P"}]}