{"publicApplicationId":"com.appible.jackandjillaudio","description":"In this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\n    Jack and Jill went up a hill\n    To coast with fun and laughter.\n    Jack fell down and broke his crown,\n    And Jill came tumbling after. – Louisa May Alcott\n\n    When Jack and Jill tumble off of their sled on the first good snow of the season, their injuries cause them to be bedridden for many months putting an end to their fun and frolics. Their parents and friends fill their long days with the joys of a theatrical production, their own personal mail system and many other imaginative events to make their convalescence time fly by. Both Jack and Jill learn how to become better friend’s to each other and their other school mates through their many trials. This is sure to become a family favorite! Summary by Mary Anderson \n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.0","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"279492","installSize":"279492","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.2","currency":"USD","filename":"com.appible.jackandjillaudio_1.0.0_all.ipk","free":false,"images":[{"thumbnail":"7328\/images\/1\/L\/jackandjill1.png","screenshot":"7328\/images\/1\/L\/jackandjill1.png","orientation":"P","device":"P"},{"thumbnail":"7328\/images\/2\/L\/jackandjill2.png","screenshot":"7328\/images\/2\/L\/jackandjill2.png","orientation":"P","device":"P"}]}