{"publicApplicationId":"com.appible.nothoroughfareaudio","description":"In this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\n    Two boys from the Foundling Hospital are given the same name, with disastrous consequences in adulthood. Two associates, wishing to right the wrong, are commissioned to find a missing heir. Their quest takes them from fungous wine cellars in the City of London to the sunshine of the Mediterranean — across the Alps in winter. Danger and treachery would prevail were it not for the courage of the heroine and the faithful company servant.\n\n    The story contains crafted descriptions, well-drawn and diverse characters, eerie and exotic backgrounds, mystery, semi-concealed identities, brinkmanship with death, romance, the eventual triumph of Good over Evil, and many other elements expected in classic Dickens.\n\n    First published in 1867 there are thematic parallels with other books from Dickens’ mature writings, including Little Dorrit (1857) and especially Our Mutual Friend (1865). The Listener will decide if this story yields insights into The Mystery of Edwin Drood (unfinished 1870).\n\n    Wilkie Collings collaborated with Charles Dickens to produce this ‘Christmas’ book and the stage play of the same name. In the book Collins assisted in Act 1 and Act 4; Collins scripted most of the stage play with Dickens’ assistance. If this book were released today it would be splashed “THE BOOK OF THE FILM”.\n \n    Summary by Alan Chant.\n\n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.0","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"278984","installSize":"278984","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.2","currency":"USD","filename":"com.appible.nothoroughfareaudio_1.0.0_all.ipk","free":false,"images":[{"thumbnail":"7336\/images\/1\/L\/nothoroughfare1.png","screenshot":"7336\/images\/1\/L\/nothoroughfare1.png","orientation":"P","device":"P"},{"thumbnail":"7336\/images\/2\/L\/nothoroughfare2.png","screenshot":"7336\/images\/2\/L\/nothoroughfare2.png","orientation":"P","device":"P"}]}