{"publicApplicationId":"com.appible.theageofinnocenceaudio","description":"In this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\nIn an era before the advent of electric lights, telephones or motor vehicles, there exists a small cluster of aristocratic “old revolutionary stock” families that rule New York’s social life. Under the rules of this society, “being things” is better than “doing things” and reputation and outward appearances come at the exclusion of everything else. In this Gilded Age, when America’s expansion and increased industrialism produce a group of newly wealthy robber barons and financiers, the patient, time-honored values of the old ruling class, and century, are giving way to the expediencies of the new. Caught at this cusp, a triangle of lovers, who must choose between the expectations of family and society, and the deepest yearnings of the heart.\n\n(Excerpt of a summary by Brenda Dayne) \n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.0","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"280018","installSize":"280018","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.2","currency":"USD","filename":"com.appible.theageofinnocenceaudio_1.0.0_all.ipk","free":false,"images":[{"thumbnail":"7347\/images\/1\/L\/theageofinnocence1.png","screenshot":"7347\/images\/1\/L\/theageofinnocence1.png","orientation":"P","device":"P"},{"thumbnail":"7347\/images\/2\/L\/theageofinnocence2.png","screenshot":"7347\/images\/2\/L\/theageofinnocence2.png","orientation":"P","device":"P"}]}