{"publicApplicationId":"com.appible.theageofreasonaudio","description":"In this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\n    The Age of Reason: Being an Investigation of True and Fabulous Theology, a deistic treatise written by eighteenth-century British radical and American revolutionary Thomas Paine, critiques institutionalized religion and challenges the inerrancy of the Bible. Published in three parts in 1794, 1795, and 1807, it was a bestseller in America, where it caused a short-lived deistic revival. British audiences, however, fearing increased political radicalism as a result of the French revolution, received it with more hostility.\n\n    The Age of Reason presents common deistic arguments. For example, it highlights the corruption of the Christian Church and criticizes its efforts to acquire political power. Paine advocates reason in the place of revelation, leading him to reject miracles and to view the Bible as an ordinary piece of literature rather than as a divinely-inspired text. Yet, The Age of Reason is not atheistic: it promotes natural religion and argues for a creator-God.\n\n    (Summary by Wikipedia)\n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.0","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"278976","installSize":"278976","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.2","currency":"USD","filename":"com.appible.theageofreasonaudio_1.0.0_all.ipk","free":false,"images":[{"thumbnail":"7350\/images\/1\/L\/theageofreason1.png","screenshot":"7350\/images\/1\/L\/theageofreason1.png","orientation":"P","device":"P"},{"thumbnail":"7350\/images\/2\/L\/theageofreason2.png","screenshot":"7350\/images\/2\/L\/theageofreason2.png","orientation":"P","device":"P"}]}