{"publicApplicationId":"com.appible.thechristmasangelaudiotext","description":"This Plus version of The Christmas Angel includes both audio and text so you can follow along or read without the audio.\n\nIn this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\nDisagreeable old Miss Terry spends her Christmas Eve getting rid of toys from her childhood toy box. One by one she tosses them onto the sidewalk in front of her house, then secretly watches the little scenes that occur, which seem to confirm her belief that true Christmas spirit does not exist. Then the Angel from her childhood Christmas tree appears to show Miss Terry that she has not yet witnessed the final act of each of those little dramas...\n\nLiving Age magazine in 1910 observed of The Christmas Angel, \"Not since Charles Dickens laid down his pen forever has there been a prettier Christmas story written, one more full of the real spirit of Christmas or conveying a more seasonable lesson.\" (Summary by Jan MacGillivray)\n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.0","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"281310","installSize":"281310","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.8","currency":"USD","filename":"com.appible.thechristmasangelaudiotext_1.0.0_all.ipk","free":false,"images":[{"thumbnail":"7358\/images\/1\/L\/thechristmasangel1.png","screenshot":"7358\/images\/1\/L\/thechristmasangel1.png","orientation":"P","device":"P"},{"thumbnail":"7358\/images\/2\/L\/thechristmasangel2.png","screenshot":"7358\/images\/2\/L\/thechristmasangel2.png","orientation":"P","device":"P"}]}