{"publicApplicationId":"com.appible.thedangertrailaudiotext","description":"This Plus version of The Danger Trail includes both audio and text so you can follow along or read without the audio.\n\nIn this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\nChicago engineer Jack Howland is sent to the edge of the Canadian barren lands north of Prince Albert to establish a train route through some of the most treacherous terrain in North America. He would soon learn that it was not only the terrain that was forbidding, as he begins to understand why the previous engineers sent on the same mission had been forced to give up the task and flee back to the south. Mysterious visitors, suspicious characters, strange apparent coincidences, and one particularly mysterious girl meet Howland at every turn in this suspenseful tale of adventure, excitement, danger, and romance set in the northern Canadian wilderness. (Summary by Roger Melin) \n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.0","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"299560","installSize":"299560","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.8","currency":"USD","filename":"com.appible.thedangertrailaudiotext_1.0.0_all.ipk","free":false,"images":[{"thumbnail":"7359\/images\/1\/L\/thedangertrail1.png","screenshot":"7359\/images\/1\/L\/thedangertrail1.png","orientation":"P","device":"P"},{"thumbnail":"7359\/images\/2\/L\/thedangertrail2.png","screenshot":"7359\/images\/2\/L\/thedangertrail2.png","orientation":"P","device":"P"}]}