{"publicApplicationId":"com.appible.theeyeofosirisaudiotext","description":"This Plus version of The Eye of Osiris includes both audio and text so you can follow along or read without the audio.\n\nIn this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\n    The Eye of Osiris is an early example from the Dr. Thorndyke series of detective stories written by R. Austin Freeman. In these stories, the author drew on his extensive medical and scientific knowledge for his main character, a medico-legal expert who relies on forensic evidence and logical deduction in solving cases. In this case, Thorndyke steps in to investigate the disappearance of one John Bellingham, an English gentleman and amateur Egyptologist, who has vanished under very mysterious circumstances. Thorndyke’s involvement in the case arises from a both purely professional interest in the unique character of the case, as well as from the fact that a young doctor and former student of his has recently become closely acquainted with the missing man’s brother and niece. (summary by J.M. Smallheer)\n\n\n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.0","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"287488","installSize":"287488","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.8","currency":"USD","filename":"com.appible.theeyeofosirisaudiotext_1.0.0_all.ipk","free":false,"images":[{"thumbnail":"7364\/images\/1\/L\/theeyeofosiris1.png","screenshot":"7364\/images\/1\/L\/theeyeofosiris1.png","orientation":"P","device":"P"},{"thumbnail":"7364\/images\/2\/L\/theeyeofosiris2.png","screenshot":"7364\/images\/2\/L\/theeyeofosiris2.png","orientation":"P","device":"P"}]}