{"publicApplicationId":"com.appible.theoldcuriosityshopaudio","description":"In this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\n    The Old Curiosity Shop tells the story of Little Nell, a beautiful and virtuous young girl who lives with her grandfather in his shop of curiosities. Her grandfather loves her dearly, and Nell does not complain, but she lives a lonely existence without friends of her own age. Her only friend is Kit, an honest young lad who works at the shop, and whom she is teaching to write. Unbeknownst to Nell, her grandfather is obsessed with their precarious financial position and is attempting to make Nell a good inheritance by winning at cards. He keeps these nocturnal activities a secret, but borrows heavily from the evil Quilp, a dwarf, in order to raise new capital. In the end, he gambles away what little money they own, and Quilp seizes the opportunity to take possession of the shop and make Nell’s and her grandfather’s lives a misery. Indeed, her grandfather suffers a breakdown, which leaves him bereft of his wits. Courageously, Nell decides to escape Quilp, and she and her grandfather run away to the country to live as beggars, travelling into the Midlands of England.\n\n\n\n    (Description from Wikipedia with additions by Euthymius) \n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.0","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"280736","installSize":"280736","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.2","currency":"USD","filename":"com.appible.theoldcuriosityshopaudio_1.0.0_all.ipk","free":false,"images":[{"thumbnail":"7372\/images\/1\/L\/theoldcuriosityshop1.png","screenshot":"7372\/images\/1\/L\/theoldcuriosityshop1.png","orientation":"P","device":"P"},{"thumbnail":"7372\/images\/2\/L\/theoldcuriosityshop2.png","screenshot":"7372\/images\/2\/L\/theoldcuriosityshop2.png","orientation":"P","device":"P"}]}