{"publicApplicationId":"com.appible.dreampsychologyaudio","description":"In this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\nNot a few serious-minded students, [...], have been discouraged from attempting a study of Freud’s dream psychology. The book in which he originally offered to the world his interpretation of dreams was [...] not to be assimilated in a few hours by the average alert reader. In those days, Freud could not leave out any detail likely to make his extremely novel thesis evidentially acceptable to those willing to sift data. Freud himself, however, realized the magnitude of the task which the reading of his magnum opus imposed upon those who have not been prepared for it by long psychological and scientific training and he abstracted from that gigantic work the parts which constitute the essential of his discoveries.\n\nThe publishers of the present book deserve credit for presenting to the reading public the gist of Freud’s psychology in the master’s own words, and in a form which shall neither discourage beginners, nor appear too elementary to those who are more advanced in psychoanalytic study. Dream psychology is the key to Freud’s works and to all modern psychology. With a simple, compact manual such as Dream Psychology there shall be no longer any excuse for ignorance of the most revolutionary psychological system of modern times.\n\n(From the book introduction, by Andre Tridon)\n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.0","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"280044","installSize":"280044","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.2","currency":"USD","filename":"com.appible.dreampsychologyaudio_1.0.0_all.ipk","free":false,"images":[{"thumbnail":"7389\/images\/1\/L\/dreampsychology1.png","screenshot":"7389\/images\/1\/L\/dreampsychology1.png","orientation":"P","device":"P"},{"thumbnail":"7389\/images\/2\/L\/dreampsychology2.png","screenshot":"7389\/images\/2\/L\/dreampsychology2.png","orientation":"P","device":"P"}]}