{"publicApplicationId":"com.appible.hurlbutsstoryofthebibleparttwoaudio","description":"In this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\nSome years ago, the editor of an English magazine sent a communication to “the hundred greatest men in Great Britain” asking them this question: “If for any reason you were to spend a year absolutely alone, in a prison for instance, and could select from your library three volumes to be taken with you as companions in your period of retirement please to inform us what those three books would be.” The inquiry was sent to peers of the realm, prominent leaders in politics, judges, authors, manufacturers, merchants, gentlemen of leisure—men who would represent every aspect of successful life. In the answers it was found that ninety-eight of the hundred men named “The Bible” first on the list of the three books to be chosen. (From Book introduction)\n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.0","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"278630","installSize":"278630","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.2","currency":"USD","filename":"com.appible.hurlbutsstoryofthebibleparttwoaudio_1.0.0_all.ipk","free":false,"images":[{"thumbnail":"7392\/images\/1\/L\/hurlbutsstoryofthebibleparttwo1.png","screenshot":"7392\/images\/1\/L\/hurlbutsstoryofthebibleparttwo1.png","orientation":"P","device":"P"},{"thumbnail":"7392\/images\/2\/L\/hurlbutsstoryofthebibleparttwo2.png","screenshot":"7392\/images\/2\/L\/hurlbutsstoryofthebibleparttwo2.png","orientation":"P","device":"P"}]}