{"publicApplicationId":"com.appible.thecallofthewildaudiotext","description":"This Plus version of The Call of the Wild includes both audio and text so you can follow along or read without the audio.\n\nIn this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\n    This is the story of Buck, dog napped from sunny California to snowy Arctic during the Alaska gold rush. This deservedly famous book has been already recorded by LibriVox and downloaded more than 100,000 times. Why, then, would anyone suggest another recording? Because this will be a Solo recording.One of the joys of LibriVox is also a source of frustration for some listeners. That is, getting used to a narrator just in time for it to change! So, with apologies to Gordon, Kristin, Jean, and Miette, I am doing a solo. (Introduction by Tom Crawford)\n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.0","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"304652","installSize":"304652","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.8","currency":"USD","filename":"com.appible.thecallofthewildaudiotext_1.0.0_all.ipk","free":false,"images":[{"thumbnail":"7399\/images\/1\/L\/thecallofthewild1.png","screenshot":"7399\/images\/1\/L\/thecallofthewild1.png","orientation":"P","device":"P"},{"thumbnail":"7399\/images\/2\/L\/thecallofthewild2.png","screenshot":"7399\/images\/2\/L\/thecallofthewild2.png","orientation":"P","device":"P"}]}