{"publicApplicationId":"com.appible.thememoirsofsherlockholmesaudio","description":"In this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\nSherlock Holmes, a fictional character of the late 19th and early 20th century created by Scottish author and physician Sir Arthur Conan Doyle, is a brilliant London-based \"consulting detective\" famous for his intellectual prowess and renowned for his enormous scope of observation, his astute logical reasoning and forensic science skills in solving difficult crimes. The Memoirs of Sherlock Holmes is a collection of Sherlock Holmes mysteries, including The Final Problem in which Holmes confronts his arch-nemesis Professor Moriarty, originally published in 1894, which are preceded by The Adventures of Sherlock Holmes and followed by The Hound of the Baskervilles. (Summary from Wikipedia)\n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.0","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"300220","installSize":"300220","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.2","currency":"USD","filename":"com.appible.thememoirsofsherlockholmesaudio_1.0.0_all.ipk","free":false,"images":[{"thumbnail":"7405\/images\/1\/L\/thememoirsofsherlockholmes1.png","screenshot":"7405\/images\/1\/L\/thememoirsofsherlockholmes1.png","orientation":"P","device":"P"},{"thumbnail":"7405\/images\/2\/L\/thememoirsofsherlockholmes2.png","screenshot":"7405\/images\/2\/L\/thememoirsofsherlockholmes2.png","orientation":"P","device":"P"}]}