{"publicApplicationId":"com.gelbard.enummer","description":"E-Nummer - Wörterbuch der Zusatzstoffe. Das Programm übersetzt über 300 E-Nummern in \"lesbare Zusatzstoffe\". Das Programm enthält den Namen, die Kategorie, die Risikoeinschätzung und eine Beschreibung der E-Nummern. Weiters werden für jeden Zusatzstoff die Eigenschaften für Allergiker, Arzneimittel, Bio, Gentechnik und tierischen Ursprung ausgegeben!\nDas Programm beinhaltet auch die wichtigsten Fragen und Antworten zu den E-Nummern.\nIn der Europäischen Union sind zurzeit über 300 Zusatzstoffe für Lebensmittel zugelassen, wobei ständig neue hinzukommen. Sie sind in allen Ländern der Europäischen Union und zum Teil sogar weltweit gültig. Zusatzstoffe werden vor allem für jegliche Arten von Fertig-Lebensmittel verwendet, die ohne künstliche Farbstoffe, Geschmacksverstärker, Konservierungsmittel und Co. nicht mehr denkbar sind.\nImmer mehr Erwachsene und Kinder haben gesundheitliche Probleme und können bestimmte Zusatzstoffe aus gesundheitlichen Gründen nicht vertragen, weil sie zum Beispiel allergisch reagieren. Andere möchten den Verzehr von Zusatzstoffen aus ethischen oder religiösen Gründen einschränken oder ganz meiden. Oder vielleicht möchten Sie einfach keine Lebensmittel essen, die mit einer Vielzahl künstlicher Zusatzstoffe hergestellt wurden. Es gibt viele Gründe, warum man wissen möchte, welcher Zusatzstoff im Lebensmittel verborgen ist.","version":"1.0.1","homeURL":"http:\/\/www.gelbard.at","supportURL":"http:\/\/www.gelbard.at","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2011 Ing.Gelbard","licenseURL":"http:\/\/www.gelbard.at","locale":null,"appSize":"218878","installSize":"218878","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"2.99","currency":"USD","filename":"com.gelbard.enummer_1.0.1_all.ipk","free":false,"images":[{"thumbnail":"7618\/de\/images\/1\/L\/enummer_2011-13-02_193428.png","screenshot":"7618\/de\/images\/1\/L\/enummer_2011-13-02_193428.png","orientation":"P","device":"P"},{"thumbnail":"7618\/de\/images\/2\/L\/enummer_2011-13-02_193441.png","screenshot":"7618\/de\/images\/2\/L\/enummer_2011-13-02_193441.png","orientation":"P","device":"P"},{"thumbnail":"7618\/de\/images\/3\/L\/enummer_2011-13-02_193448.png","screenshot":"7618\/de\/images\/3\/L\/enummer_2011-13-02_193448.png","orientation":"P","device":"P"},{"thumbnail":"7618\/de\/images\/4\/L\/enummer_2011-13-02_193457.png","screenshot":"7618\/de\/images\/4\/L\/enummer_2011-13-02_193457.png","orientation":"P","device":"P"}]}