{"publicApplicationId":"com.nxltsoft.cryptolists","description":"With Crypto Lists for WebOS you can keep your notes, passwords, lists, outlines, checklists and more with you wherever you go.  Keep personal data encrypted on your phone and look it up whenever you need it.\n\nCrypto Lists combines the features of a notepad, password manager, outline creator, and list manager in one application.  You can keep your data as free format notes or as structured lists.  Make outlines with as many sub-levels as you need.  Turn any list into a checklist with one menu command and optionally hide checked off items.  Take any checklist (or any other data) and turn it into a re-usable template.  Encrypt anything you want, even your templates.  Use native cut and paste to copy data from existing notes or E-mail.  Use drag and drop to order your outline or list items and swipe to delete items.  You can even backup your data over USB.\n\nAlso, you can optionally edit, manage, and print your unencrypted data online (15 day free trial included; one year subscription same price as app) with our CryptoWeb application.  CryptoWeb features the same intuitive editing interface as Crypto Lists, but uses your browser.  Create your notes and lists on your computer and securely sync it to your phone.\n\nGreat for securely storing your passwords, credit card numbers, and other sensitive personal information.  Make packing checklists for vacations and save them as a template.  Make outlines or take notes when you are away from your desk and use them online when you get back to your office or any web connected browser.  Make shopping lists or to do lists online and look them up on your phone while you are out.\n\nSee screen shots of Crypto Lists and CryptoWeb at nxltsoft.com.","version":"1.2.9","versionNote":"","homeURL":"http:\/\/nxltsoft.com","supportURL":"http:\/\/nxltsoft.com","custsupportemail":"contact@nxltsoft.com","custsupportphonenum":"","copyright":"Copyright 2011 Next Little Thing Software","licenseURL":"","locale":"en_US","appSize":109506,"installSize":3440640,"isEncrypted":false,"adultRating":false,"islocationbased":false,"lastModifiedTime":"2012-06-02T04:56:04.000+0000","mediaLink":"http:\/\/www.youtube.com\/watch?v=OSlSc0GJwro","mediaIcon":"http:\/\/img.youtube.com\/vi\/OSlSc0GJwro\/2.jpg","attributes":{"provides":{"noApp":false,"dockMode":false,"universalSearch":false,"connectors":["null"],"services":[],"optimizedUserExperience":true}},"price":4,"currency":"USD","isAdvertized":false,"filename":"com.nxltsoft.cryptolists_1.2.9_all.ipk","free":false,"touchpad_exclusive":true,"images":{"1":{"screenshot":"7620\/1.2.9\/en\/images\/1\/L\/tb_TP-checklist.png","thumbnail":"7620\/1.2.9\/en\/images\/1\/S\/tb_TP-checklist.png","orientation":"P","device":"P"},"2":{"screenshot":"7620\/1.2.9\/en\/images\/2\/L\/tb_TP-Passwords.png","thumbnail":"7620\/1.2.9\/en\/images\/2\/S\/tb_TP-Passwords.png","orientation":"P","device":"P"},"3":{"screenshot":"7620\/1.2.9\/en\/images\/3\/L\/tb_TP-Memo.png","thumbnail":"7620\/1.2.9\/en\/images\/3\/S\/tb_TP-Memo.png","orientation":"P","device":"P"},"4":{"screenshot":"7620\/1.2.9\/en\/images\/4\/L\/ph_ListsView.png","thumbnail":"7620\/1.2.9\/en\/images\/4\/S\/ph_ListsView.png","orientation":"P","device":"P"}}}