{"publicApplicationId":"com.kevin.stupid","description":"Have you ever wanted to tell someone how stupid their idea is?  Would you like the ability to do it in multiple languages, or with a custom text to voice statement?  Do you want to send it in the form of voice, text message or email?  Well, the Stupid Button does just that.  You can choose from 9 different languages and at the push of a button you will be able to let everyone know what you think of the situation.  If you want to say something else, use the \"Text to Voice\" option.  \nYou can even respond via email with a \"that's stupid\" attachment. ***If additional languages would like to be added, let me know!  \nUpdate:\n\n -->v1.0.7  Bumped audio volume up 3dB....Make sure the media volume is turned up!  \n\n-->v1.2.2 Volume of audio clips increased to maximum levels (audio is now slightly distorted on maximum volume)...Fixed a memory issue that caused the program to stop responding upon playing audio on the pixi and pres with webos v2.x...Locked the volume keys to media volume while the app is running to make adjusting the volume easier.  \n\n-->V1.3.0 Added a text to speech option.  Just type it and make it so..*Data connection required\n\n-->V1.3.5 Fixed text to voice loading issues.  Clean up interface for use on pixi\/veer\n\n-->V1.3.7 Download bug fixes\n\n-->V1.3.9 Fixed T2V issue, added Italian and Klingon \"that's stupid\" clips\n\n-->V1.4.4 Updated Klingon (thanks Michael -\nProfessional Klingon translator), added ability to save current state on webOs 2.0 and higher","version":"1.4.4","homeURL":"http:\/\/www.kstichno.blogspot.com\/","supportURL":"http:\/\/www.kstichno.blogspot.com\/","custsupportemail":"","custsupportphonenum":"","copyright":"copyright 2011 Kevin","licenseURL":"http:\/\/www.kstichno.blogspot.com\/","locale":null,"appSize":"373452","installSize":"373452","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":0,"currency":"USD","filename":"com.kevin.stupid_1.4.4_all.ipk","free":true,"images":[{"thumbnail":"7650\/icon\/S\/icon_1_4_4.png","screenshot":"7650\/icon\/S\/icon_1_4_4.png","orientation":"P","device":"P"}]}