{"publicApplicationId":"com.ximad.linesclassic","description":"Lines Classic Game is a remake of famous Russian highly addictive mind challenger board game (aka \"Color Lines\" and \"Balls\"); with this amazing game it's possible to exercise your mind everywhere.\n\nThis strategy Game will make you think and concentrate for hours if you accept the challenge. It starts with a squared board of 9 by 9. The game will randomly place three color balls on the game board at every round, you have to strategically select one ball (click on ball) and move it to the most convenient location (click on target square). \n\nLines of 5 or more balls of the same color are eliminated, adding to the score. The more balls you happen to destroy at a time, the more points you get for each ball. \n\nTo change the selected ball, click on another one. If you click on a free destination cell but nothing happens, either there is not a ball selected yet, or there is no a free way to the destination cell. The rule is that only one ball may be moved every turn, and it can only be moved if there is a clear path to its destination. It may seem pretty simple but as the level increases a more strategic approach is needed.\n\nIt gets addictive, and you simply cannot stop playing. Have Fun!","version":"1.0.0","versionNote":"","homeURL":"http:\/\/www.ximad.com","supportURL":"http:\/\/www.ximad.com","custsupportemail":"support@ximxim.com","custsupportphonenum":"","copyright":"copyright 2010 XIM, Inc","licenseURL":"","locale":"en_US","appSize":148954,"installSize":1310720,"isEncrypted":false,"adultRating":false,"islocationbased":false,"lastModifiedTime":"2011-02-19T21:04:45.000+0000","mediaLink":null,"mediaIcon":null,"attributes":{"provides":{"noApp":false,"dockMode":false,"universalSearch":false,"connectors":[],"services":[],"optimizedUserExperience":false}},"price":0,"currency":"USD","isAdvertized":false,"filename":"com.ximad.linesclassic_1.0.0_all.ipk","free":false,"touchpad_exclusive":false,"images":{"1":{"thumbnail":"7653\/en\/images\/1\/S\/screenshot-320x480-1.jpg","screenshot":"7653\/en\/images\/1\/L\/screenshot-320x480-1.jpg","orientation":"P","device":"P"},"2":{"thumbnail":"7653\/en\/images\/2\/S\/screenshot-320x480-2.jpg","screenshot":"7653\/en\/images\/2\/L\/screenshot-320x480-2.jpg","orientation":"P","device":"P"}}}