{"publicApplicationId":"com.hedami.mprtrial","description":"*** Winner of the webOS Nation Best Music App of 2011 award ***\n\n*** This is a 14-day full-featured trial version ***\n\nMusic Player (Remix) is the next generation music listening experience on webOS. It will simplify the way you access & manage your music with an incredible assortment of useful features including:\n\n- Flylists: Create custom, dynamic playlists that can contain songs, albums, artists, genres, or synced playlists.\n\n- Universal Search: Start typing within the app to instantly find anything within your music collection. Also initiate searches using Just Type.\n\n- Faves: Pin items to the home screen for one-touch easy access to your favorite music.\n\n- Autolists: Auto-generated playlists created based upon your listening habits.\n\n- Mini-player: A customizable, multi-module player that resides in the notification area.\n\n- Custom wallpapers: Choose a wallpaper, use the phone’s wallpaper, or have the app pick one for you!\n\n- Social networking: Scrobble songs to Last.FM (cached when not online), post songs to Twitter & Facebook with links to their YouTube videos and optional attached notes, and listen to other people’s posted songs.\n\n- Advanced bookmarking: Set manual bookmarks with visual marker cues. Auto-bookmarks are saved when exiting the app, leaving a playlist, or when changing tracks.\n\n- Download lyrics (that are automatically cached locally) & start a karaoke session to record yourself singing along (note: karaoke feature not available on the Pre 3 and TouchPad).\n\n- Playlist Preview mode: Visually browse & manage your current playlist without interrupting playback of the current song.\n\n- Download album art & choose from a variety of image sizes.\n\n- Automatic daily data backup for flylists, faves, bookmarks, song play info, and lyrics.\n\n- Custom gestures: Assign custom actions when swiping up & down on the Now Playing screen.\n\n- Supports MP3, AAC, AAC+, eAAC+, AMR, QCELP, and WAV.\n\n- And much, much more!!!","version":"2.5.10","homeURL":"http:\/\/www.hedami.com\/contactus.html","supportURL":"http:\/\/www.hedami.com\/contactus.html","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright © 2012 Hedami","licenseURL":"http:\/\/www.hedami.com\/contactus.html","locale":null,"appSize":"2751778","installSize":"2751778","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":0,"currency":"USD","filename":"com.hedami.mprtrial_2.5.10_all.ipk","free":true,"images":[{"thumbnail":"7670\/icon\/S\/icon_2_5_10.png","screenshot":"7670\/icon\/S\/icon_2_5_10.png","orientation":"P","device":"P"}]}