{"publicApplicationId":"com.appible.womeninloveaudio","description":"In this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\nWomen in Love is a novel by British author D. H. Lawrence published in 1920. It is a sequel to his earlier novel The Rainbow (1915), and follows the continuing loves and lives of the Brangwen sisters, Gudrun and Ursula. Gudrun Brangwen, an artist, pursues a destructive relationship with Gerald Crich, an industrialist. Lawrence contrasts this pair with the love that develops between Ursula and Rupert Birkin, an alienated intellectual who articulates many opinions associated with the author. The emotional relationships thus established are given further depth and tension by an unadmitted homoerotic attraction between Gerald and Rupert. The novel ranges over the whole of British society at the time of the First World War and eventually ends high up in the snows of the Swiss Alps. (Summary by Wikipedia)\n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.0","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"286198","installSize":"286198","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.2","currency":"USD","filename":"com.appible.womeninloveaudio_1.0.0_all.ipk","free":false,"images":[{"thumbnail":"7766\/icon\/S\/icon1_0_0.png","screenshot":"7766\/icon\/S\/icon1_0_0.png","orientation":"P","device":"P"},{"thumbnail":"7766\/icon\/S\/icon1_0_0.png","screenshot":"7766\/icon\/S\/icon1_0_0.png","orientation":"P","device":"P"}]}