{"publicApplicationId":"com.appible.ahousetoletaudio","description":"In this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\n    A House to Let is a novella originally published in 1858 in the Christmas edition of Dickens’ Household Words magazine. Each of the contributors wrote a chapter (stories within a story, and in the case of Adelaide Anne Procter, as a story in verse) and the whole was edited by Dickens.\n\n    The plot concerns an elderly woman, Sophonisba, who notices signs of life in a supposedly empty dilapidated house (the eponymous “House to Let”) opposite her own, and employs the efforts of an elderly admirer, Jabez Jarber, and her servant, Trottle, to discover what is happening within. (Summary by Ruth Golding and Wikipedia)\n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.0","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"279234","installSize":"279234","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.2","currency":"USD","filename":"com.appible.ahousetoletaudio_1.0.0_all.ipk","free":false,"images":[{"thumbnail":"7816\/icon\/S\/icon1_0_0.png","screenshot":"7816\/icon\/S\/icon1_0_0.png","orientation":"P","device":"P"},{"thumbnail":"7816\/icon\/S\/icon1_0_0.png","screenshot":"7816\/icon\/S\/icon1_0_0.png","orientation":"P","device":"P"}]}