{"publicApplicationId":"com.appible.apracticalguidetoselfhypnosisaudiotext","description":"This Plus version of A Practical Guide to Self-Hypnosis includes both audio and text so you can follow along or read without the audio.\n\nIn this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\nThis book is written in terms that are comprehensible to the layman. The step-by-step instructions should afford the reader a means of acquiring self-hypnosis. The necessary material is here. The reader need only follow the instructions as they are given. It is the author’s hope that you will, through the selective use of self-hypnosis, arrive at a more rewarding, well-adjusted, and fuller life. (Summary from A Practical Guide to Self-Hypnosis)\n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.0","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"290852","installSize":"290852","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.8","currency":"USD","filename":"com.appible.apracticalguidetoselfhypnosisaudiotext_1.0.0_all.ipk","free":false,"images":[{"thumbnail":"7819\/icon\/S\/icon1_0_0.png","screenshot":"7819\/icon\/S\/icon1_0_0.png","orientation":"P","device":"P"},{"thumbnail":"7819\/icon\/S\/icon1_0_0.png","screenshot":"7819\/icon\/S\/icon1_0_0.png","orientation":"P","device":"P"}]}