{"publicApplicationId":"com.appible.ashorthistoryofenglandaudiotext","description":"This Plus version of A Short History of England includes both audio and text so you can follow along or read without the audio.\n\nIn this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\nGilbert Keith Chesterton was a prolific writer on many topics. His views of history were always from the standpoint of men and their interactions, and it may fairly be said he saw all of history as a battle between civilization and barbarism. So it has always been, and that remains true even today.\n\n“But it is especially in the matter of the Middle Ages that the popular histories trample upon the popular traditions. In this respect there is an almost comic contrast between the general information provided about England in the last two or three centuries, in which its present industrial system was being built up, and the general information given about the preceding centuries, which we call broadly mediaeval. “\n\nAs this quotation taken from the Introduction clearly shows, he is no mere pedant reciting dry dates and locations, but a profound thinker flooding new light onto those modern “myths” that have filled our historys. He is a master of paradox, and the techique of reducing his opponents arguments to the logical absurdity they have inherent in them. He often turns them upside down. All of which makes his work both a sound subject for reflection and highly entertaining all the while it remains permanently timely. (Summary by Ray Clare)\n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.0","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"281912","installSize":"281912","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.8","currency":"USD","filename":"com.appible.ashorthistoryofenglandaudiotext_1.0.0_all.ipk","free":false,"images":[{"thumbnail":"7821\/icon\/S\/icon1_0_0.png","screenshot":"7821\/icon\/S\/icon1_0_0.png","orientation":"P","device":"P"},{"thumbnail":"7821\/icon\/S\/icon1_0_0.png","screenshot":"7821\/icon\/S\/icon1_0_0.png","orientation":"P","device":"P"}]}