{"publicApplicationId":"com.appible.aselectionofdivinepoemsaudio","description":"In this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\n    John Donne was an English Jacobean preacher, sometime lawyer, later in life a Member of Parliament and Royal Chaplain. Marrying for love against the wishes of his influential father-in-law; Donne's career was cast into shadow: forcing him to support his wife, Anne, as best he might under a specter of unforgiving penury.\n\n    Despite such hardships - perhaps because of them - Donne's writings demonstrate a mastery of poetry layered with metaphysical meaning and mystery: which continues to delight and challenge modern-day readers. Donne's \"divine poems\" - the focus of this collection - present profound theological insights using absorbing allegories and beautiful imagery.\n\n    At the end of Donne's life - as his health deteriorated under illnesses of increasing severity - his poetry served him as: distraction, consolation, and even \"public confession\". With them, Donne cheerfully but soberly faces the limits of his own mortality: and contemplates the mysteries that lie beyond the grave.\n\n    (Introduction by Godsend)\n\n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.0","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"280890","installSize":"280890","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.2","currency":"USD","filename":"com.appible.aselectionofdivinepoemsaudio_1.0.0_all.ipk","free":false,"images":[{"thumbnail":"7825\/icon\/S\/icon1_0_0.png","screenshot":"7825\/icon\/S\/icon1_0_0.png","orientation":"P","device":"P"},{"thumbnail":"7825\/icon\/S\/icon1_0_0.png","screenshot":"7825\/icon\/S\/icon1_0_0.png","orientation":"P","device":"P"}]}