{"publicApplicationId":"com.appible.howtoliveontwentyfourhoursadayaudiotext","description":"This Plus version of How to Live on Twenty-Four Hours a Day includes both audio and text so you can follow along or read without the audio.\n\nIn this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n“Which of us lives on twenty-four hours a day? And when I say ‘lives,’ I do not mean exists, nor ‘muddles through.’”\n\nArnold Bennett knew a “rat race” when he saw one. Every day, his fellow white-collar Londoners followed the same old routine. And they routinely decried the sameness in their lives.\n\nSo Bennett set out to explain how to inject new enthusiasm into living. In this delightful little work, he taught his fellow sufferers how to set time apart for improving their lives. Yes, he assured them, it could be done. Yes, if you want to feel connected with the world, instead of endlessly pacing the treadmill (or, “exceeding your programme”, as he called it), you must do so.\n\nFor time, as he gleefully notes, is the ultimate democracy. Each of us starts our day with 24 hours to spend. Even a saint gets not a minute more; even the most inveterate time-waster is docked not a second for his wastrel ways. And he can choose today to turn over a new leaf!\n\nBennett believed that learning to discern cause and effect in the world would give his readers an endless source of enjoyment and satisfaction. Instead of only being able to discuss what they had heard, they could graduate to what they thought… and lift themselves completely from the deadening influence of a day at the office.\n\n(Summary by Mark F. Smith)\n\n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.0","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"290948","installSize":"290948","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.8","currency":"USD","filename":"com.appible.howtoliveontwentyfourhoursadayaudiotext_1.0.0_all.ipk","free":false,"images":[{"thumbnail":"7826\/icon\/S\/icon1_0_0.png","screenshot":"7826\/icon\/S\/icon1_0_0.png","orientation":"P","device":"P"},{"thumbnail":"7826\/icon\/S\/icon1_0_0.png","screenshot":"7826\/icon\/S\/icon1_0_0.png","orientation":"P","device":"P"}]}