{"publicApplicationId":"com.appible.mozartthemanandtheartistasrevealedinhisownwordsaudiotext","description":"This Plus version of Mozart, The Man and the Artist as Revealed in His Own Words includes both audio and text so you can follow along or read without the audio.\n\nIn this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\nWolfgang Amadeus Mozart. His name is one of the most recognizable names in history and one of the most enduring of composers. At age 5, this “wunderkinder” took to the stage and began his life as a prolific and celebrated creator-genius of such luminous works the world has not known since. This collection of morsels taken from his personal letters is engaging and gives a look into the mind of the boy wonder. Was he mad? Was he miraculous? (Summary by Aaron Elliott) \n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.0","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"283184","installSize":"283184","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.8","currency":"USD","filename":"com.appible.mozartthemanandtheartistasrevealedinhisownwordsaudiotext_1.0.0_all.ipk","free":false,"images":[{"thumbnail":"7831\/icon\/S\/icon1_0_0.png","screenshot":"7831\/icon\/S\/icon1_0_0.png","orientation":"P","device":"P"},{"thumbnail":"7831\/icon\/S\/icon1_0_0.png","screenshot":"7831\/icon\/S\/icon1_0_0.png","orientation":"P","device":"P"}]}