{"publicApplicationId":"com.appible.secondvarietyaudiotext","description":"This Plus version of Second Variety includes both audio and text so you can follow along or read without the audio.\n\nIn this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\nEarly victories by the USSR in a global nuclear war cause the United Nations government to retreat to the moon leaving behind troops and fierce autonomous robots called “Claws”, which reproduce and redesign themselves in unmanned subterranean factories. After six bloody years of conflict the Soviets call for an urgent conference and UN Major Joseph Hendricks sets out to meet them. Along the way he will discover what the Claws have been up to, and it isn’t good… - Second Variety was first published in the May 1953 edition of Space Science Fiction Magazine. (Summary by Gregg Margarite) \n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.0","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"297134","installSize":"297134","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.8","currency":"USD","filename":"com.appible.secondvarietyaudiotext_1.0.0_all.ipk","free":false,"images":[{"thumbnail":"7834\/icon\/S\/icon1_0_0.png","screenshot":"7834\/icon\/S\/icon1_0_0.png","orientation":"P","device":"P"},{"thumbnail":"7834\/icon\/S\/icon1_0_0.png","screenshot":"7834\/icon\/S\/icon1_0_0.png","orientation":"P","device":"P"}]}