{"publicApplicationId":"com.appible.thescarletplagueaudiotext","description":"This Plus version of The Scarlet Plague includes both audio and text so you can follow along or read without the audio.\n\nIn this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\n    Known mainly for his tales of adventure, this work of science fiction by Jack London is set in a post-apocalyptic future.\n\n    It’s 2072, sixty years after the scarlet plague has depopulated the planet. James Howard Smith is one of the few survivors of the pre-plague era left alive in the San Francisco area, and as he realizes his time grows short, he tries to impart the value of knowledge and wisdom to his grandsons. Through his narrative, we learn how the plague spread throughout the world and of the struggles of the handful of survivors it left in its wake.\n\n    The Scarlet Plague was originally published in London Magazine in 1912.\n\n    (Summary by Wikipedia and James Christopher) \n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.0","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"305130","installSize":"305130","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.8","currency":"USD","filename":"com.appible.thescarletplagueaudiotext_1.0.0_all.ipk","free":false,"images":[{"thumbnail":"7838\/icon\/S\/icon1_0_0.png","screenshot":"7838\/icon\/S\/icon1_0_0.png","orientation":"P","device":"P"},{"thumbnail":"7838\/icon\/S\/icon1_0_0.png","screenshot":"7838\/icon\/S\/icon1_0_0.png","orientation":"P","device":"P"}]}