{"publicApplicationId":"com.appible.thetragedyofhamletprinceofdenmarkaudio","description":"In this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\nHamlet is commonly regarded as one of the greatest plays ever written. Drawing on Danish chronicles and the Elizabethan vogue for revenge tragedy, Shakespeare created a play that is at once a philosophic treatise, a family drama, and a supernatural thriller. In the wake of his father’s death, Prince Hamlet finds that his Uncle Claudius has swiftly taken the throne and married his mother, Queen Gertrude. The ghost of the dead king then appears and charges Claudius with ‘murder most foul.’ Hamlet is called to revenge his father’s death: but will he be able to act before it is too late?\n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.0","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"280790","installSize":"280790","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.2","currency":"USD","filename":"com.appible.thetragedyofhamletprinceofdenmarkaudio_1.0.0_all.ipk","free":false,"images":[{"thumbnail":"7843\/icon\/S\/icon1_0_0.png","screenshot":"7843\/icon\/S\/icon1_0_0.png","orientation":"P","device":"P"},{"thumbnail":"7843\/icon\/S\/icon1_0_0.png","screenshot":"7843\/icon\/S\/icon1_0_0.png","orientation":"P","device":"P"}]}