{"publicApplicationId":"com.appible.theuttermostfarthingaudiotext","description":"This Plus version of The Uttermost Farthing includes both audio and text so you can follow along or read without the audio.\n\nIn this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\nHumphrey Challoner is a solitary old man who spent a lifetime collecting for his private museum, primarily mammals exhibiting osteological abnormalities but also 24 articulated human skeletons without any apparent defect. His friend, Dr. Wharton, is puzzled by the collection, but he humors Challoner's eccentricities and tends to him in his final illness. When Wharton inherits the collection on Challoner's death, the dark mystery that ties the collection together is finally revealed. (Summary by MaryAnn) \n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.0","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"288088","installSize":"288088","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.8","currency":"USD","filename":"com.appible.theuttermostfarthingaudiotext_1.0.0_all.ipk","free":false,"images":[{"thumbnail":"7844\/icon\/S\/icon1_0_0.png","screenshot":"7844\/icon\/S\/icon1_0_0.png","orientation":"P","device":"P"},{"thumbnail":"7844\/icon\/S\/icon1_0_0.png","screenshot":"7844\/icon\/S\/icon1_0_0.png","orientation":"P","device":"P"}]}