{"publicApplicationId":"com.appible.tohaveandtoholdaudio","description":"In this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\nWhen I first started reading this book, I thought it to be a historical romance novel. As I read further, I pondered whether it might be a sea-faring story. Reading still further, I determined it to be an adventure story. Alas, it is all three. To Have And To Hold, written by Mary Johnston was the bestselling novel of 1900. The story takes place in colonial Jamestown during the 1600’s. Captain Ralph Percy, an English soldier turned Virginian explorer buys a wife - little knowing that she is the escaping ward of King James I. Jocelyn is fleeing a forced marriage to the villain of our story, Lord Carnal. Her would-be suitor arrives in Jamestown to take his bride, unknowing that she is already wed to Captain Percy. The story quickly evolves through kidnapping, intrigue, arrest, shipwreck, pirates, and the unraveling of the colony's delicate peace with the Native Americans. As our story nears the conclusion, Captain Percy is told that Jocelyn has gone in search of him during hostilities and he fears she has not survived. (Summary by Wikipedia and the Reader)\n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.0","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"285610","installSize":"285610","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.2","currency":"USD","filename":"com.appible.tohaveandtoholdaudio_1.0.0_all.ipk","free":false,"images":[{"thumbnail":"7848\/icon\/S\/icon1_0_0.png","screenshot":"7848\/icon\/S\/icon1_0_0.png","orientation":"P","device":"P"},{"thumbnail":"7848\/icon\/S\/icon1_0_0.png","screenshot":"7848\/icon\/S\/icon1_0_0.png","orientation":"P","device":"P"}]}