{"publicApplicationId":"com.appible.ontheoriginofspeciesbymeansofnaturalselectionaudio","description":"In this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\nCharles Darwin’s Origin of Species (publ. 1859) is a pivotal work in scientific literature and arguably the pivotal work in evolutionary biology. The book’s full title is On the Origin of Species by Means of Natural Selection, or the Preservation of Favoured Races in the Struggle for Life. It introduced the theory that populations evolve over the course of generations through a process of natural selection. It was controversial because it contradicted religious beliefs which underlay the then current theories of biology. Darwin’s book was the culmination of evidence he had accumulated on the voyage of the Beagle in the 1830s and added to through continuing investigations and experiments since his return.\n(Summary from Wikipedia) \n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.0","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"282266","installSize":"282266","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.2","currency":"USD","filename":"com.appible.ontheoriginofspeciesbymeansofnaturalselectionaudio_1.0.0_all.ipk","free":false,"images":[{"thumbnail":"7863\/icon\/S\/icon1_0_0.png","screenshot":"7863\/icon\/S\/icon1_0_0.png","orientation":"P","device":"P"},{"thumbnail":"7863\/icon\/S\/icon1_0_0.png","screenshot":"7863\/icon\/S\/icon1_0_0.png","orientation":"P","device":"P"}]}