{"publicApplicationId":"com.appible.theaeneidaudio","description":"In this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\nThe Aeneid is a Latin epic written by Virgil in the 1st century BC that tells the legendary story of Aeneas, a Trojan who traveled to Italy, where he became the ancestor of the Romans. The first six of the poem’s twelve books tell the story of Aeneas’ wanderings from Troy to Italy, and the poem’s second half treats the Trojans’ ultimately victorious war upon the Latins, under whose name Aeneas and his Trojan followers are destined to be subsumed. The poem was commissioned from Vergil by the Emperor Augustus to glorify Rome. Several critics think that the hero Aeneas’ abandonment of the Cartheginian Queen Dido, is meant as a statement of how Augustus’ enemy, Mark Anthony, should have behaved with the Egyptian Queen Cleopatra. (Summary by Wikipedia and Karen Merline)\n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.0","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"277344","installSize":"277344","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.2","currency":"USD","filename":"com.appible.theaeneidaudio_1.0.0_all.ipk","free":false,"images":[{"thumbnail":"7864\/icon\/S\/icon1_0_0.png","screenshot":"7864\/icon\/S\/icon1_0_0.png","orientation":"P","device":"P"},{"thumbnail":"7864\/icon\/S\/icon1_0_0.png","screenshot":"7864\/icon\/S\/icon1_0_0.png","orientation":"P","device":"P"}]}