{"publicApplicationId":"com.appible.thecanterburytalesaudio","description":"In this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\nThe Canterbury Tales is a collection of stories written in Middle English by Geoffrey Chaucer in the 14th century (two of them in prose, the rest in verse). The tales, some of which are originals and others not, are contained inside a frame tale and told by a group of pilgrims on their way from Southwark to Canterbury to visit the shrine of Saint Thomas Becket at Canterbury Cathedral.\nThe themes of the tales vary, and include topics such as courtly love, treachery, and avarice. The genres also vary, and include romance, Breton lai, sermon, beast fable, and fabliau. The characters, introduced in the General Prologue of the book, tell tales of great cultural relevance.\nThe version read here was edited by D. Laing Purves “for popular perusal” and the language is mostly updated.\n(Summary by Wikipedia\/Gesine) \n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.0","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"280544","installSize":"280544","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.2","currency":"USD","filename":"com.appible.thecanterburytalesaudio_1.0.0_all.ipk","free":false,"images":[{"thumbnail":"7866\/icon\/S\/icon1_0_0.png","screenshot":"7866\/icon\/S\/icon1_0_0.png","orientation":"P","device":"P"},{"thumbnail":"7866\/icon\/S\/icon1_0_0.png","screenshot":"7866\/icon\/S\/icon1_0_0.png","orientation":"P","device":"P"}]}