{"publicApplicationId":"com.appible.uncletomscabinaudiotext","description":"This Plus version of Uncle Tom's Cabin includes both audio and text so you can follow along or read without the audio.\n\nIn this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\n    Among the most “banned” books in the United States, Uncle Tom’s Cabin; or, Life Among the Lowly is a novel by American author Harriet Beecher Stowe which treats slavery as a central theme. Stowe was a Connecticut-born teacher at the Hartford Female Academy and an active abolitionist. The novel is believed to have had a profound effect on the North’s view of slavery. In fact, when he met Harriet Beecher Stowe, President Lincoln is said to have commented, “So you’re the little lady whose book started the Civil War.” First published on March 20, 1852, the story focuses on the tale of Uncle Tom, a long-suffering black slave, the central character around whose life the other characters—both fellow slaves and slave owners—revolve. The novel depicts the harsh reality of slavery while also showing that Christian love and faith can overcome even something as evil as enslavement of fellow human beings. (Summary by Wikipedia and John Greenman)\n\n    Note From the Reader: The listener is about to enter a world rich with diverse characters. In order to differentiate between the characters, the reader has given each, his\/her own voice. As an adult male reader, however, the reader’s representation of women and children will, necessarily be less than adequate. He asks for your indulgence.\n\n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.0","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"279480","installSize":"279480","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.8","currency":"USD","filename":"com.appible.uncletomscabinaudiotext_1.0.0_all.ipk","free":false,"images":[{"thumbnail":"7882\/icon\/S\/icon1_0_0.png","screenshot":"7882\/icon\/S\/icon1_0_0.png","orientation":"P","device":"P"},{"thumbnail":"7882\/icon\/S\/icon1_0_0.png","screenshot":"7882\/icon\/S\/icon1_0_0.png","orientation":"P","device":"P"}]}