{"publicApplicationId":"com.appible.aguidetomenbeingencorereflectionsofabachelorgirlaudiotext","description":"This Plus version of A Guide to Men: Being Encore Reflections of a Bachelor Girl includes both audio and text so you can follow along or read without the audio.\n\nIn this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\nA series of occasionally witty one-liners, poems and considerations on the subject of Men, Women and their Conjunction. By turns tender, bland, sexist (in both directions!) and funny. Summary by Cori Samuel.\n\nFrom the text:\n\nA man is like a park squirrel; if you fling your favors or your charms at his head he will never come up and eat out of your hand.\n\nEven Satan could find a woman to call him \"Dearie,\" if he would simply tell her that all he needed was \"a beautiful woman's uplifting influence.\"\n\nEvery bride fancies that she married the original \"cave-man\" until she tries to persuade him to go out and argue with the furniture-movers.\n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.0","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"288674","installSize":"288674","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.8","currency":"USD","filename":"com.appible.aguidetomenbeingencorereflectionsofabachelorgirlaudiotext_1.0.0_all.ipk","free":false,"images":[{"thumbnail":"7896\/icon\/S\/icon1_0_0.png","screenshot":"7896\/icon\/S\/icon1_0_0.png","orientation":"P","device":"P"},{"thumbnail":"7896\/icon\/S\/icon1_0_0.png","screenshot":"7896\/icon\/S\/icon1_0_0.png","orientation":"P","device":"P"}]}