{"publicApplicationId":"com.appible.masterandmanaudiotext","description":"This Plus version of Master and Man includes both audio and text so you can follow along or read without the audio.\n\nIn this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\nA land owner, Vasili Andreevich, takes along one of his peasants, Nikita, for a short journey to another town. He wishes to get to the town quickly ‘for business’. They find themselves in the middle of a blizzard, but the master in his avarice wishes to press on. They eventually get lost off the road and they try to camp. The master’s peasant soon finds himself about to die from hypothermia. The master leaves him on the horse to stubbornly try to find the road. When he returns, he attains a spiritual\/moral revelation, and Tolstoy once again repeats one of his famous themes: that the only true happiness in life is found by living for others. (Wikipedia) \n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.0","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"279928","installSize":"279928","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.8","currency":"USD","filename":"com.appible.masterandmanaudiotext_1.0.0_all.ipk","free":false,"images":[{"thumbnail":"7900\/icon\/S\/icon1_0_0.png","screenshot":"7900\/icon\/S\/icon1_0_0.png","orientation":"P","device":"P"},{"thumbnail":"7900\/icon\/S\/icon1_0_0.png","screenshot":"7900\/icon\/S\/icon1_0_0.png","orientation":"P","device":"P"}]}