{"publicApplicationId":"com.appible.newdiscoveriesatjamestownaudio","description":"In this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\n    Chances are, you are reading this because you are aware that Jamestown, Virginia, celebrated its 400th birthday in 2007. It was the first “successful” English settlement in America. Although the colonists eventually moved upriver to be quit of the hard luck and difficult conditions on the small island, they left behind a trove of possessions – used, worn out, or forgotten.\n\n    Did you ever stop to consider just how many different items you have, need, or use, to live, work, and amuse yourself? Chances are that you would seriously underestimate! But once you put such a list together, another person could tell quite a story about the life you lead.\n\n    The puzzle of archeology is how to tell that story, just from the discovery of the traces you leave behind. Literally hundreds of thousands of artifacts have been recovered from this pioneering community during three major efforts (1903, the 1950’s, and 1994-present) to reconstruct how Europeans of the early 17th century managed to transplant themselves to a wild and hostile land.\n\n    The authors, writing for the National Park Service in 1956, relate a fascinating tale of the colonists’ resources, their possessions, and their manufactures. They relate documentary evidence from England, Virginia, and elsewhere, and then match it up with items found on the site.\n\n    (Summary by Mark F. Smith)\n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.0","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"278738","installSize":"278738","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.2","currency":"USD","filename":"com.appible.newdiscoveriesatjamestownaudio_1.0.0_all.ipk","free":false,"images":[{"thumbnail":"7902\/icon\/S\/icon1_0_0.png","screenshot":"7902\/icon\/S\/icon1_0_0.png","orientation":"P","device":"P"},{"thumbnail":"7902\/icon\/S\/icon1_0_0.png","screenshot":"7902\/icon\/S\/icon1_0_0.png","orientation":"P","device":"P"}]}