{"publicApplicationId":"com.appible.ourmutualfriendaudio","description":"In this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\nOur Mutual Friend (written in the years 1864–65) is the last novel completed by Charles Dickens and is one of his most sophisticated works, combining psychological insight with social analysis. It centres on, in the words of critic J. Hillis Miller, \"money, money, money, and what money can make of life\" but is also about human values. In the opening chapters a body is found in the Thames and identified as John Harmon, a young man recently returned to London to receive his inheritance. Were he alive, his father's will would require him to marry Bella Wilfer, a beautiful, mercenary girl whom he had never met. Instead, the money passes to the working-class Boffins, and the effects spread into various corners of London society. (Wikipedia) \n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.0","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"280472","installSize":"280472","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.2","currency":"USD","filename":"com.appible.ourmutualfriendaudio_1.0.0_all.ipk","free":false,"images":[{"thumbnail":"7903\/icon\/S\/icon1_0_0.png","screenshot":"7903\/icon\/S\/icon1_0_0.png","orientation":"P","device":"P"},{"thumbnail":"7903\/icon\/S\/icon1_0_0.png","screenshot":"7903\/icon\/S\/icon1_0_0.png","orientation":"P","device":"P"}]}