{"publicApplicationId":"com.appible.philosophyandfunofalgebraaudio","description":"In this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\nMary Everest Boole (1832-1916) was born Mary Everest in England and spent her early years in France. She married mathematician George Boole. She was the author of several works on teaching and teaching mathematics in particular.\nThis short book, Philosophy and Fun of Algebra, is meant to be read by children and introduces algebra and logic. She uses the word “algebra” broadly, defining it as a “method of solving problems by honest confession of one’s ignorance”. Using this definition, Boole introduces, in a conversational manner, the concepts of logic and algebra, illustrating these concepts with stories and anecdotes, often from biblical sources. At times, her discussion seems somewhat mystical, speaking of the imagination and angels as messengers which guide one toward the next step in a logical investigation. Boole ends the book with a reminder that algebra’s essential element is “the habitual registration of the exact limits of one’s knowledge” and a call for the public to keep this principle in mind when encountering any situation.\n(Summary written by Patricia Oakley)\n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.0","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"281248","installSize":"281248","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.2","currency":"USD","filename":"com.appible.philosophyandfunofalgebraaudio_1.0.0_all.ipk","free":false,"images":[{"thumbnail":"7905\/icon\/S\/icon1_0_0.png","screenshot":"7905\/icon\/S\/icon1_0_0.png","orientation":"P","device":"P"},{"thumbnail":"7905\/icon\/S\/icon1_0_0.png","screenshot":"7905\/icon\/S\/icon1_0_0.png","orientation":"P","device":"P"}]}