{"publicApplicationId":"com.appible.poemsofwilliamblakeaudio","description":"In this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\n    Songs of Innocence mainly consists of poems describing the innocence and joy of the natural world, advocating free love and a closer relationship with God, and most famously including Blake’s poem The Lamb. Its poems have a generally light, upbeat and pastoral feel and are typically written from the perspective of children or written about them.\n\n    Directly contrasting this, Songs of Experience instead deals with the loss of innocence after exposure to the material world and all of its mortal sin during adult life, including works such as The Tyger. Poems here are darker, concentrating on more political and serious themes. Throughout both books, many poems fall into pairs, so that a similar situation or theme can be seen in both Innocence and Experience. Many of the poems appearing in Songs of Innocence have a counterpart in Songs of Experience with opposing perspectives of the world. The disastrous end of the French Revolution caused Blake to lose faith in the goodness of mankind, explaining much of the volume’s sense of despair.\n (Summary from Wikipedia) \n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.0","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"279544","installSize":"279544","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.2","currency":"USD","filename":"com.appible.poemsofwilliamblakeaudio_1.0.0_all.ipk","free":false,"images":[{"thumbnail":"7906\/icon\/S\/icon1_0_0.png","screenshot":"7906\/icon\/S\/icon1_0_0.png","orientation":"P","device":"P"},{"thumbnail":"7906\/icon\/S\/icon1_0_0.png","screenshot":"7906\/icon\/S\/icon1_0_0.png","orientation":"P","device":"P"}]}