{"publicApplicationId":"com.appible.rupertofhentzauaudio","description":"In this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\nThis is the sequel to ‘The Prisoner of Zenda‘. Five years have passed. The King has become jealous of Rudolf Rassendyll and suspicious of the queen (Flavia)’s feelings towards him. Flavia decides that this must be the last year in which she sends to Rudolf the single red rose that betokens her love, and therefore she also sends via Fritz von Tarlenheim, her letter of good-bye.\n\nCount Rupert of Hentzau, banished from Ruritania after the incidents of the earlier book, is plotting his return. In furtherance of his scheme he obtains both letter and rose, and plots to place them before the King. Rudolf, Fritz and Sapt must prevent this at all costs… (Summary by Andy)\n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.0","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"301026","installSize":"301026","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.2","currency":"USD","filename":"com.appible.rupertofhentzauaudio_1.0.0_all.ipk","free":false,"images":[{"thumbnail":"7908\/icon\/S\/icon1_0_0.png","screenshot":"7908\/icon\/S\/icon1_0_0.png","orientation":"P","device":"P"},{"thumbnail":"7908\/icon\/S\/icon1_0_0.png","screenshot":"7908\/icon\/S\/icon1_0_0.png","orientation":"P","device":"P"}]}