{"publicApplicationId":"com.appible.thekhakikookbookaudio","description":"In this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\n    We cannot ignore the fact that we must eat, and that much as we dislike to acknowledge it, we are compelled to think a great deal about filling our stomachs. This is especially true these days, when prices have soared and soared and taken along with them, far out of the reach of many of us, certain articles of food which we heretofore have always felt were quite necessary to us.\n\n    About ten years ago the idea of writing a little cook book had its birth. We were in Almora that summer. Almora is a station far up in the Himalayas, a clean little bazaar nestles at the foot of enclosing mountains. Dotting the deodar-covered slopes of these mountains are the picturesque bungalows of the European residents, while towering above and over all are the glistening peaks of the eternal snows.\n\n    The people of India since Vedic times have eaten curry and always will. (Excerpt from text.)\n\n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.0","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"279298","installSize":"279298","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.2","currency":"USD","filename":"com.appible.thekhakikookbookaudio_1.0.0_all.ipk","free":false,"images":[{"thumbnail":"7910\/icon\/S\/icon1_0_0.png","screenshot":"7910\/icon\/S\/icon1_0_0.png","orientation":"P","device":"P"},{"thumbnail":"7910\/icon\/S\/icon1_0_0.png","screenshot":"7910\/icon\/S\/icon1_0_0.png","orientation":"P","device":"P"}]}