{"publicApplicationId":"com.appible.thepioneersaudio","description":"In this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\n    The Pioneers: The Sources of the Susquehanna; a Descriptive Tale is one of the Leatherstocking Tales, a series of five novels by American writer James Fenimore Cooper. The Pioneers was first of these books to be published (1823), but the period of time covered by the book (principally 1793) makes it the fourth chronologically. (The others are The Deerslayer, The Last of the Mohicans, The Pathfinder, and The Prairie.)\n    The story takes place on the rapidly advancing frontier of New York State and features a middle-aged Leatherstocking (Natty Bumppo), Judge Marmaduke Temple of Templeton, whose life parallels that of the author’s father Judge William Cooper, and Elizabeth (the author Susan Cooper), of Cooperstown. The story begins with an argument between the Judge and the Leatherstocking over who killed a buck, and as Cooper reviews many of the changes to his fictional Lake Otsego, questions of environmental stewardship, conservation, and use prevail. The plot develops as the Leatherstocking and Chingachgook begin to compete with the Temples for the loyalties of a young visitor, Oliver Effingham. Effingham eventually marries Elizabeth. Chingachgook dies, exemplifying the vexed figure of the “dying Indian,” and Natty vanishes into the sunset. For all its strange twists and turns, ‘The Pioneers’ may be considered one of the first ecological novels in the United States. (Summary from Wikipedia)\n\n\n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.0","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"299926","installSize":"299926","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.2","currency":"USD","filename":"com.appible.thepioneersaudio_1.0.0_all.ipk","free":false,"images":[{"thumbnail":"7911\/icon\/S\/icon1_0_0.png","screenshot":"7911\/icon\/S\/icon1_0_0.png","orientation":"P","device":"P"},{"thumbnail":"7911\/icon\/S\/icon1_0_0.png","screenshot":"7911\/icon\/S\/icon1_0_0.png","orientation":"P","device":"P"}]}