{"publicApplicationId":"com.appible.thesilverskatesaudio","description":"In this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\nMary Mapes Dodge created an instant bestseller with “Hans Brinker or The Silver Skates.” Dodge writes as if she is sending a series of letters from Holland to children in America, and her you-are-there perspective is aided by a nice attention to detail and vivid imagery.\nThe Brinkers are a poor but stoic family under a dark cloud – Raff, the man of the house, fell from the dikes while reinforcing them during a bad storm, and for ten years he has been in a vegetative state. With no steady income, the family’s lot is grinding poverty. Despite their unfortunate circumstances, Hans and Gretel are cheerful children, yet always attentive to the needs of their mother and their present-but-not-really-there father. Their social standing is very low, but they both attract firm friends, even among the gentry, for their honesty, industry, and good-heartedness.\nThen a glorious skating race is proposed for the town of Broek, with the prize a pair of silver skates for both the winning boy and girl. In the weeks leading up to the race, we follow the adventures of five of the local boys who are showing a visiting relative from England the sights of the Netherlands. Hans improbably meets the one man who might be able to heal his father, and somehow Hans finds a way to afford some skates so that he and Gretel can enter the race.\n\n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.0","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"280654","installSize":"280654","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.2","currency":"USD","filename":"com.appible.thesilverskatesaudio_1.0.0_all.ipk","free":false,"images":[{"thumbnail":"7917\/icon\/S\/icon1_0_0.png","screenshot":"7917\/icon\/S\/icon1_0_0.png","orientation":"P","device":"P"},{"thumbnail":"7917\/icon\/S\/icon1_0_0.png","screenshot":"7917\/icon\/S\/icon1_0_0.png","orientation":"P","device":"P"}]}