{"publicApplicationId":"com.appible.thewhitecompanyaudiotext","description":"This Plus version of The White Company includes both audio and text so you can follow along or read without the audio.\n\nIn this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\nSet during the Hundred Years’ War with France, The White Company tells the story of a young Saxon man who is learning what it is to be a knight. Raised by Cistercian Monks and rejected by a violent elder brother, Alleyn Edricson takes service with one of the foremost knights in the country. When Alleyn falls in love with the knight’s daughter, he must prove himself to be a courageous and honourable knight before he can win her hand. Alleyn and his friends set forth with the other men-at-arms to join Prince Edward in Bordeaux, from where they will take part in the Prince’s campaign into Spain. It is in Spain that Alleyn and others must prove themselves to be very valiant and hardy cavaliers. (Summary by Clive Catterall)\n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.0","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"304622","installSize":"304622","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.8","currency":"USD","filename":"com.appible.thewhitecompanyaudiotext_1.0.0_all.ipk","free":false,"images":[{"thumbnail":"7923\/icon\/S\/icon1_0_0.png","screenshot":"7923\/icon\/S\/icon1_0_0.png","orientation":"P","device":"P"},{"thumbnail":"7923\/icon\/S\/icon1_0_0.png","screenshot":"7923\/icon\/S\/icon1_0_0.png","orientation":"P","device":"P"}]}