{"publicApplicationId":"com.appible.thissideofparadiseaudio","description":"In this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\n    Amory Blaine grew up in a wealthy family and was given an Ivy League education. Without a need to learn a profession, he chiefly dabbled in literature and partying. His school chums were of similar background, and the ideas they reflected to each other grew in their minds to be of the greatest importance. Amory began to think of himself as somewhat of a character in a Rupert Brooke poem (from which the book’s title is taken).\n\n    World War I intervened in this happy fog and brought focus to some, doubt to others.\n\n    In the rapidly changing technology of the war era, the financial underpinnings of the Blaine fortune began to fall apart. The deaths of Amory’s parents left the finances without a rudder and as Amory’s situation deteriorated he came to realize he had only his interest in literature to fall back upon.\n\n    Meanwhile, a series of young women traipsed through his life, attracted to his handsome face and bright wit like moths to a candle. But Amory could never master the role of being a real person… and, one by one, they traipsed out.\n\n    This Side of Paradise was F. Scott Fitzgerald’s first novel and was one of the nation’s most popular books in the year it was published. It has some definite parallels with Fitzgerald’s own life, and is in some ways an autobiography. (Summary by Mark F. Smith)\n \n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.0","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"279636","installSize":"279636","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.2","currency":"USD","filename":"com.appible.thissideofparadiseaudio_1.0.0_all.ipk","free":false,"images":[{"thumbnail":"7925\/icon\/S\/icon1_0_0.png","screenshot":"7925\/icon\/S\/icon1_0_0.png","orientation":"P","device":"P"},{"thumbnail":"7925\/icon\/S\/icon1_0_0.png","screenshot":"7925\/icon\/S\/icon1_0_0.png","orientation":"P","device":"P"}]}