{"publicApplicationId":"com.appible.astudyinscarletaudio","description":"In this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\nA Study in Scarlet, a short novel published in 1887, was Sir Arthur Conan Doyle’s first Sherlock Holmes story. At the beginning of the book, Dr. Watson meets the detective for the first time and we ride along with them to the scene of a murder. The crime baffles the Scotland Yard detectives, but of course Holmes solves it easily. In the second half of the story, the scene shifts to Utah as we learn the murderer’s history. The action returns to London in the last two chapters. In his first adventure, Holmes demonstrates many of the traits for which he later became well known: meticulous study of a crime scene, brilliant deductive reasoning, aptitude for chemistry and music, and the somewhat annoying habit of withholding crucial facts from Watson (and consequently the reader) until the conclusion of the case. (Summary by Laurie Anne Walden)\n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.0","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"289264","installSize":"289264","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.2","currency":"USD","filename":"com.appible.astudyinscarletaudio_1.0.0_all.ipk","free":false,"images":[{"thumbnail":"7962\/icon\/S\/icon1_0_0.png","screenshot":"7962\/icon\/S\/icon1_0_0.png","orientation":"P","device":"P"},{"thumbnail":"7962\/icon\/S\/icon1_0_0.png","screenshot":"7962\/icon\/S\/icon1_0_0.png","orientation":"P","device":"P"}]}