{"publicApplicationId":"com.appible.fannyherselfaudio","description":"In this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\nFanny Herself is the story of Fanny Brandeis, a sensitive, young Jewish girl coming of age in the Midwest at the turn of the 20th century. It is generally considered to have been based on Ferber’s own experiences growing up in Appleton, Wisconsin. Fanny’s inner struggle between her compassionate, artistic side and her desire for financial independence as a successful young businesswoman is the recurring theme of the novel. Ferber’s engaging style of writing will quickly draw you into her story. Regarded by many to be the “greatest American woman novelist of her day,” Edna Ferber would go on to win the Pulitzer Prize in a 1925 for her book So Big, and is also the author of Showboat and Cimarron, which along with other of her later works were successfully adapted for stage and screen. (summary by J. M. Smallheer) \n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.0","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"278840","installSize":"278840","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.2","currency":"USD","filename":"com.appible.fannyherselfaudio_1.0.0_all.ipk","free":false,"images":[{"thumbnail":"7965\/icon\/S\/icon1_0_0.png","screenshot":"7965\/icon\/S\/icon1_0_0.png","orientation":"P","device":"P"},{"thumbnail":"7965\/icon\/S\/icon1_0_0.png","screenshot":"7965\/icon\/S\/icon1_0_0.png","orientation":"P","device":"P"}]}