{"publicApplicationId":"com.appible.loveandfriendshipaudio","description":"In this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\nLove and Freindship [sic] is a juvenile story by Jane Austen, dated 1790, when Austen was 14 years old. Love and Freindship  (the misspelling is one of many in the story) is clearly a parody of romantic novels Austen read as a child. This is clear even from the subtitle, “Deceived in Freindship and Betrayed in Love,” which neatly undercuts the title.\n\nWritten in epistolary form, it resembles a fairy tale as much as anything else, featuring wild coincidences and turns of fortune, but Austen is determined to lampoon the conventions of romantic stories, right down to the utter failure of romantic fainting spells, which always turn out dreadfully for the female characters.\n\nIn this story one can see the development of Austen’s sharp wit and disdain for romantic sensibility, so characteristic of her later novels.\n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.0","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"279476","installSize":"279476","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.2","currency":"USD","filename":"com.appible.loveandfriendshipaudio_1.0.0_all.ipk","free":false,"images":[{"thumbnail":"7969\/icon\/S\/icon1_0_0.png","screenshot":"7969\/icon\/S\/icon1_0_0.png","orientation":"P","device":"P"},{"thumbnail":"7969\/icon\/S\/icon1_0_0.png","screenshot":"7969\/icon\/S\/icon1_0_0.png","orientation":"P","device":"P"}]}