{"publicApplicationId":"com.appible.thearabianartoftamingandtrainingwildandvicioushorsesaudio","description":"In this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\nBack in the day before automobiles, a good horse trainer and veterinarian was the equivalent of “Mr Goodwrench”. A badly behaving or unhealthy equine was equivalent to breaking down on the highway or running out of gas on a lonely stretch of highway somewhere in Utah. My sources tell me that most of the training methods are ok, but stay away from the medical tips unless you are prepared to become the poster boy or girl for the local SPCA. Listen with tongue in cheek, and check with a professional before attempting any of these techniques on a real animal. Summary by Mike Vendetti. \n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.0","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"281554","installSize":"281554","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.2","currency":"USD","filename":"com.appible.thearabianartoftamingandtrainingwildandvicioushorsesaudio_1.0.0_all.ipk","free":false,"images":[{"thumbnail":"7975\/icon\/S\/icon1_0_0.png","screenshot":"7975\/icon\/S\/icon1_0_0.png","orientation":"P","device":"P"},{"thumbnail":"7975\/icon\/S\/icon1_0_0.png","screenshot":"7975\/icon\/S\/icon1_0_0.png","orientation":"P","device":"P"}]}