{"publicApplicationId":"com.appible.thesoulofmanaudio","description":"In this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\n“The past is what man should not have been. The present is what man ought not to be. The future is what artists are.”\n\nPublished originally as “The Soul of Man Under Socialism,” this is not so much a work of sober political analysis; rather it can be summed up as a rhapsodic manifesto on behalf of the Individual. Socialism having deployed technology to liberate the whole of humanity from soul-destroying labour, the State obligingly withers away to allow the free development of a joyful, anarchic hedonism...\n\n“Is this Utopian? A map of the world that does not include Utopia is not worth even glancing at, for it leaves out the one country at which Humanity is always landing.”\n\nFar from abandoning the epigram in favour of the slogan, Wilde wittily assails several of his favourite targets: the misguided purveyors of philanthropy; life-denying ascetics of various kinds; the army of the half-educated who constitute themselves the enemies of Art - and those venal popular journalists who cater to them...\n\n“Behind the barricade there may be much that is noble and heroic. But what is there behind the leading-article but prejudice, stupidity, cant, and twaddle?” (Introduction by Martin Geeson) \n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.0","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"277880","installSize":"277880","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.2","currency":"USD","filename":"com.appible.thesoulofmanaudio_1.0.0_all.ipk","free":false,"images":[{"thumbnail":"7980\/icon\/S\/icon1_0_0.png","screenshot":"7980\/icon\/S\/icon1_0_0.png","orientation":"P","device":"P"},{"thumbnail":"7980\/icon\/S\/icon1_0_0.png","screenshot":"7980\/icon\/S\/icon1_0_0.png","orientation":"P","device":"P"}]}