{"publicApplicationId":"com.appible.thetragedyofthekoroskoaudio","description":"In this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\n    The Tragedy of the Korosko (1898)\n\n    Sir Arthur Ignatius Conan Doyle, DL (22 May 1859 – 7 July 1930) was a British author most noted for his stories about the detective Sherlock Holmes, which are generally considered a major innovation in the field of crime fiction, and for the adventures of Professor Challenger. He was a prolific writer whose other works include science fiction stories, historical novels, plays and romances, poetry, and non-fiction.\n\n    Plot Summary: A group of European and American tourists is enjoying its trip in Egypt in the year 1895. They are sailing up the River Nile in a “a turtle-bottomed, round-bowed stern-wheeler”, the Korosko. They intend to travel to Abousir at the southern frontier of Egypt, after which the Dervish country starts. They are attacked and abducted by a marauding band of Dervish warriors. (Summary from Wikipedia)\n\n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.0","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"298598","installSize":"298598","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.2","currency":"USD","filename":"com.appible.thetragedyofthekoroskoaudio_1.0.0_all.ipk","free":false,"images":[{"thumbnail":"7983\/icon\/S\/icon1_0_0.png","screenshot":"7983\/icon\/S\/icon1_0_0.png","orientation":"P","device":"P"},{"thumbnail":"7983\/icon\/S\/icon1_0_0.png","screenshot":"7983\/icon\/S\/icon1_0_0.png","orientation":"P","device":"P"}]}