{"publicApplicationId":"com.appible.thetragicbrideaudio","description":"In this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\nThe story centers on Gabrielle Hewish, only and lonely child of Sir Jocelyn Hewish, a loveable lush and owner of the peaceful Roscarna estate nestled in the Irish countryside. In due course, young Gabrielle falls in love with a Navy man whose untimely demise sends her into a depression, and the consequences of which alter her future, culminating in a fascinating and quite unpredictable relationship with Mrs. Payne and her troubled son Arthur. A story of understanding in it’s finest sense and aptly titled, The Tragic Bride is both interesting as a story and telling as a character study. (Summary by Roger Melin)\n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.0","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"279342","installSize":"279342","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.2","currency":"USD","filename":"com.appible.thetragicbrideaudio_1.0.0_all.ipk","free":false,"images":[{"thumbnail":"7986\/icon\/S\/icon1_0_0.png","screenshot":"7986\/icon\/S\/icon1_0_0.png","orientation":"P","device":"P"},{"thumbnail":"7986\/icon\/S\/icon1_0_0.png","screenshot":"7986\/icon\/S\/icon1_0_0.png","orientation":"P","device":"P"}]}