{"publicApplicationId":"com.appible.thetreedwellersaudio","description":"In this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\nKatharine E. Dopp was well-known as a teacher and writer of children’s textbooks at the turn of the 20th Century. She was among the first educators to encourage the incorporation of physical and practical activity into the elementary school curriculum at a time when such activities were becoming less commonplace in a child’s home environment. The Tree-Dwellers – The Age of Fear is the first in a series of elementary school texts written by Ms. Dopp that focus on the anthropological development of early human groups. Each lesson begins by posing a few questions for the child to think about, then factual information about these early humans is presented in story form using language a 6-7 yr old child can easily read and understand, followed by suggested activities that will help the child to experience first-hand some of the points presented in the story. The book also contains suggestions and references for teachers to aid in the successful use of the text. (Summary by J. M. Smallheer) \n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.0","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"279140","installSize":"279140","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.2","currency":"USD","filename":"com.appible.thetreedwellersaudio_1.0.0_all.ipk","free":false,"images":[{"thumbnail":"7987\/icon\/S\/icon1_0_0.png","screenshot":"7987\/icon\/S\/icon1_0_0.png","orientation":"P","device":"P"},{"thumbnail":"7987\/icon\/S\/icon1_0_0.png","screenshot":"7987\/icon\/S\/icon1_0_0.png","orientation":"P","device":"P"}]}