{"publicApplicationId":"com.appible.thevalleyofthegiantsaudio","description":"In this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\nThe man was John Cardigan; in that lonely, hostile land he was the first pioneer. This is the tale of Cardigan and Cardigan’s son, for in his chosen land the pioneer leader in the gigantic task of hewing a path for civilization was to know the bliss of woman’s love and of parenthood, and the sorrow that comes of the loss of a perfect mate; he was to know the tremendous joy of accomplishment and worldly success after infinite labour; and in the sunset of life he was to know the dull despair of failure and ruin. Because of these things there is a tale to be told, the tale of Cardigan’s son, who, when his sire fell in the fray, took up the fight to save his heritage–a tale of life with its love and hate, its battle, victory, defeat, labour, joy, and sorrow, a tale of that unconquerable spirit of youth which spurred Bryce Cardigan to lead a forlorn hope for the sake not of wealth but of an ideal. (Summary from the text)\n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.0","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"280932","installSize":"280932","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.2","currency":"USD","filename":"com.appible.thevalleyofthegiantsaudio_1.0.0_all.ipk","free":false,"images":[{"thumbnail":"7989\/icon\/S\/icon1_0_0.png","screenshot":"7989\/icon\/S\/icon1_0_0.png","orientation":"P","device":"P"},{"thumbnail":"7989\/icon\/S\/icon1_0_0.png","screenshot":"7989\/icon\/S\/icon1_0_0.png","orientation":"P","device":"P"}]}