{"publicApplicationId":"com.appible.theyoungrailroadersaudio","description":"In this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\nWhile aimed at youths, this series of tales of the just-opening West makes a rollicking good story for adults, too. Three teen-age boys, trained as telegraphers, manage to get themselves in and out of a wide variety of harrowing circumstances. Using their knowledge of Morse code, the science of telegraphs, and the operation of railroads, the boys stir in native resourcefulness, quick-thinking, and when the occasion demands it, raw courage – to effect rescues, thwart thieves, and solve mysteries. If Tom Swift had lived in the nineteenth century, he could not have had more exciting escapades! (Summary by Mark F. Smith)\n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.0","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"299762","installSize":"299762","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.2","currency":"USD","filename":"com.appible.theyoungrailroadersaudio_1.0.0_all.ipk","free":false,"images":[{"thumbnail":"7995\/icon\/S\/icon1_0_0.png","screenshot":"7995\/icon\/S\/icon1_0_0.png","orientation":"P","device":"P"},{"thumbnail":"7995\/icon\/S\/icon1_0_0.png","screenshot":"7995\/icon\/S\/icon1_0_0.png","orientation":"P","device":"P"}]}