{"publicApplicationId":"com.appible.athousandmilesupthenileaudio","description":"In this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\n    Amelia B. Edwards wrote this historical, egyptological, and cultural study in in 1877, and it became an immediate best-seller, reprinted in 1888 at home in England and abroad. She travelled throughout Egypt at a time when most women didn’t leave home. One of the pioneering Egyptologists of the age, she established the Edwards Chair of Egyptology, occupied first by the great Sir William Matthew Flinders Petrie.\n\n    This book is in a sense a seminal work, known to have influenced the modern writings of Elizabeth Peters in her Amelia Peabody Emerson murder-mystery series.\n    (Summary by Sibella Denton)\n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.0","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"279772","installSize":"279772","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.2","currency":"USD","filename":"com.appible.athousandmilesupthenileaudio_1.0.0_all.ipk","free":false,"images":[{"thumbnail":"8002\/icon\/S\/icon1_0_0.png","screenshot":"8002\/icon\/S\/icon1_0_0.png","orientation":"P","device":"P"},{"thumbnail":"8002\/icon\/S\/icon1_0_0.png","screenshot":"8002\/icon\/S\/icon1_0_0.png","orientation":"P","device":"P"}]}