{"publicApplicationId":"com.appible.holysonnetsaudio","description":"In this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\n    John Donne (1572 – March 31, 1631) was a Jacobean poet and preacher, representative of the metaphysical poets of the period. His works, notable for their realistic and sensual style, include sonnets, love poetry, religious poems, Latin translations, epigrams, elegies, songs, satires and sermons. His poetry is noted for its vibrancy of language and immediacy of metaphor, compared with that of his contemporaries.\n\n    Towards the end of his life Donne wrote works that challenged death, and the fear that it inspired in many men, on the grounds of his belief that those who die are sent to Heaven to live eternally. One example of this challenge is his Holy Sonnet X, from which come the famous lines “Death, be not proud, though some have called thee mighty and dreadful, for thou art not so.”\n\n    (Summary from Wikipedia)\n\n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.0","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"279468","installSize":"279468","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.2","currency":"USD","filename":"com.appible.holysonnetsaudio_1.0.0_all.ipk","free":false,"images":[{"thumbnail":"8007\/icon\/S\/icon1_0_0.png","screenshot":"8007\/icon\/S\/icon1_0_0.png","orientation":"P","device":"P"},{"thumbnail":"8007\/icon\/S\/icon1_0_0.png","screenshot":"8007\/icon\/S\/icon1_0_0.png","orientation":"P","device":"P"}]}