{"publicApplicationId":"com.appible.ladyaudleyssecretaudio","description":"In this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\nMary Elizabeth Braddon’s first novel, Lady Audley’s Secret, was one of the most popular English novels of its day. Published serially in 1862, it tells the story of the lovely Lucy Graham, who becomes Lady Audley at the beginning of the novel, and who conceals a scandalous secret from her new husband and his family. The plot, which includes madness, bigamy, attempted murder, and seduction, made this a shocking but highly successful story for Victorian audiences. It remains one of the best examples of 19th century sensational fiction, and is a wonderfully absorbing book. (Summary written by gloriana).\n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.0","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"279698","installSize":"279698","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.2","currency":"USD","filename":"com.appible.ladyaudleyssecretaudio_1.0.0_all.ipk","free":false,"images":[{"thumbnail":"8008\/icon\/S\/icon1_0_0.png","screenshot":"8008\/icon\/S\/icon1_0_0.png","orientation":"P","device":"P"},{"thumbnail":"8008\/icon\/S\/icon1_0_0.png","screenshot":"8008\/icon\/S\/icon1_0_0.png","orientation":"P","device":"P"}]}