{"publicApplicationId":"com.appible.oroonokoortheroyalslaveaudio","description":"In this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\n    Aphra Behn was the first woman writer in England to make a living by her pen, and her novel Oroonoko  was the first work published in English to express sympathy for African slaves. Perhaps based partly on Behn’s own experiences living in Surinam, the novel tells the tragic story of a noble slave, Oroonoko, and his love Imoinda. The work was an instant success and was adapted for the stage in 1695 (and more recently by the Royal Shakespeare Company in 1999).\n\n    Behn’s work paved the way for women writers who came after her, as Virginia Woolf noted in a Room of One’s Own (1928): “All women together ought to let flowers fall upon the tomb of Aphra Behn, … for it was she who earned them the right to speak their minds.”\n    (Summary by Elizabeth Klett)\n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.0","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"280278","installSize":"280278","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.2","currency":"USD","filename":"com.appible.oroonokoortheroyalslaveaudio_1.0.0_all.ipk","free":false,"images":[{"thumbnail":"8014\/icon\/S\/icon1_0_0.png","screenshot":"8014\/icon\/S\/icon1_0_0.png","orientation":"P","device":"P"},{"thumbnail":"8014\/icon\/S\/icon1_0_0.png","screenshot":"8014\/icon\/S\/icon1_0_0.png","orientation":"P","device":"P"}]}