{"publicApplicationId":"com.appible.theatomicbombingsofhiroshimaaudio","description":"In this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\nThis is the official report, published nearly 11 months after the first and only atomic bombings in history (to date), of a group of military physicians and engineers who accompanied the initial contingent of U.S. soldiers into the destroyed cities of Hiroshima and Nagasaki. The report presents a clinical description of the devastation, loss of life and continued suffering of the survivors that resulted from the world’s first and only atomic bombings. The appendix is an eyewitness account, contrasting vividly with the dispassionate sang-froid of the report itself, written by a German Jesuit priest who survived the blast at Hiroshima, and whose order assisted in rescue efforts following the catastrophic attack. This recording was completed on the 63rd anniversary of the events. (Summary by Dennis Sayers).\n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.0","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"278936","installSize":"278936","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.2","currency":"USD","filename":"com.appible.theatomicbombingsofhiroshimaaudio_1.0.0_all.ipk","free":false,"images":[{"thumbnail":"8017\/icon\/S\/icon1_0_0.png","screenshot":"8017\/icon\/S\/icon1_0_0.png","orientation":"P","device":"P"},{"thumbnail":"8017\/icon\/S\/icon1_0_0.png","screenshot":"8017\/icon\/S\/icon1_0_0.png","orientation":"P","device":"P"}]}