{"publicApplicationId":"com.appible.themirroroftheseaaudiotext","description":"This Plus version of The Mirror of the Sea includes both audio and text so you can follow along or read without the audio.\n\nIn this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\n    The Mirror of the Sea is a collection of autobiographical essays first published in various magazines 1904-6 (Summary by Wikipedia). Conrad early in his life earned his bread as a Master Mariner in sailing ships. In his Author’s Note to this work, Conrad states,”Beyond the line of the sea horizon the world for me did not exist….Within these pages I make a full confession not of my sins but of my emotions. It is the best tribute my piety can offer to the ultimate shapers of my character, convictions, and, in a sense, destiny—to the imperishable sea, to the ships that are no more, and to the simple men who have had their day.” \n\n\n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.0","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"280910","installSize":"280910","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.8","currency":"USD","filename":"com.appible.themirroroftheseaaudiotext_1.0.0_all.ipk","free":false,"images":[{"thumbnail":"8019\/icon\/S\/icon1_0_0.png","screenshot":"8019\/icon\/S\/icon1_0_0.png","orientation":"P","device":"P"},{"thumbnail":"8019\/icon\/S\/icon1_0_0.png","screenshot":"8019\/icon\/S\/icon1_0_0.png","orientation":"P","device":"P"}]}