{"publicApplicationId":"com.appible.thetouchstoneaudiotext","description":"This Plus version of The Touchstone includes both audio and text so you can follow along or read without the audio.\n\nIn this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\nStephen Glennard's career is falling apart and he desperately needs money so that he may marry his beautiful fiancee. He happens upon an advertisement in a London magazine promising the prospect of financial gain. Glennard was once pursued by Margaret Aubyn, a famous and recently deceased author, and he still has her passionate love letters to him. Glennard removes his name from the letters and sells them, making him a fortune and building a marriage based on the betrayal of another. (Summary by Wikipedia) \n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.0","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"277670","installSize":"277670","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.8","currency":"USD","filename":"com.appible.thetouchstoneaudiotext_1.0.0_all.ipk","free":false,"images":[{"thumbnail":"8024\/icon\/S\/icon1_0_0.png","screenshot":"8024\/icon\/S\/icon1_0_0.png","orientation":"P","device":"P"},{"thumbnail":"8024\/icon\/S\/icon1_0_0.png","screenshot":"8024\/icon\/S\/icon1_0_0.png","orientation":"P","device":"P"}]}