{"publicApplicationId":"com.appible.theworldiliveinaudio","description":"In this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\n    The World I Live In by Helen Keller is a collection of essays that poignantly tells of her impressions of the world, through her sense of touch, smell, her imagination and dreams.\n\n    My hand is to me what your hearing and sight together are to you. In large measure we travel the same highways, read the same books, speak the same language, yet our experiences are different. All my comings and goings turn on the hand as on a pivot. It is the hand that binds me to the world of men and women. The hand is my feeler with which I reach through isolation and darkness and seize every pleasure, every activity that my fingers encounter. With the dropping of a little word from another’s hand into mine, a slight flutter of the fingers, began the intelligence, the joy, the fullness of my life. Helen Keller, quoted from her essay, The Seeing Hand\n    (Summary from text and Laura Caldwell)\n\n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.0","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"280578","installSize":"280578","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.2","currency":"USD","filename":"com.appible.theworldiliveinaudio_1.0.0_all.ipk","free":false,"images":[{"thumbnail":"8026\/icon\/S\/icon1_0_0.png","screenshot":"8026\/icon\/S\/icon1_0_0.png","orientation":"P","device":"P"},{"thumbnail":"8026\/icon\/S\/icon1_0_0.png","screenshot":"8026\/icon\/S\/icon1_0_0.png","orientation":"P","device":"P"}]}