{"publicApplicationId":"com.appible.theworldsetfreeaudiotext","description":"This Plus version of The World Set Free includes both audio and text so you can follow along or read without the audio.\n\nIn this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\n    The World Set Free is a novel published in 1914 by H. G. Wells. The book is considered a prophetical novel foretelling the advent of nuclear weapons.\n\n    A constant theme in Wells’s work, such as his 1901 nonfiction book Anticipations, was the role of energy and technological advance as a determinant of human progress.\n\n    The novel opens: “The history of mankind is the history of the attainment of external power. Man is the tool-using, fire-making animal.” Scientists of the day were well aware that the slow natural radioactive decay of elements like radium continues for thousands of years, and that while the rate of energy release is negligible, the total amount released is huge. Wells used this as the basis for his story.\n\n    (Summary on Wikipedia)\n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.0","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"281592","installSize":"281592","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.8","currency":"USD","filename":"com.appible.theworldsetfreeaudiotext_1.0.0_all.ipk","free":false,"images":[{"thumbnail":"8027\/icon\/S\/icon1_0_0.png","screenshot":"8027\/icon\/S\/icon1_0_0.png","orientation":"P","device":"P"},{"thumbnail":"8027\/icon\/S\/icon1_0_0.png","screenshot":"8027\/icon\/S\/icon1_0_0.png","orientation":"P","device":"P"}]}