{"publicApplicationId":"com.appible.wutheringheightsaudio","description":"In this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\n    Emily Brontë’s only novel, published in 1847 under the pseudonym Ellis Bell, tells the tale of the all-encompassing and passionate, yet thwarted, love between Heathcliff and Catherine Earnshaw, and how this unresolved passion eventually destroys them and many around them.\n\n    Now considered a classic of English literature, Wuthering Heights met with mixed reviews by critics when it first appeared, with many horrified by the stark depictions of mental and physical cruelty. Though Charlotte Brontë’s Jane Eyre was originally considered the best of the Brontë sisters’ works, many subsequent critics of Wuthering Heights argued that its originality and achievement made it superior. (Summary by Wikipedia)\n\n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.0","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"285704","installSize":"285704","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.2","currency":"USD","filename":"com.appible.wutheringheightsaudio_1.0.0_all.ipk","free":false,"images":[{"thumbnail":"8030\/icon\/S\/icon1_0_0.png","screenshot":"8030\/icon\/S\/icon1_0_0.png","orientation":"P","device":"P"},{"thumbnail":"8030\/icon\/S\/icon1_0_0.png","screenshot":"8030\/icon\/S\/icon1_0_0.png","orientation":"P","device":"P"}]}