{"publicApplicationId":"com.appible.americanindianfairytalesaudio","description":"In this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\nWith no written language, Native Americans living in the Lake Superior region passed their cultural identity down through the generations by way of stories. Far more than mere tales to amuse children, they passed along the collective wisdom of the tribes. In the 1830s, government Indian Agent and ethnologist Henry R Schoolcraft learned the language of these people and went out to collect and preserve their stories before the tribes disappeared under the westward rush of American civilization. Though these stories were recast as children’s fairy tales in the 1920s, they contain much of the old wisdom of a culture which has largely disappeared. (Summary by Chip)\n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.0","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"280860","installSize":"280860","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.2","currency":"USD","filename":"com.appible.americanindianfairytalesaudio_1.0.0_all.ipk","free":false,"images":[{"thumbnail":"8031\/icon\/S\/icon1_0_0.png","screenshot":"8031\/icon\/S\/icon1_0_0.png","orientation":"P","device":"P"},{"thumbnail":"8031\/icon\/S\/icon1_0_0.png","screenshot":"8031\/icon\/S\/icon1_0_0.png","orientation":"P","device":"P"}]}