{"publicApplicationId":"com.appible.greylornaudiotext","description":"This Plus version of Greylorn includes both audio and text so you can follow along or read without the audio.\n\nIn this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\n    Commander Greylorn has a problem. No, actually he has two of them. It’s not enough that the remaining residents of Earth have pinned their last hope of salvation on him and his mission. He has to find a colony that presumedly was established at an unknown star two centuries before and beg their help. But first, he has the small matter of a mutiny on board his starship, and people are trying to kill him!\n    Written in an era when radios used vacuum tubes, the scientific component of the story is quaint and dated. But Laumer makes the centerpiece of his tale the retelling of how, four years out on the voyage, his crew decides it wants to give up and go home when it meets an alien race… that apparently breeds humans in captivity as food animals!\n    Beating the aliens, shanghaiing the crew, finding the colony and saving Mother Earth – just the ingredients for a rattling good yarn! (summary by Mark F. Smith)\n\n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.0","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"302678","installSize":"302678","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.8","currency":"USD","filename":"com.appible.greylornaudiotext_1.0.0_all.ipk","free":false,"images":[{"thumbnail":"8037\/icon\/S\/icon1_0_0.png","screenshot":"8037\/icon\/S\/icon1_0_0.png","orientation":"P","device":"P"},{"thumbnail":"8037\/icon\/S\/icon1_0_0.png","screenshot":"8037\/icon\/S\/icon1_0_0.png","orientation":"P","device":"P"}]}