{"publicApplicationId":"com.appible.kitchenersmobadventuresofanamericaninthebritisharmyaudio","description":"In this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\n“Pvt Ryan”, “Platoon”, “A Soldier’s Home”, “Kitchener’s Mob”. These aren’t happy stories, they are about the experience of War. War at different times, and although modern warfare may be more sanitized, the adventure, the horror, the emotions don’t change. James Norman Hall has been there. He “Saw the Elephant”, and his portrayal of his WWI experience is a tribute to those ordinary people who do such extraordinary things.\n\nThose who have served will identify with at least some part if not all of this book, be it the rigors of training, the camaraderie, or possibly those memories that try as you may, you can never make go away. Those who haven’t may gain insight and possibly more respect for those who have.\n\nTommy Atkins is a universal soldier, be he the cook that serves up a hot meal, the sniper that keeps score on the stock of his rifle, or the machine gunner who hates his job. As I narrated this book, I had to stop and compose myself more than once. I could almost feel Hall’s presence, telling Tommy’s story.\n\nMike Vendetti, Narrator\n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.0","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"304818","installSize":"304818","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.2","currency":"USD","filename":"com.appible.kitchenersmobadventuresofanamericaninthebritisharmyaudio_1.0.0_all.ipk","free":false,"images":[{"thumbnail":"8040\/icon\/S\/icon1_0_0.png","screenshot":"8040\/icon\/S\/icon1_0_0.png","orientation":"P","device":"P"},{"thumbnail":"8040\/icon\/S\/icon1_0_0.png","screenshot":"8040\/icon\/S\/icon1_0_0.png","orientation":"P","device":"P"}]}