{"publicApplicationId":"com.appible.overthetopaudiotext","description":"This Plus version of Over the Top includes both audio and text so you can follow along or read without the audio.\n\nIn this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\n    Arthur Guy Empey was an American who responded to the sinking of the Lusitania by enlisting with the British Army to fight in France. His experiences in the trenches, including his ultimate wounding and convalescence, became this book. When published in 1917, it was a major hit and helped the recruiting effort when America entered the Great War.\n\n    If you’ve heard of the horror of trench warfare in WWI and want to see it from below dirt level, Empey offers it all here.\n\n    Also included is Empey’s popular “Tommy’s Dictionary of the Trenches” which humorously demistifies the slang used by the British soldier. (Summary by Mark F. Smith)\n\n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.0","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"301252","installSize":"301252","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.8","currency":"USD","filename":"com.appible.overthetopaudiotext_1.0.0_all.ipk","free":false,"images":[{"thumbnail":"8043\/icon\/S\/icon1_0_0.png","screenshot":"8043\/icon\/S\/icon1_0_0.png","orientation":"P","device":"P"},{"thumbnail":"8043\/icon\/S\/icon1_0_0.png","screenshot":"8043\/icon\/S\/icon1_0_0.png","orientation":"P","device":"P"}]}