{"publicApplicationId":"com.appible.otherpeoplesmoneyaudio","description":"In this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\nOther People's Money and How the Bankers Use It is a collection of essays written by Louis Brandeis published as a book in 1914. The book attacked the use of investment funds to promote the consolidation of various industries under the control of a small number of corporations, which Brandeis alleged were working in concert to prevent competition. Brandeis harshly criticized investment bankers who controlled large amounts of money deposited in their banks by middle-class people. These companies, in turn, sought to maintain control of their industries by crushing small businesses and stamping out innovators who developed better products to compete against them. Brandeis supported his contentions with a discussion of the actual dollar amounts -- in millions of dollars -- controlled by specific banks, industries, and industrialists such as J. P. Morgan. He extensively cited testimony from a Congressional investigation performed by the Pujo Committee, named after Louisiana Representative Arsène Pujo, into self-serving and monopolistic business dealing. The book received great publicity at the time, and was widely lauded by legal academics. Attention to the book was amplified by Brandeis' nomination to the Supreme Court of the United States in 1916.(Summary by Wikipedia) \n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.0","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"280134","installSize":"280134","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.2","currency":"USD","filename":"com.appible.otherpeoplesmoneyaudio_1.0.0_all.ipk","free":false,"images":[{"thumbnail":"8044\/icon\/S\/icon1_0_0.png","screenshot":"8044\/icon\/S\/icon1_0_0.png","orientation":"P","device":"P"},{"thumbnail":"8044\/icon\/S\/icon1_0_0.png","screenshot":"8044\/icon\/S\/icon1_0_0.png","orientation":"P","device":"P"}]}