{"publicApplicationId":"com.appible.royalchildrenofenglishhistoryaudio","description":"In this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\n    From the first chapter: “History is a story, a story of things that happened to real live people in our England years ago; and the things that are happening here and now, and that are put in the newspapers, will be history for little children one of these days. And the people you read about in history were real live people, who were good and bad, and glad and sorry, just as people are now-a-days.”\n\n    E. Nesbit writes about some of the people behind the names, dates and battles of English History in this lovely book for older children. The original book contains some beautiful illustrations and you can see those by clicking the ‘Gutenberg’ link below. Summary by Cori Samuel. \n\n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.0","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"281656","installSize":"281656","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.2","currency":"USD","filename":"com.appible.royalchildrenofenglishhistoryaudio_1.0.0_all.ipk","free":false,"images":[{"thumbnail":"8046\/icon\/S\/icon1_0_0.png","screenshot":"8046\/icon\/S\/icon1_0_0.png","orientation":"P","device":"P"},{"thumbnail":"8046\/icon\/S\/icon1_0_0.png","screenshot":"8046\/icon\/S\/icon1_0_0.png","orientation":"P","device":"P"}]}