{"publicApplicationId":"com.appible.theswissfamilyrobinsonaudio","description":"In this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\n    First published in 1812, The Swiss Family Robinson  may sometimes seem old-fashioned to modern readers, especially the family’s attitude toward wildlife (if it moves, shoot it). However, it’s a truly exciting adventure and a timeless story of warm and loving family life.\n\n    As the narrator says: “It was written… for the instruction and amusement of my children… Children are, on the whole, very much alike everywhere, and you four lads fairly represent multitudes… It will make me happy to think that my simple narrative may lead some of these to observe how blessed are the results of patient continuance in well-doing, what benefits arise from the thoughtful application of knowledge and science, and how good and pleasant a thing it is when brethren dwell together in unity, under the eye of parental love.”\n\n    Written by Swiss pastor Johann David Wyss and edited by his son Johann Rudolf Wyss (this edition lists J.R. as the author), the novel was intended to teach his four sons about family values, good husbandry, the uses of the natural world, and self-reliance. It’s fun to think of the long-ago author reading his own books of natural history and writing this novel to share his interests with his boys. (summary by Kara)\n \n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.0","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"301458","installSize":"301458","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.2","currency":"USD","filename":"com.appible.theswissfamilyrobinsonaudio_1.0.0_all.ipk","free":false,"images":[{"thumbnail":"8052\/icon\/S\/icon1_0_0.png","screenshot":"8052\/icon\/S\/icon1_0_0.png","orientation":"P","device":"P"},{"thumbnail":"8052\/icon\/S\/icon1_0_0.png","screenshot":"8052\/icon\/S\/icon1_0_0.png","orientation":"P","device":"P"}]}