{"publicApplicationId":"com.appible.thetrespasseraudiotext","description":"This Plus version of The Trespasser includes both audio and text so you can follow along or read without the audio.\n\nIn this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\nBrief Encounter meets Tristan und Isolde – on the Isle of Wight, under a vast sky florid with stars. The consequence is tragic indeed for one of the parties, Siegmund, when he sacrifices family life for a few days’ transcendent rapture. His lover, the self-contained Helena, is strong enough to bear a return to the scruffy suburbs. Redemption of a kind is granted to the deserted wife, Beatrice. But between these robust Lawrentian women Siegmund is cancelled out. His love-death is no cosmic swoon but a sordid exit in an unkempt box-room.\n\nIn this very British romance, there is no earthly escape from outworn attachments and life’s deadening routine… (Summary by Martin Geeson)\n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.0","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"288592","installSize":"288592","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.8","currency":"USD","filename":"com.appible.thetrespasseraudiotext_1.0.0_all.ipk","free":false,"images":[{"thumbnail":"8056\/icon\/S\/icon1_0_0.png","screenshot":"8056\/icon\/S\/icon1_0_0.png","orientation":"P","device":"P"},{"thumbnail":"8056\/icon\/S\/icon1_0_0.png","screenshot":"8056\/icon\/S\/icon1_0_0.png","orientation":"P","device":"P"}]}