{"publicApplicationId":"com.appible.edisonhislifeandinventionsaudiotext","description":"This Plus version of Edison, His Life and Inventions includes both audio and text so you can follow along or read without the audio.\n\nIn this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\nA detailed biography of Thomas Alva Edison, inventor of such things as the telephone, the microphone, the electric motor, the storage battery, and the electric light. In the words of the authors, “It is designed in these pages to bring the reader face to face with Edison; to glance at an interesting childhood and a youthful period marked by a capacity for doing things, and by an insatiable thirst for knowledge; then to accompany him into the great creative stretch of forty years, during which he has done so much. This book shows him plunged deeply into work for which he has always had an incredible capacity, reveals the exercise of his unsurpassed inventive ability, his keen reasoning powers, his tenacious memory, his fertility of resource; follows him through a series of innumerable experiments, conducted methodically, reaching out like rays of search-light into all the regions of science and nature, and finally exhibits him emerging triumphantly from countless difficulties bearing with him in new arts the fruits of victorious struggle.”\n(Summary by Justin Barrett, with authors’ quote taken from the work itself)\n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.5","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"278654","installSize":"278654","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.8","currency":"USD","filename":"com.appible.edisonhislifeandinventionsaudiotext_1.0.5_all.ipk","free":false,"images":[{"thumbnail":"8098\/icon\/S\/icon1_0_5.png","screenshot":"8098\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"},{"thumbnail":"8098\/icon\/S\/icon1_0_5.png","screenshot":"8098\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"}]}