{"publicApplicationId":"com.appible.thelastoftheplainsmenaudio","description":"In this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\n    Travel along as Mike Vendetti aka miketheauctioneer narrates an outstanding true account of a trip made in 1909 by Zane Grey and a plainsman, Buffalo Jones, through the Grand Canyon to lasso a cougar. That’s right lasso. Throw a rope around. That’s equivalent to catching one by the tail.\n\n    As I narrated this book, I found fact to be as exciting as fiction. This part of the west was relatively wild and untamed at this time. Wolves, wild horses, buffalo and other wildlife were quite prevalent, and the Indians were not that friendly.\n\n    This adventure would never make it to “Animal Planet”, or as a National Geographic special, because there is quite a lot of what we would consider cruelty to animals, but this is a true story, and life as it was at the turn of the last century. Parts of this story will offend the sensibilities of some, but it is a glimpse into a world that no longer exists. I was definitely drawn into this story, as I hope the listener will be. (Summary by Mike Vendetti) \n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.5","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"298986","installSize":"298986","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.2","currency":"USD","filename":"com.appible.thelastoftheplainsmenaudio_1.0.5_all.ipk","free":false,"images":[{"thumbnail":"8102\/icon\/S\/icon1_0_5.png","screenshot":"8102\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"},{"thumbnail":"8102\/icon\/S\/icon1_0_5.png","screenshot":"8102\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"}]}