{"publicApplicationId":"com.appible.thelonestarrangeraudio","description":"In this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\n    Buck Duane, son of a famous gunfighter, falls prey to the old problem – called out by a cowboy who wants to make trouble, Duane kills him and then must ride off to the lawless country near the Neuces River to escape being arrested and perhaps, hanged. His brief encounter with deadly gunplay has ignited a deep urging to repeat the adrenaline rush but is tempered by ghosts that haunt his sleep. He only dares to release his inner demon when he is taking down an outlaw who is particularly known for his brutality.\n\n    He develops a reputation for killing the most notorious Texas outlaws, which draws an unexpected interest: a captain of the Texas Rangers offers him a pardon and a ranger’s badge if he will infiltrate the gang of the shadowy figure known as “Cheseldine” who wields vast power in West Texas, and make it possible for the Rangers to break the gang’s hold on the region’s towns. Duane accepts, never guessing in his wildest nightmares that he would sniff out this Cheseldine, his hideouts, his lieutenants… and fall in love with his daughter!\n\n    (Summary by Mark F. Smith)\n\n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.5","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"298558","installSize":"298558","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.2","currency":"USD","filename":"com.appible.thelonestarrangeraudio_1.0.5_all.ipk","free":false,"images":[{"thumbnail":"8106\/icon\/S\/icon1_0_5.png","screenshot":"8106\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"},{"thumbnail":"8106\/icon\/S\/icon1_0_5.png","screenshot":"8106\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"}]}