{"publicApplicationId":"com.appible.themillontheflossaudio","description":"In this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\nThe novel details the lives of Tom and Maggie Tulliver, a brother and sister growing up on the river Floss near the village of St. Oggs, evidently in the 1820’s, after the Napoleonic Wars but prior to the first Reform Bill (1832). The novel spans a period of 10-15 years, from Tom and Maggie’s childhood up until their deaths in a flood on the Floss. The book is fictional autobiography in part, reflecting the disgrace that George Eliot (Mary Ann Evans) herself had while in a lengthy relationship with a married man, George Henry Lewes.\nMaggie Tulliver holds the central role in the book, as both her relationship with her older brother Tom, and her romantic relationships with Philip Wakem, a hunchbacked, but sensitive and intellectual, friend, and with Stephen Guest, a vivacious young socialite in St. Oggs and fiance of Maggie’s cousin Lucy Deane, constitute the most significant narrative threads: (Wikipedia) \n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.5","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"278640","installSize":"278640","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.2","currency":"USD","filename":"com.appible.themillontheflossaudio_1.0.5_all.ipk","free":false,"images":[{"thumbnail":"8109\/icon\/S\/icon1_0_5.png","screenshot":"8109\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"},{"thumbnail":"8109\/icon\/S\/icon1_0_5.png","screenshot":"8109\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"}]}