{"publicApplicationId":"com.appible.thetreasureaudio","description":"In this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\nSelma Lagerlöf was born in Vaermland, Sweden, in 1858 and enjoyed a long and very successful career as a writer, receiving the Nobel-Prize in Literature in 1909. She died in Vaermland in 1940. The Treasure (Herr Arnes penningar) is a fairly short Novel, both a Drama and a Ghost Story. Published in 1904 and the English translation in 1923. The story is set in Bohuslaen on the West coast of Sweden in the middle of the 16th Century. Herr Arne, the old Parson in Solberga and all his household are brutally murdered, and his great Treasure stolen. The only survivor is Elsalill, the orphaned foster daughter. On her lies the burden to find out the murderers. She wants revenge, but falls in love with one of the murderers, who she must betray. Another important figure in the story is Torarin an old Fish hawker, who takes in Elsalill in his house after the murders, and Torarin’s dog, Grim, and also Elsalill’s dead foster sister. (Summary by Lars Rolander)  \n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.5","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"277860","installSize":"277860","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.2","currency":"USD","filename":"com.appible.thetreasureaudio_1.0.5_all.ipk","free":false,"images":[{"thumbnail":"8116\/icon\/S\/icon1_0_5.png","screenshot":"8116\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"},{"thumbnail":"8116\/icon\/S\/icon1_0_5.png","screenshot":"8116\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"}]}