{"publicApplicationId":"com.appible.thespiritoftheborderaudio","description":"In this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\nThis is an early novel by the phenomenally successful author of frontier, western and sports stories. It deals with historical characters and incidents in the Ohio Valley in the late 18th century, especially with the foundation of Gnaddenhutten, a missionary village intended to bring Christianity to the Indians of Ohio, despite the violent opposition of both Indians and white renegades. This turbulent adventure romance features the heroics of a semi-legendary frontiersman, Lewis Wetzel, who attempts to protect the settlers from hostile Native Americans and the vicious white outlaws the Girty brothers. (Introduction by Leonard Wilson)\n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.5","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"300012","installSize":"300012","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.2","currency":"USD","filename":"com.appible.thespiritoftheborderaudio_1.0.5_all.ipk","free":false,"images":[{"thumbnail":"8118\/icon\/S\/icon1_0_5.png","screenshot":"8118\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"},{"thumbnail":"8118\/icon\/S\/icon1_0_5.png","screenshot":"8118\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"}]}