{"publicApplicationId":"com.gpimports.bloodsugar","description":"Blood Sugar Diabetes Control\n\nFinally an easy way to record and keep track of all your diabetic information needs!\nDiabetes is a chronic disease triggered by high levels of sugar in the blood. Fortunately, because of recent research most types can now be controlled in different ways. In order to control the disease, diabetics need to constantly check their lifestyle. It gets very complicated to keep track of all the food, exercise and medicine intake; that is why we created this amazing new application! Some of the main features include:\n\n-Being able to record your glucose level as often as you need during the day. This application makes it in a very user friendly way; every recording you can add the date and time it was taken. The level of sugar is written in mg\/dL, and it can be categorized depending on the moment of the day it was taken.\n\n-Glucose levels get charted automatically. The chart is divided by colors making it easy to track and understand.\n\n-Note down your food intake and exercise, helping you understand why the levels of glucose shifted. \n\n-You are able to include your medication intake. This may help you analyze and also keep track. Unlike other applications, here you can select exactly the brand and amount you took for future reference.\n\n-You can annotate your physician recommendations as well as the targets you wish to accomplish; keeping all the information together and simpler to handle.\n\n-Unlike other applications, the graph can be set for as many days as you want; you can analyze one specific day or the whole month at once.\n\n-You can take screenshots of the graphs and information and automatically send to your physician. Unlike other applications the software can also make individual reports about the food, exercise and medication. \n\n-Diabetes unfortunately affects thousands of people; with this application you can share questions and comments with other users and experts in a special forum with just a click of a button.","version":"1.0.0","versionNote":"","homeURL":"http:\/\/www.gp-imports.com","supportURL":"http:\/\/www.gp-imports.com","custsupportemail":"","custsupportphonenum":"","copyright":"Gp Imports, Inc","licenseURL":"","locale":"en_US","appSize":175114,"installSize":2031616,"isEncrypted":false,"adultRating":false,"islocationbased":false,"lastModifiedTime":"2012-06-01T18:19:27.000+0000","mediaLink":null,"mediaIcon":null,"attributes":{"provides":{"noApp":false,"dockMode":false,"universalSearch":false,"connectors":["null"],"services":[],"optimizedUserExperience":false}},"price":0.99,"currency":"USD","isAdvertized":false,"filename":"com.gpimports.bloodsugar_1.0.0_all.ipk","free":false,"touchpad_exclusive":false,"images":{"1":{"screenshot":"8155\/1.0.0\/en\/images\/1\/L\/0.png","thumbnail":"8155\/1.0.0\/en\/images\/1\/L\/0.png","orientation":"P","device":"P"},"2":{"screenshot":"8155\/1.0.0\/en\/images\/2\/L\/2.png","thumbnail":"8155\/1.0.0\/en\/images\/2\/L\/2.png","orientation":"P","device":"P"},"3":{"screenshot":"8155\/1.0.0\/en\/images\/3\/L\/1.png","thumbnail":"8155\/1.0.0\/en\/images\/3\/L\/1.png","orientation":"P","device":"P"},"4":{"screenshot":"8155\/1.0.0\/en\/images\/4\/L\/3.png","thumbnail":"8155\/1.0.0\/en\/images\/4\/L\/3.png","orientation":"P","device":"P"},"5":{"screenshot":"8155\/1.0.0\/en\/images\/5\/L\/5.png","thumbnail":"8155\/1.0.0\/en\/images\/5\/L\/5.png","orientation":"P","device":"P"}}}