{"publicApplicationId":"com.minderleister.countryquiz","description":"A geography quiz of the special kind: Can you recognize a country just by its shape? Or by its flag? How about its internet top level domain? This app is three country quizzes in one. \n\nHere are the details of what this app will do: You get to choose to play the game with countries from one continent only or from the entire world. The quiz is really tough, so you might want to start practicing with a continent before taking on the entire world. You also get to choose if you want to play the quiz with country outlines (shapes), flags or internet top level domains. Shapes are hardest, domains easiest.\n\nNow the quiz starts, woohoo! You’ll be given 15 shapes\/flags\/domains and have to enter (with the keyboard) the name of the country it belongs to. No idea? Get a hint by pressing the button on the top right. Skip the country by swiping it over. Giving up? There’s a button on the top left for that. But beware! There is a pretty detailed statistic reminding you of how many countries you missed and how many hints you used.\n\nBefore you ask: Yes, we know. You don’t have to get any question wrong in this quiz, because you get hints and as many tries as you want. Well, if you want to play the unforgiving version of the quiz, you’ll have to get some self-discipline and never press the “hint” button.  Oh, did we mention the hints are designed to be not-too-easy? The three countries you get to pick from are usually quite similar, because everyone can distinguish Russia from Trinidad and Tobago. You can’t? Then this game might not be quite right…\n\n&One more thing: We worked on the presentation of countries and made sure that you can see all of them. That means that a few groups of islands are not shown to scale.","version":"1.0.0","versionNote":"","homeURL":"http:\/\/www.minderleister.com","supportURL":"http:\/\/www.minderleister.com","custsupportemail":"countryquiz@minderleister.com","custsupportphonenum":"","copyright":"Copyright 2011 Minderleister","licenseURL":"","locale":"en_US","appSize":3064184,"installSize":15106048,"isEncrypted":false,"adultRating":false,"islocationbased":false,"lastModifiedTime":"2012-06-01T18:29:36.000+0000","mediaLink":null,"mediaIcon":null,"attributes":{"provides":{"noApp":false,"dockMode":false,"universalSearch":false,"connectors":["null"],"services":[],"optimizedUserExperience":false}},"price":0.99,"currency":"USD","isAdvertized":false,"filename":"com.minderleister.countryquiz_1.0.0_all.ipk","free":false,"touchpad_exclusive":false,"images":{"1":{"screenshot":"8164\/1.0.0\/en\/images\/1\/L\/ph_shapes.png","thumbnail":"8164\/1.0.0\/en\/images\/1\/S\/ph_shapes.png","orientation":"P","device":"P"},"2":{"screenshot":"8164\/1.0.0\/en\/images\/2\/L\/ph_game.png","thumbnail":"8164\/1.0.0\/en\/images\/2\/S\/ph_game.png","orientation":"P","device":"P"},"3":{"screenshot":"8164\/1.0.0\/en\/images\/3\/L\/ph_continents.png","thumbnail":"8164\/1.0.0\/en\/images\/3\/S\/ph_continents.png","orientation":"P","device":"P"},"4":{"screenshot":"8164\/1.0.0\/en\/images\/4\/L\/ph_stats.png","thumbnail":"8164\/1.0.0\/en\/images\/4\/S\/ph_stats.png","orientation":"P","device":"P"},"5":{"screenshot":"8164\/1.0.0\/en\/images\/5\/L\/ph_flags.png","thumbnail":"8164\/1.0.0\/en\/images\/5\/S\/ph_flags.png","orientation":"P","device":"P"}}}