{"publicApplicationId":"com.kissaham.svrwxctr","description":"Important: Please be sure that you have a good internet connection to view the graphics. Maps are loaded directly from the internet and are fairly large and may be slow to load on a poor connection.  \n0.1.6 - added the ability to wrap for images. \n\n\nSevere weather season is upon us, so even though this app is not complete, I decided to go ahead and release it. Please leave feedback using the drop-down menu for email support and I will see what I can add. Just remember, I am a SKYWARN Spotter and it is storm season. This application gets the bulk of it to the images of the NWS and their servers, so that under severe weather conditions and depending on what type of network connection you have, determines how fast the images load. There are a couple images that take longer to load than others, so I put the number of images in the application to let you know that there are more available. Give them time to load and you can go to the next graphic. At this point, you can flip left or right between the images. I'm looking for other options to increase the download speed. There are a couple of informational screens . One, gives you an idea of the Reporting requirements for most local SKYWARN groups.  And the other has some common Meteorological terms. Reporting and terms came from Blacksburg and Greenville Spartanburg NWS websites.\n\n\nNWS convective outlooks are for today, tomorrow and the day after. I have included some Mesoscale graphics that I use to help determine where to chase. Clicking on any of the Outlook images will take you to the internet so that you can get more information about that map. This application is designed around one of my web pages for our SKYWARN Group.","version":"0.1.6","versionNote":"","homeURL":"https:\/\/sites.google.com\/site\/kissahamsoftware\/","supportURL":"https:\/\/sites.google.com\/site\/kissahamsoftware\/","custsupportemail":"kissahamsoftware@google.com","custsupportphonenum":"","copyright":"Copyright 2011 Kiss-A-Ham Software","licenseURL":"","locale":"en_US","appSize":128182,"installSize":1343488,"isEncrypted":false,"adultRating":false,"islocationbased":false,"lastModifiedTime":"2011-03-28T22:14:19.000+0000","mediaLink":null,"mediaIcon":null,"attributes":{"provides":{"noApp":false,"dockMode":false,"universalSearch":false,"connectors":[],"services":[],"optimizedUserExperience":false}},"price":0,"currency":"USD","isAdvertized":false,"filename":"com.kissaham.svrwxctr_0.1.6_all.ipk","free":false,"touchpad_exclusive":false,"images":{"1":{"thumbnail":"8180\/en\/images\/1\/S\/1SevWX.png","screenshot":"8180\/en\/images\/1\/L\/1SevWX.png","orientation":"P","device":"P"},"2":{"thumbnail":"8180\/en\/images\/2\/S\/2SevWX.png","screenshot":"8180\/en\/images\/2\/L\/2SevWX.png","orientation":"P","device":"P"},"3":{"thumbnail":"8180\/en\/images\/3\/S\/4SevWX.png","screenshot":"8180\/en\/images\/3\/L\/4SevWX.png","orientation":"P","device":"P"}}}