{"publicApplicationId":"cn.bluesky.bubblesblow","description":"The object of game is to clear all the bubbles from the board, scoring as many points as possible. How? You blow at them with more bubbles, and when three or more of the same color come together, they all explode. Just tap at where you want the next bubble to go.\n\t\t The more bubbles blow up at one tap, the increasingly more points you gain (six ones at one tap is better tan two three-bubble taps). Besides, those bubbles that fell apart from the rest will explode too. It is well worth trying to arrange such avalanches, as they will give you ten times more points than ordinary bursts.\n\t\t Another important rule to know is that the borders are like mirrors. If you shoot a bubble towards an exposed border, it will not stick to the border but will bounce right back like a stream of light against a mirror. This feature becomes really handful when the center of your board is filled up with and you need to shoot some bubbles on the sidebars.\n\t\t If your tap fails to detonate any bubbles, you get a foul, and when there are several fouls, one or two new line of bubbles appears at the top. The number of misfires allowed before bubbles will advance again, is shown by the number of silver ball in the left bottom corner.\n\t\t The game is over when you clean all the bubbles off and your score doubles, or bubbles move all the way down on you.","version":"1.0.0","versionNote":"","homeURL":"http:\/\/www.chat-chat.net","supportURL":"http:\/\/www.chat-chat.net","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2011 Bluesky Studio","licenseURL":"","locale":"en_US","appSize":545520,"installSize":3899392,"isEncrypted":false,"adultRating":false,"islocationbased":false,"lastModifiedTime":"2012-06-01T18:39:36.000+0000","mediaLink":null,"mediaIcon":null,"attributes":{"provides":{"noApp":false,"dockMode":false,"universalSearch":false,"connectors":["null"],"services":[],"optimizedUserExperience":false}},"price":0.99,"currency":"USD","isAdvertized":false,"filename":"cn.bluesky.bubblesblow_1.0.0_all.ipk","free":false,"touchpad_exclusive":false,"images":{"1":{"screenshot":"8220\/1.0.0\/en\/images\/1\/L\/screen.png","thumbnail":"8220\/1.0.0\/en\/images\/1\/L\/screen.png","orientation":"P","device":"P"}}}