{"publicApplicationId":"com.appible.abovelifesturmoilaudio","description":"In this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\nThe turmoil of the world we cannot avoid, but the disturbances of mind we can overcome. The duties and difficulties of life claim our attention, but we can rise above all anxiety concerning them. Surrounded by noise, we can yet have a quiet mind; involved in responsibilities, the heart can be at rest; in the midst of strife, we can know the abiding peace. The twenty pieces which comprise this book, unrelated as some of them are in the letter, will be found to be harmonious in the spirit, in that they point the reader towards those heights of self-knowledge and self-conquest which, rising above the turbulence of the world, lift their peaks where the Heavenly Silence reigns.\n(Summary from Above Life’s Turmoil)\n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.5","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"288908","installSize":"288908","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.2","currency":"USD","filename":"com.appible.abovelifesturmoilaudio_1.0.5_all.ipk","free":false,"images":[{"thumbnail":"8236\/icon\/S\/icon1_0_5.png","screenshot":"8236\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"},{"thumbnail":"8236\/icon\/S\/icon1_0_5.png","screenshot":"8236\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"}]}