{"publicApplicationId":"com.appible.adambedeaudio","description":"In this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\n    Adam Bede, the first novel written by George Eliot (the pen name of Mary Ann Evans), was published in 1859. It was published pseudonymously, even though Evans was a well-published and highly respected scholar of her time. The novel has remained in print ever since, and is used in university studies of 19th century English literature.\n\n    The story’s plot follows four characters rural lives in the fictional community of Hayslope—a rural, pastoral and close-knit community in 1799. The novel revolves around a love triangle between beautiful but thoughtless Hetty Sorrel, Captain Arthur Donnithorne, the young squire who seduces her, Adam Bede, her unacknowledged lover, and Dinah Morris, Hetty’s cousin, a fervent Methodist lay preacher.\n    (Summary Wikipedia) \n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.5","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"285064","installSize":"285064","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.2","currency":"USD","filename":"com.appible.adambedeaudio_1.0.5_all.ipk","free":false,"images":[{"thumbnail":"8237\/icon\/S\/icon1_0_5.png","screenshot":"8237\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"},{"thumbnail":"8237\/icon\/S\/icon1_0_5.png","screenshot":"8237\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"}]}