{"publicApplicationId":"com.appible.aprisonerofmorroaudio","description":"In this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\nUpton Sinclair, born in 1878 was a Pulitzer Prize-winning American author. He wrote over 90 books in many genres. \n The period for this work is the ten-week Spanish–American War which occurred in 1898. Revolts against Spanish rule had been prevalent for decades in Cuba and were closely watched by Americans. The main issue of the war was Cuban independence from Spain. The war was notable for a series of one-sided American naval and military victories and led to the downfall of Spain as a colonial power. Clif Faraday, a naval cadet, is the main character in this novel. Stationed on a gunboat off the Cuban island as part of the U. S. naval blockade, Clif survives a series of confrontations at sea and treacheries on land. He is captured while on the island during a mission and lands in a Cuban prison called Morro, renowned for its cruelty. Clif receives aid from an unlikely source when all seems lost and survives to show commendable leadership and canny judgment. If you are looking for social commentary from Sinclair, this is not the book. If you want an entertaining listen reminiscent of “old-time” radio weekly serials where the hero faces dire consequences at the end of the each week’s program, then you should enjoy this story. (Summary adapted from Wikipedia and modified by the Reader) \n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.5","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"297786","installSize":"297786","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.2","currency":"USD","filename":"com.appible.aprisonerofmorroaudio_1.0.5_all.ipk","free":false,"images":[{"thumbnail":"8251\/icon\/S\/icon1_0_5.png","screenshot":"8251\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"},{"thumbnail":"8251\/icon\/S\/icon1_0_5.png","screenshot":"8251\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"}]}