{"publicApplicationId":"com.appible.atthetimeappointedaudio","description":"In this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\n    \"Those who remember that excellent detective story, That Mainwaring Affair will expect to find plenty of mystery and exciting incidents in A. Maynard Barbour's latest novel, called At the Time Appointed, and they will realize their expectations.The author has a certain way of forecasting events and making people utter prophetic words, all bound to find their fulfillment somewhere before the last chapter is ended, that is eminently characteristic of one who delights in the knitting and raveling of the intricate plots which are a prime necessity in a detective story. The title itself cleverly suggests a long series of events slowly converging toward some mysteriously critical moment in which all their crookedness is revealed and made straight for the delectation of at least two people; and the is exactly the kind of a title for this story of long-delayed justice and patient hoping. The main object in a story of this kind is to make the events hang together and the narration of them entertaining. Both these requisites are attained. People will be sure to read this story at one sitting, even if that involves hearing the clock strike several times after midnight and that is one test of at least one kind of excellence in a novel.\" (excerpts from the NY Times review of At the Time Appointed published July 18, 1903\n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.5","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"288822","installSize":"288822","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.2","currency":"USD","filename":"com.appible.atthetimeappointedaudio_1.0.5_all.ipk","free":false,"images":[{"thumbnail":"8256\/icon\/S\/icon1_0_5.png","screenshot":"8256\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"},{"thumbnail":"8256\/icon\/S\/icon1_0_5.png","screenshot":"8256\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"}]}