{"publicApplicationId":"com.appible.barbarainbrittanyaudiotext","description":"This Plus version of Barbara in Brittany includes both audio and text so you can follow along or read without the audio.\n\nIn this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\nBarbara, an English girl and the eldest of her family, spends most days helping her widowed mother care for her younger siblings. Then disaster strikes – or so the children believe! Barbara is taken to France to see Paris by her father’s formidable sister, Aunt Anne. She stays on in Brittany to perfect her French. In this series of funny stories about her adventures in France, we meet a cast of recurring characters – and both Barbara and Aunt Anne find love! (Summary by Sibella Denton)\n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.5","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"286596","installSize":"286596","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.8","currency":"USD","filename":"com.appible.barbarainbrittanyaudiotext_1.0.5_all.ipk","free":false,"images":[{"thumbnail":"8258\/icon\/S\/icon1_0_5.png","screenshot":"8258\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"},{"thumbnail":"8258\/icon\/S\/icon1_0_5.png","screenshot":"8258\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"}]}