{"publicApplicationId":"com.appible.davidcopperfieldaudiotext","description":"This Plus version of David Copperfield includes both audio and text so you can follow along or read without the audio.\n\nIn this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\n“David Copperfield” or “The Personal History, Adventures, Experience and Observation of David Copperfield the Younger of Blunderstone Rookery” was first published in 1850. Like all except five of his works, it originally appeared in serial form. Many elements within the novel follow events in Dickens’ own life, and it is probably the most autobiographical of all of his novels. It is also Dickens’ “favorite child.” (Summary adapted from Wikipedia)\n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.5","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"279948","installSize":"279948","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.8","currency":"USD","filename":"com.appible.davidcopperfieldaudiotext_1.0.5_all.ipk","free":false,"images":[{"thumbnail":"8264\/icon\/S\/icon1_0_5.png","screenshot":"8264\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"},{"thumbnail":"8264\/icon\/S\/icon1_0_5.png","screenshot":"8264\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"}]}