{"publicApplicationId":"com.appible.doctorthorneaudio","description":"In this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\nDoctor Thorne is the third of Trollope's Barsetshire novels, and unlike some of the others, has little to do with the politics and personalities of the Church of England, or politics on the national level (though there is lots of politicking in the mythical county of Barsetshire itself). The plot revolves around the illegitimate Mary Thorne, who has been lovingly raised by her uncle, a country doctor, and who, as she comes of age, finds herself wondering whether she is a lady (in the county sense of the term). Frank Gresham, son of the squire of Greshamsbury, is in love with her (much against the wishes of his noble de Courcy relatives at the Castle), but she dismisses his affection at first as mere puppy love, thereby setting the scene for a series of entanglements, social, romantic, and of course, financial and propertied (never far from the action in Trollope's works). Their resolution, of course, makes up the meat of the novel. One critic has remarked that in Doctor Thorne Trollope succeeds in one of the most difficult tasks an author of fiction can face: how to make genuinely good people genuinely interesting, so that they engage not only the sympathies but also the interest of readers. (Introduction by Nicholas Clifford) \n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.5","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"278976","installSize":"278976","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.2","currency":"USD","filename":"com.appible.doctorthorneaudio_1.0.5_all.ipk","free":false,"images":[{"thumbnail":"8266\/icon\/S\/icon1_0_5.png","screenshot":"8266\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"},{"thumbnail":"8266\/icon\/S\/icon1_0_5.png","screenshot":"8266\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"}]}