{"publicApplicationId":"com.appible.evesdiaryaudiotext","description":"This Plus version of Eve's Diary includes both audio and text so you can follow along or read without the audio.\n\nIn this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\nEve's Diary is a comic short story by Mark Twain. It was first published in the 1905 Christmas issue of the magazine Harper's Bazaar, and in book format in June 1906 by Harper and Brothers publishing house. It is written in the style of a diary kept by the first woman in the Judeao-Christian creation myth, Eve, and is claimed to be \"translated from the original MS.\" The \"plot\" of this novel is the first-person account of Eve from her creation up to her burial by, her mate, Adam, including meeting and getting to know Adam, and exploring the world around her, Eden. The story then jumps 40 years into the future after the Fall and expulsion from Eden. It is one of a series of books Twain wrote concerning the story of Adam and Eve, including 'Extracts from Adam's Diary,' 'That Day In Eden,' 'Eve Speaks,' 'Adam's Soliloquy,' and the 'Autobiography of Eve.' Eve's Diary has a lighter tone than the others in the series, as Eve has a strong appreciation for beauty and love. The book may have been written as a posthumous love-letter to Mark Twain's wife Olivia Langdon Clemens, or Livy, who died in June 1904, just before the story was written. Mark Twain is quoted as saying, \"Eve's Diary is finished — I've been waiting for her to speak, but she doesn't say anything more.\" (Introduction by Wikipedia) \n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.5","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"279398","installSize":"279398","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.8","currency":"USD","filename":"com.appible.evesdiaryaudiotext_1.0.5_all.ipk","free":false,"images":[{"thumbnail":"8272\/icon\/S\/icon1_0_5.png","screenshot":"8272\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"},{"thumbnail":"8272\/icon\/S\/icon1_0_5.png","screenshot":"8272\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"}]}