{"publicApplicationId":"com.appible.famousseafightsaudio","description":"In this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\nI propose to tell in non-technical and popular language the story of some of the most remarkable episodes in the history of sea power. I shall begin with the first sea-fight of which we have a detailed history—the Battle of Salamis (B.C. 480), the victory by which Themistocles the Athenian proved the soundness of his maxim that “he who commands the sea commands all.” I shall end with the last and greatest of naval engagements, the Battle of Tsu-shima, an event that reversed the long experience of victory won by West over East, which began with Salamis more than two thousand years ago.\nI shall have to tell of British triumphs on the sea from Sluys to Trafalgar; but I shall take instances from the history of other countries also, for it is well that we should remember that the skill, enterprise, and courage of admirals and seamen is no exclusive possession of our own people.\nI shall incidentally describe the gradual evolution of the warship from the wooden, oar-driven galleys that fought in the Straits of Salamis to the steel-built, steam-propelled giants that met in battle in the Straits of Tsu-shima. I shall have something to say of old seafaring ways, and much to tell of the brave deeds done by men of many nations.\n (From the Introduction of the Book) \n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.5","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"299256","installSize":"299256","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.2","currency":"USD","filename":"com.appible.famousseafightsaudio_1.0.5_all.ipk","free":false,"images":[{"thumbnail":"8275\/icon\/S\/icon1_0_5.png","screenshot":"8275\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"},{"thumbnail":"8275\/icon\/S\/icon1_0_5.png","screenshot":"8275\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"}]}