{"publicApplicationId":"com.appible.hardtimesaudio","description":"In this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\nHard Times, the shortest of Dickens’s full-length novels, is set in the fictitious Victorian-England city of Coketown, where facts are the rule and all fancy is to be stamped out. The plot centers around the men and women of the town, some of whom are beaten down by the city’s utilitarian ideals and some of whom manage to rise above it. The novel was written in 1854 and was a scathing attack on then-current ideas of utilitarianism, which Dickens viewed as a selfish and at times oppressive philosophy. Perhaps the novel’s best features are its clever, ironic narration and the larger-than-life characters that push the plot forward, such as the upper-class banker and hypocritical braggart, Josiah Bounderby, and the fact-driven schoolmaster, Thomas Gradgrind. (Summary by Rosalind Wills).\n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.5","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"277672","installSize":"277672","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.2","currency":"USD","filename":"com.appible.hardtimesaudio_1.0.5_all.ipk","free":false,"images":[{"thumbnail":"8285\/icon\/S\/icon1_0_5.png","screenshot":"8285\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"},{"thumbnail":"8285\/icon\/S\/icon1_0_5.png","screenshot":"8285\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"}]}