{"publicApplicationId":"com.appible.heroidesaudio","description":"In this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\nThe Heroides, also known as the Heroines, the Letters of the Heroines or simply as Epistles are a very famous collection of poems by Ovid, not only for their interesting subject – letters by famous mythological characters addressed to their beloved ones – but also because it’s considered by some the first example of the Epistle as a literary genre – a statement made by Ovid himself in his Ars Amatoria. The book as we have it nowadays consists of 21 letters, divided in two parts. The first is composed of fifteen letters presented as if written by a female mythological character to her lover; the second part, also known as Double Heroides, brings three pairs of letters, being the first in each pair supposedly written by a hero, and the second one, the heroine’s response to the first letter. Along the Metamorphoses and the Ars Amatoria, the Heroides were one of the most influential works of Ovid, not only in the Antiquity, but also throughout the Middle Ages and up to Modern times. (Summary by Leni)\n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.5","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"278064","installSize":"278064","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.2","currency":"USD","filename":"com.appible.heroidesaudio_1.0.5_all.ipk","free":false,"images":[{"thumbnail":"8286\/icon\/S\/icon1_0_5.png","screenshot":"8286\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"},{"thumbnail":"8286\/icon\/S\/icon1_0_5.png","screenshot":"8286\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"}]}