{"publicApplicationId":"com.appible.herotalesfromamericanhistoryaudio","description":"In this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\n    Its purpose … is to tell in simple fashion the story of some Americans who showed that they knew how to live and how to die; who proved their truth by their endeavor; and who joined to the stern and manly qualities which are essential to the well-being of a masterful race the virtues of gentleness, of patriotism, and of lofty adherence to an ideal.\n\n    It is a good thing for all Americans … to remember the men who have given their lives in war and peace to the service of their fellow-countrymen, and to keep in mind the feats of daring and personal prowess done in time past by some of the many champions of the nation in the various crises of her history. (Summary from the book’s dedication.)\n\n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.5","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"300804","installSize":"300804","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.2","currency":"USD","filename":"com.appible.herotalesfromamericanhistoryaudio_1.0.5_all.ipk","free":false,"images":[{"thumbnail":"8287\/icon\/S\/icon1_0_5.png","screenshot":"8287\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"},{"thumbnail":"8287\/icon\/S\/icon1_0_5.png","screenshot":"8287\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"}]}