{"publicApplicationId":"com.appible.hungeraudio","description":"In this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\nHunger (Norwegian: Sult) is a novel by the Norwegian author and Nobel Prize winner Knut Hamsun and was published in its final form in 1890. The novel has been hailed as the literary opening of the 20th century and an outstanding example of modern, psychology-driven literature. It hails the irrationality of the human mind in an intriguing and sometimes humorous novel. Written after Hamsun's return from an ill-fated tour of America, Hunger is loosely based on the author's own impoverished life before his breakthrough in 1890. Set in late 19th century Kristiania, the novel recounts the adventures of a starving young man whose sense of reality is giving way to a delusionary existence on the darker side of a modern metropolis. While he vainly tries to maintain an outer shell of respectability, his mental and physical decay are recounted in detail. His ordeal, enhanced by his inability or unwillingness to pursue a professional career, which he deems unfit for someone of his abilities, is pictured in a series of encounters which Hamsun himself described as 'a series of analyses.' In many ways, the protagonist of the novel displays traits reminiscent of Raskolnikov, whose creator, Fyodor Dostoevsky, was one of Hamsun's main influences. (Introduction by Wikipedia)  \n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.5","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"277560","installSize":"277560","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.2","currency":"USD","filename":"com.appible.hungeraudio_1.0.5_all.ipk","free":false,"images":[{"thumbnail":"8288\/icon\/S\/icon1_0_5.png","screenshot":"8288\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"},{"thumbnail":"8288\/icon\/S\/icon1_0_5.png","screenshot":"8288\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"}]}