{"publicApplicationId":"com.realtechvr.app.nogravity","description":"Are you brave enough to play No Gravity? You’ll need steady nerves and a strong heart to fly around dangerous obstacles, face hostile environments and use deadly weapons to accomplish your missions and protect your people. Hurry, download this WebOS version of the PSP favorite, before it’s too late. \n\nIn a distant future, spread across thousands of colonies, the empire is under attack from a mysterious, unknown sickness that is affecting people’s minds. So far, you’ve been able to remain healthy but you don’t know for how much longer. \n\nAs one of the few survivors of this bewildering plague, it’s up to you to seek out and destroy the enemy that unleashed this madness. If you don’t, there remains no hope for your planet or your people. Are you prepared to tackle 31 missions and destroy the heinous foe? \n\nThis is not a job for wimps. No Gravity is fast-paced and full of action. You’ll need to draw on your deepest level of calm bravado to succeed in these dangerous missions. \n\nWhen you’re ready, choose your character and one of six customizable ships. Each one is equipped with an impressive array of weapons, so you’ll have plenty of tools at hand for the job. Whether you need lasers or ion blasters, everything is there to help you win the war against your hostile enemy. \n\nOnce in your ship, you’ll fly through space, skimming over six different worlds, moving along underground craters and through massive asteroids fields. You need to keep your wits about you or it’s game over before you’ve accomplished your mission. \n\nYou’re not alone out there, though. Allied ships will accompany you through the hostile space stations, help you destroy enemy bases and clear mine fields. As the mysteries of the surrounding space unfold, be prepared to unleash your firepower on anything that gets in your way. You must be unstoppable in order to save your people.","version":"1.4.4","versionNote":"• Restored iCade option.","homeURL":"http:\/\/www.realtech-vr.com","supportURL":"http:\/\/support.realtech-vr.com","custsupportemail":"support_2008@realtech-vr.com","custsupportphonenum":"","copyright":"copyright 1996, 2006, 2011 realtech VR","licenseURL":"","locale":"en_US","appSize":76880990,"installSize":100073472,"isEncrypted":false,"adultRating":false,"islocationbased":false,"lastModifiedTime":"2012-06-02T07:00:59.000+0000","mediaLink":"http:\/\/www.youtube.com\/watch?v=nXExAkUi_rk","mediaIcon":"http:\/\/img.youtube.com\/vi\/nXExAkUi_rk\/2.jpg","attributes":{"provides":{"noApp":false,"dockMode":false,"universalSearch":false,"connectors":["null"],"services":[],"optimizedUserExperience":true}},"price":2.99,"currency":"USD","isAdvertized":false,"filename":"com.realtechvr.app.nogravity_1.4.4_all.ipk","free":false,"touchpad_exclusive":true,"images":{"1":{"screenshot":"com.realtechvr.app.nogravity\/1.4.4\/en\/images\/1\/L\/tb_iPad_NoGravity_0000.jpg","thumbnail":"com.realtechvr.app.nogravity\/1.4.4\/en\/images\/1\/S\/tb_iPad_NoGravity_0000.jpg","orientation":"L","device":"T"},"2":{"screenshot":"com.realtechvr.app.nogravity\/1.4.4\/en\/images\/2\/L\/tb_iPad_NoGravity_0005.jpg","thumbnail":"com.realtechvr.app.nogravity\/1.4.4\/en\/images\/2\/S\/tb_iPad_NoGravity_0005.jpg","orientation":"L","device":"T"},"3":{"screenshot":"com.realtechvr.app.nogravity\/1.4.4\/en\/images\/3\/L\/tb_iPad_NoGravity_0008.jpg","thumbnail":"com.realtechvr.app.nogravity\/1.4.4\/en\/images\/3\/S\/tb_iPad_NoGravity_0008.jpg","orientation":"L","device":"T"}}}