{"publicApplicationId":"com.daveprochnow.yo","description":"Don’t be a yo-yo.  Be the master of your own YO.\n\nYO! is unlike any other book App that you've ever seen. Those other eBook Apps are all so last century.   YO! is interactive, YO! is informative, and YO! is fun(ny). Oh yeah, fun; how fun? Get this, YO! comes with an Exhibition mode that could leave you sleepless at night! That's right. Just spin up YO! and you'll be glued to your device's screen all night long.  Good-bye restful bliss; hello slinging some string whenever and wherever you want while reading one of the best yo-yo texts ever squeezed into a webOS App.\n\nRight from the opening screen, you'll know this ain't your grandma's App. Touch anywhere on the book and you'll be whisked to a Yo classroom where you'll learn about the science of ups and downs. Inside YO! there six areas for you to explore:\n\nScience – learn what makes a yo-yo go, well, up & down\nYO! - enter the hallowed halls of yo-yo history\nShop – looking for a yo-yo; start here\nFun – give yourself a giggle, go ahead, you deserve it\nTeach – discover 10 different yo-yo tricks and stunts\nOne YO Thing – ah, this is the BIG one, Exhibition mode\n\nYO give me mo.\n\nOK, try these stats on for size:\n\n- Did you know that Duncan Toys Company sold almost 10 million yo-yos in the early 1990s?\n- Too new for you? How about 33 million Duncan Yo-Yos were sold in the year 1963?\n- Did you know that there is an American Yo-Yo Association, as well as a National Yo-Yo Contest and Museum?\n\nWhat's the bottom line here? Use YO! to learn a new pastime, then pass your time winning contests!\n\nWhen your middle finger is properly attached to the end of a yo-yo string, with the flick of your wrist, you can enter the wonderful world of YO.  Learn the neat tricks and stunts that have made the yo-yo popular with over 10 generations of kids (and some adults, too).\n\nNow it’s YO! time!","version":"1.0.0","versionNote":"","homeURL":"http:\/\/www.daveprochnow.com","supportURL":"http:\/\/www.daveprochnow.com","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2011 Dave Prochnow","licenseURL":"","locale":"en_US","appSize":1157296,"installSize":2621440,"isEncrypted":false,"adultRating":false,"islocationbased":false,"lastModifiedTime":"2012-06-01T19:01:25.000+0000","mediaLink":null,"mediaIcon":null,"attributes":{"provides":{"noApp":false,"dockMode":true,"universalSearch":false,"connectors":["null"],"services":[],"optimizedUserExperience":false}},"price":1.5,"currency":"USD","isAdvertized":false,"filename":"com.daveprochnow.yo_1.0.0_all.ipk","free":false,"touchpad_exclusive":false,"images":{"1":{"screenshot":"8339\/1.0.0\/en\/images\/1\/L\/screencapture1.png","thumbnail":"8339\/1.0.0\/en\/images\/1\/L\/screencapture1.png","orientation":"P","device":"P"},"2":{"screenshot":"8339\/1.0.0\/en\/images\/2\/L\/screencapture2.png","thumbnail":"8339\/1.0.0\/en\/images\/2\/L\/screencapture2.png","orientation":"P","device":"P"},"3":{"screenshot":"8339\/1.0.0\/en\/images\/3\/L\/screencapture3.png","thumbnail":"8339\/1.0.0\/en\/images\/3\/L\/screencapture3.png","orientation":"P","device":"P"},"4":{"screenshot":"8339\/1.0.0\/en\/images\/4\/L\/screencapture4.png","thumbnail":"8339\/1.0.0\/en\/images\/4\/L\/screencapture4.png","orientation":"P","device":"P"},"5":{"screenshot":"8339\/1.0.0\/en\/images\/5\/L\/screencapture5.png","thumbnail":"8339\/1.0.0\/en\/images\/5\/L\/screencapture5.png","orientation":"P","device":"P"}}}