{"publicApplicationId":"com.jakyl.mixthd","description":"** SALE - 33% OFF to celebrate the launch of TouchPad **\n\nThe tactile action puzzle game which is simple enough to play with a single finger, yet involving enough to challenge all your gaming skills. \n\nUse the power in your a fingertip to drag, flick, cut, mix & sink the coloured Blobs into the correct Pools in progressively more hectic and challenging levels.\n\nFeatures:-\n\n* Intuitive touch control\n\n* Multiple level variations including Classic, Avalanche and Flow\n\n* 3 difficulty settings to suit all players\n\n* 27 Game play Awards to aim for\n\n* Super smooth visuals\n\n* Original audio arrangement to compliment the action\n\n* Exclusive Music track from acclaimed electronic music producer and DJ Shur-i-kan\n\n* In-game saving, so you can keep playing even after powering off\n\nCritics:-\n\n\"The simpleness of this game makes it really fun but is surprisingly pretty hard. The graphics are awesome and couldn't be changed for the better. sounds are cool and the music is sweet. 4.5 out of 5 stars!\" - AppTap\n\n\"I enjoyed this puzzler. It is graphically appealing and entertaining. Above all else it is original. This is a quality game that I recommend.\" - Crazy Mikes Apps\n\n\"A wonderful blend\", \"The touch controls make fusing together the various blobs enjoyable and there's a tangible sense of achievement when your skills rise to the level where you can quickly join and separate your available paint balls to conquer a tricky stage.\", \"7\/10\" - Pocket Gamer\n\n\"If you're looking for a fun and fast game to test your recollection of mixing primary and secondary colors, Mixt should do the trick. Like most good puzzle games, the premise of the game is simple but gets challenging quick.\" - Touch Arcade","version":"1.0.1","homeURL":"http:\/\/www.uprising-games.com","supportURL":"http:\/\/www.uprising-games.com","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2009-11 Uprising Games","licenseURL":"http:\/\/www.uprising-games.com","locale":null,"appSize":"7703882","installSize":"7703882","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.98","currency":"USD","filename":"com.jakyl.mixthd_1.0.1_all.ipk","free":false,"images":[{"thumbnail":"8381\/icon\/S\/icon_1_0_1.png","screenshot":"8381\/icon\/S\/icon_1_0_1.png","orientation":"P","device":"P"}]}