{"publicApplicationId":"com.appible.mossyoakcamowallpapers","description":"It all began in West Point, Mississippi, with a fistful of dirt. Obsessed with the notion of getting closer to critters, Mossy Oak’s founder and CEO, Toxey Haas, gathered up a bag of leaves, sticks and dirt from under his favorite hunting tree, walked into a fabric factory and dropped it on the counter. Facing an audience of startled faces he made a bold request, “Can you print fabric that looks like the stuff in the bag?” People snickered, shook their heads and probably contemplated calling security. Little did they know he was on to something big. \n\nIt may have all begun with a fistful of dirt, but nobody really knows where it might end. Driven by both our passion for hunting and intense desire to develop the perfect camouflage pattern, we are devoted to testing, trying, experimenting and questioning everything we do. It's a relentless quest for perfection and results in break-through thinking and trend-setting patterns. \n\nNow you can get our innovative patterns right on your webOS device. Share our obsession with these high-resolution wallpapers designed specifically for your device.","version":"1.5.0","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright © 2011 Appible LLC.","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"63114","installSize":"63114","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"0.99","currency":"USD","filename":"com.appible.mossyoakcamowallpapers_1.5.0_all.ipk","free":false,"images":[{"thumbnail":"8485\/images\/1\/L\/MO-1.png","screenshot":"8485\/images\/1\/L\/MO-1.png","orientation":"P","device":"P"},{"thumbnail":"8485\/images\/2\/L\/MO-2.png","screenshot":"8485\/images\/2\/L\/MO-2.png","orientation":"P","device":"P"},{"thumbnail":"8485\/images\/3\/L\/MO-3.png","screenshot":"8485\/images\/3\/L\/MO-3.png","orientation":"P","device":"P"}]}