{"publicApplicationId":"com.appible.ofhumanbondageaudio","description":"In this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\nOf Human Bondage, published in 1915, is considered to be W. Somerset Maugham’s best work. Many believe the novel to be one of the world’s literary masterpieces. The story follows Phillip Carey from early childhood through his 30’s. Orphaned at 9, Phillip spends his early years raised by his childless aunt and uncle. His aunt tries to be a mother to Philip, but she is unsure how to behave whereas his uncle, a vicar, takes a cold disposition towards him. Philip is sent to a boarding school but his shyness and his club foot make it difficult for him to fit in. The novel follows this theme throughout as Phillip travels to Germany, France, and England, makes new acquaintances, searches for his life’s calling, and experiences romantic episodes. Mildred in particular, will leave you wondering about Phillip's obsession and passion for such a woman. More than a few of us have had “our Mildred”. The characters in Of Human Bondage  are real-life with faults, qualities, and feelings that Maugham describes so vividly. It would not be unusual that we have encountered individuals with traits similar to the characters in this book. At times the emotions in this novel, so simply but purely written, will leave you either sad or happy and even perhaps, teary-eyed as the enthusiasm of youth is met with reality.\n (Summary by the Tom Weiss)\n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.5","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"277202","installSize":"277202","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.2","currency":"USD","filename":"com.appible.ofhumanbondageaudio_1.0.5_all.ipk","free":false,"images":[{"thumbnail":"8531\/icon\/S\/icon1_0_5.png","screenshot":"8531\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"},{"thumbnail":"8531\/icon\/S\/icon1_0_5.png","screenshot":"8531\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"}]}