{"publicApplicationId":"com.appible.nonameaudio","description":"In this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\nThe story begins in 1846, at Combe-Raven in West Somersetshire, the country residence of the happy Vanstone family. When Andrew Vanstone is killed suddenly in an accident and his wife follows shortly thereafter, it is revealed that they were not married at the time of their daughters' births, making their daughters \"Nobody's Children\" in the eyes of English law and robbing them of their inheritance. Andrew Vanstone's elder brother Michael gleefully takes possession of his brother's fortune, leaving his nieces to make their own way in the world. Norah, the elder sister, accepts her misfortune gracefully, but the headstrong Magdalen is determined to have her revenge. Using her dramatic talent and assisted by wily swindler Captain Wragge, Magdalen plots to regain her rightful inheritance. (Summary adapted from Wikipedia)\n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.5","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"287892","installSize":"287892","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.2","currency":"USD","filename":"com.appible.nonameaudio_1.0.5_all.ipk","free":false,"images":[{"thumbnail":"8532\/icon\/S\/icon1_0_5.png","screenshot":"8532\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"},{"thumbnail":"8532\/icon\/S\/icon1_0_5.png","screenshot":"8532\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"}]}