{"publicApplicationId":"com.appible.oneofoursaudio","description":"In this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\nThis 1923 Pulitzer Prize winning novel was written by Willa Cather. This work had been inspired by reading her cousin G.P. Cather’s wartime letters home to his mother. He was the first officer from Nebraska killed in World War I. Claude Wheeler, the subject of the novel, is a young man growing up on a Nebraska farm. The son of well to do parents, Claude is troubled by his apparent inability to find purpose with his life. Everything he does seems to turn out wrong, at least in his own mind. Although he is a skilled farmer, Claude believes his destiny lies elsewhere. While attending a church-affiliated college his parents have selected for him, he befriends a German family (the Ehrlichs’) who open his eyes to other possibilities in life. When Claude’s father expands the Wheeler farming interests, Claude must leave college to return to his roots and operate the Wheeler farm. During this period, he marries a childhood friend, Enid, in what turns out to be a marriage of convenience rather than love. Enid tries to convert her new husband to her many other causes such as Prohibition in Nebraska. Eventually, Enid leaves Claude to care for her missionary sister who is ill in China, and Claude is somewhat relieved to see her go. During this period, Europe is ablaze with World War I.(Summary by Tom Weiss and Wikipedia)\n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.5","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"299752","installSize":"299752","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.2","currency":"USD","filename":"com.appible.oneofoursaudio_1.0.5_all.ipk","free":false,"images":[{"thumbnail":"8534\/icon\/S\/icon1_0_5.png","screenshot":"8534\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"},{"thumbnail":"8534\/icon\/S\/icon1_0_5.png","screenshot":"8534\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"}]}