{"publicApplicationId":"com.appible.outoftimesabyssaudio","description":"In this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\nOut of Time’s Abyss is an Edgar Rice Burroughs science fiction novel, the third of his Caspak trilogy. The sequence was first published in Blue Book Magazine as a three-part serial in the issues for September, October and November 1918, with Out of Time’s Abyss forming the third installment. The complete trilogy was later combined for publication in book form under the title of The Land That Time Forgot (properly speaking the title of the first part) by A. C. McClurg in June 1924. Beginning with the Ace Books editions of the 1960s, the three segments have usually been issued as separate short novels. The third of these is treated in this article. (Summary by Wikipedia) \n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.5","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"289862","installSize":"289862","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.2","currency":"USD","filename":"com.appible.outoftimesabyssaudio_1.0.5_all.ipk","free":false,"images":[{"thumbnail":"8537\/icon\/S\/icon1_0_5.png","screenshot":"8537\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"},{"thumbnail":"8537\/icon\/S\/icon1_0_5.png","screenshot":"8537\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"}]}