{"publicApplicationId":"com.appible.pocketislandaudio","description":"In this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\nAlong the coast of Maine are littered thousands of small islands. One such, named 'Pocket Island' by the locals was so called because of a pocket formed twice daily by the waning of the tides. The coast of Maine holds many secrets and legends, and Pocket Island was no exception.\nSubtitled \"A Story of Country Life in New England\", this story holds such varied and fascinating glimpses into the lives of a few individuals, and is not limited to merely a story of ghosts, of war, of barn dances, friendship, tales of rum-runners, smugglers, and seafarers. Rather it is all of the above, and much more, all wrapped nicely around a story of love.\nIs Pocket Island truly haunted by ghosts of the past? The story begins ca. 1824, and takes us through the U.S. Civil War and beyond. (Introduction by Roger Melin)\n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.5","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"284574","installSize":"284574","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.2","currency":"USD","filename":"com.appible.pocketislandaudio_1.0.5_all.ipk","free":false,"images":[{"thumbnail":"8541\/icon\/S\/icon1_0_5.png","screenshot":"8541\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"},{"thumbnail":"8541\/icon\/S\/icon1_0_5.png","screenshot":"8541\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"}]}