{"publicApplicationId":"com.appible.revelationsofawifeaudio","description":"In this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\n    Adele Garrison was the nom de plume of Nana Springer White, an American writer. Her career included time as a schoolteacher in Milwaukee. She later worked as an editor for the Milwaukee Sentinel and then a reporter and writer for the Chicago Examiner and Chicago American.\n\n    “Revelations of a Wife” ran as a serial story in her daily newspaper column in multiple American newspapers from 1915 until the Depression. It told the story of the marital ups and downs of Margaret “Madge” Graham, an independent-minded former schoolteacher, and her husband Dicky, an artist. At the height of the story’s popularity, it had one million regular readers. (Summary by Wikipedia)\n\n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.5","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"285938","installSize":"285938","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.2","currency":"USD","filename":"com.appible.revelationsofawifeaudio_1.0.5_all.ipk","free":false,"images":[{"thumbnail":"8547\/icon\/S\/icon1_0_5.png","screenshot":"8547\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"},{"thumbnail":"8547\/icon\/S\/icon1_0_5.png","screenshot":"8547\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"}]}