{"publicApplicationId":"com.appible.righthojeevesaudio","description":"In this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\nBertram Wooster’s manservant, Jeeves, is renowned for his ability to apply his keen intellect to solve all problems domestic, and Bertie’s friends and relatives flock to him for his counsel. But Wooster, jealous of Jeeves’s fame, decides to step in and take over as the fixer of his pal’s engagement, his aunt’s gambling debts and old school-mate’s desire to propose marriage. How far will Bertie sink them all in the soup? Will Jeeves come to the rescue? “Right Ho, Jeeves” features of course Bertie and Jeeves as well as Gussie Fink-Nottle, Tuppie Glossop, Aunt Dahlia and Anatole the high-strung French chef in this P.G. Wodehouse farce of England’s upper crust. (Summary by Mark Nelson)\n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.5","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"276968","installSize":"276968","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.2","currency":"USD","filename":"com.appible.righthojeevesaudio_1.0.5_all.ipk","free":false,"images":[{"thumbnail":"8551\/icon\/S\/icon1_0_5.png","screenshot":"8551\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"},{"thumbnail":"8551\/icon\/S\/icon1_0_5.png","screenshot":"8551\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"}]}