{"publicApplicationId":"com.appible.sailingalonearoundtheworldaudio","description":"In this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\n    Joshua Slocum was the first man to sail around the world alone in a small boat. He personally rebuilt an 11.2 metre sloop-rigged fishing boat that he named the Spray. On April 24, 1895, he set sail from Boston, Massachusetts. More than three years later, he returned to Newport, Rhode Island, on June 27, 1898 having circumnavigated the world, a distance of 46,000 miles (74,000 km).\n\n    In 1899 he described the voyage in Sailing Alone Around the World now considered a classic of travel literature. It is a wonderful adventure story from the Age of Sail and a book of which Arthur Ransome declared, “boys who do not like this book ought to be drowned at once.”\n    (Summary by Alan Chant and Wikipedia)\n\n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.5","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"280540","installSize":"280540","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.2","currency":"USD","filename":"com.appible.sailingalonearoundtheworldaudio_1.0.5_all.ipk","free":false,"images":[{"thumbnail":"8556\/icon\/S\/icon1_0_5.png","screenshot":"8556\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"},{"thumbnail":"8556\/icon\/S\/icon1_0_5.png","screenshot":"8556\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"}]}