{"publicApplicationId":"com.appible.shortsciencefictioncollection009audio","description":"In this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\nScience Fiction is speculative literature that generally explores the consequences of ideas which are roughly consistent with nature and scientific method, but are not facts of the author’s contemporary world. The stories often represent philosophical thought experiments presented in entertaining ways. Protagonists typically “think” rather than “shoot” their way out of problems, but the definition is flexible because there are no limits on an author’s imagination. The reader-selected stories presented here were written prior to 1962 and became US public domain texts when their copyrights expired. (Summary by Gregg Margarite) \n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.5","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"304464","installSize":"304464","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.2","currency":"USD","filename":"com.appible.shortsciencefictioncollection009audio_1.0.5_all.ipk","free":false,"images":[{"thumbnail":"8559\/icon\/S\/icon1_0_5.png","screenshot":"8559\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"},{"thumbnail":"8559\/icon\/S\/icon1_0_5.png","screenshot":"8559\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"}]}