{"publicApplicationId":"com.appible.skyislandaudio","description":"In this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\nSky Island (1912) was the second of three titles written by Baum featuring a spunky girl from California, Trot, and her companion, the old sailorman, Cap’n Bill. Baum had hoped to end the Oz series in 1910 and the following year he introduced Trot and Cap’n Bill in The Sea Fairies. In Sky Island, they journey to an island in the sky by means of an enchanted umbrella belonging to Button Bright, a character who first appeared in The Road to Oz (1909). The trio is then captured by the Boolaroo of the Blues, a monarch who is both comical and dangerous, escape to the country of the “Pinks”, and eventually regain the magic umbrella and return back to earth. This is one of Baum’s best fantasy books and contains enough not-so-veiled commentary on race and politics to interest adults as well. However, it (and The Sea Fairies) did not sell as well as the Oz books and Baum resumed writing them in 1913. He subsequently brought Trot and Cap’n Bill to Oz in 1915 in The Scarecrow of Oz.\n(Summary by Judy Bieber)\n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.5","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"292210","installSize":"292210","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.2","currency":"USD","filename":"com.appible.skyislandaudio_1.0.5_all.ipk","free":false,"images":[{"thumbnail":"8581\/icon\/S\/icon1_0_5.png","screenshot":"8581\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"},{"thumbnail":"8581\/icon\/S\/icon1_0_5.png","screenshot":"8581\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"}]}