{"publicApplicationId":"com.appible.somethingnewaudio","description":"In this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\nWhen the absent-minded Earl of Emsworth wanders off with the pride of his scarab collection, American millionaire J. Preston Peters is willing to pay $5000 to the person who can get it back for him. Discretion is necessary since Peters’ daughter is engaged to Emsworth’s son. Joan Valentine and Ashe Marson both decide to go after the reward—she as Aline Peter’s ladies maid, and he as Mr. Peter’s valet—and they all end up at Blandings Castle. But is it possible for anyone to steal back the scarab with The Efficient Baxter ever vigilant? This is, IMHO, one of Wodehouse’s funniest novels. –Debra Lynn \n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.5","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"279172","installSize":"279172","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.2","currency":"USD","filename":"com.appible.somethingnewaudio_1.0.5_all.ipk","free":false,"images":[{"thumbnail":"8583\/icon\/S\/icon1_0_5.png","screenshot":"8583\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"},{"thumbnail":"8583\/icon\/S\/icon1_0_5.png","screenshot":"8583\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"}]}