{"publicApplicationId":"com.appible.theadventuresofpaddybeaveraudio","description":"In this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\nThe Adventures of Paddy Beaver is another in the long list of children’s books by the conservationist, Thornton W. Burgess. In this book, the industrious and clever Paddy Beaver, a newcomer to the Green Forest, has encounters with Sammy Jay, Jerry Muskrat, Ol’ Man Coyote and other inhabitants of the Green Forest. Along the way, we learn how Paddy builds his dam and his house, and how he stores his food. We also learn little lessons about life, such as the importance of planning before doing, caring for Nature, trusting others, the benefits of working together and how wonderful it is to have a job one can sink one’s teeth into. (Summary by John Lieder.)\n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.5","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"279522","installSize":"279522","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.2","currency":"USD","filename":"com.appible.theadventuresofpaddybeaveraudio_1.0.5_all.ipk","free":false,"images":[{"thumbnail":"8593\/icon\/S\/icon1_0_5.png","screenshot":"8593\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"},{"thumbnail":"8593\/icon\/S\/icon1_0_5.png","screenshot":"8593\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"}]}