{"publicApplicationId":"com.appible.theadventuresofreddyfoxaudio","description":"In this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\n    The Adventures of Reddy Fox is another in the series of children’s stories by conservationist Thornton W. Burgess. In this story, Reddy and Granny Fox must outsmart Farmer Brown’s Boy who is out to get Reddy for stealing his pet chicken. Along the way, Reddy encounters many of the citizens of the Green Meadows and the Green Forest and with him we learn little lessons about life such as: the perils of being a show off; the importance of using all of one’s senses; that it is a fine thing to show sympathy and kindness to others – even our enemies; and that the value of a grandmother’s wisdom is inestimable.\n\n    We also learn that after you’ve stolen a boy’s pet chicken and he is coming your way with a gun, a shovel and a hound dog, it may be time to beat a hasty retreat.\n    (Summary by John Lieder)\n\n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.5","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"279986","installSize":"279986","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.2","currency":"USD","filename":"com.appible.theadventuresofreddyfoxaudio_1.0.5_all.ipk","free":false,"images":[{"thumbnail":"8594\/icon\/S\/icon1_0_5.png","screenshot":"8594\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"},{"thumbnail":"8594\/icon\/S\/icon1_0_5.png","screenshot":"8594\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"}]}