{"publicApplicationId":"com.appible.theballandthecrossaudio","description":"In this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\nThe Ball and the Cross is G. K. Chesterton's third novel. In the introduction Martin Gardner notes that it is a \"mixture of fantasy, farce and theology.\" Gardner continues: \"Evan MacIan is a tall, dark-haired, blue-eyed Scottish Highlander and a devout Roman Catholic.... James Turnbull is a short, red-haired, gray-eyed Scottish Lowlander and a devout but naive atheist.... The two meet when MacIan smashes the window of the street office where Turnbull publishes an atheist journal. This act of rage occurs when MacIan sees posted on the shop's window a sheet that blasphemes the Virgin Mary, presumably implying she was an adulteress who gave birth to an illegitimate Jesus. When MacIan challenges Turnbull to a duel to the death, Turnbull is overjoyed. For twenty years no one had paid the slightest attention to his Bible bashing. Now at last someone is taking him seriously! Most of the rest of the story is a series of comic events in which the two enemies wander about seeking a spot for their duel.\" MacIan and Turnbull become friends as they protect each other from interference from the modern world, which has trivialized their views over life's most important question (the existence of God) and outlawed their honorable duel. The irony is heightened when they both fall in love with ladies who happen to hold to their opponent's deepest convictions. (Summary by Matthew Heckel) \n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.5","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"291920","installSize":"291920","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.2","currency":"USD","filename":"com.appible.theballandthecrossaudio_1.0.5_all.ipk","free":false,"images":[{"thumbnail":"8597\/icon\/S\/icon1_0_5.png","screenshot":"8597\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"},{"thumbnail":"8597\/icon\/S\/icon1_0_5.png","screenshot":"8597\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"}]}