{"publicApplicationId":"com.appible.thecolorsofspaceaudiotext","description":"This Plus version of The Colors of Space includes both audio and text so you can follow along or read without the audio.\n\nIn this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\nBart Steele, Space Academy graduate, is on his way home to his father’s business – he runs a fleet of spaceships for interstellar travel. The secret for fast interstellar travel though is still tightly kept by the alien race Lhari. An agreement between humans and Lhari has been made that permits humans only to travel in cold sleep as passengers aboard Lhari vessels as to not reveal the secret.\nSome humans – the Mentorians – have had a slight genetic shift which enhanced their vision to withstand the light levels that the aliens Lhari use and live in. Mentorians perceive a wider optical spectrum than ordinary humans – some can see the ‘eighth color’. Mentorians act as translators, middleman and interpreters between the two races. But their ability sets them apart from the rest of humanity. Bart, half Mentorian, has this ability.\nBart, surgically altering his appearance to hire as a Lhari on a homeworld bound Lhari vessel, attempts to steal the secret of the Warp Drive – an attempt on which countless humans spies have failed before. (Summary by Stephan Möbius)\n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.5","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"305344","installSize":"305344","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.8","currency":"USD","filename":"com.appible.thecolorsofspaceaudiotext_1.0.5_all.ipk","free":false,"images":[{"thumbnail":"8604\/icon\/S\/icon1_0_5.png","screenshot":"8604\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"},{"thumbnail":"8604\/icon\/S\/icon1_0_5.png","screenshot":"8604\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"}]}