{"publicApplicationId":"com.appible.thecomingraceaudio","description":"In this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\nEdward George Earle Lytton was a florid, popular writer of his day, who coined such phrases as “the great unwashed”, “pursuit of the almighty dollar”, “the pen is mightier than the sword”, and the infamous incipit “It was a dark and stormy night.” Despite his popularity in his heyday, today his name is known as a byword for bad writing. San Jose State University holds an annual Bulwer-Lytton Fiction Contest for bad writing in which contestants have to supply terrible openings of imaginary novels, inspired by his novel Paul Clifford, which opens with the famous words: “It was a dark and stormy night”.\n\nThe Coming Race drew heavily on his interest in the occult and contributed to the birth of the science fiction genre. Unquestionably, its story of a subterranean race of men waiting to reclaim the surface is one of the first science fiction novels. The novel centres on a young, independently wealthy traveler (the narrator), who accidentally finds his way into a subterranean world occupied by beings who seem to resemble angels, who call themselves Vril-ya. The hero soon discovers that they are descendants of an antediluvian civilisation who live in networks of subterranean caverns linked by tunnels. The narrator suggests that in time, the Vril-ya will run out of habitable spaces underground and will start claiming the surface of the earth, destroying mankind in the process, if necessary. (Summary compiled from Wikipedia)\n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.5","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"291632","installSize":"291632","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.2","currency":"USD","filename":"com.appible.thecomingraceaudio_1.0.5_all.ipk","free":false,"images":[{"thumbnail":"8605\/icon\/S\/icon1_0_5.png","screenshot":"8605\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"},{"thumbnail":"8605\/icon\/S\/icon1_0_5.png","screenshot":"8605\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"}]}