{"publicApplicationId":"com.appible.thecritiqueofpurereasonaudio","description":"In this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\n    The Critique of Pure Reason, first published in 1781 with a second edition in 1787, has been called the most influential and important philosophical text of the modern age.\n\n    Kant saw the Critique of Pure Reason as an attempt to bridge the gap between rationalism (there are significant ways in which our concepts and knowledge are gained independently of sense experience) and empiricism (sense experience is the ultimate source of all our concepts and knowledge) and, in particular, to counter the radical empiricism of David Hume (our beliefs are purely the result of accumulated habits, developed in response to accumulated sense experiences). Using the methods of science, Kant demonstrates that though each mind may, indeed, create its own universe, those universes are guided by certain common laws, which are rationally discernable. (Summary by M.L. Cohen)\n\n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.5","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"278322","installSize":"278322","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.2","currency":"USD","filename":"com.appible.thecritiqueofpurereasonaudio_1.0.5_all.ipk","free":false,"images":[{"thumbnail":"8607\/icon\/S\/icon1_0_5.png","screenshot":"8607\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"},{"thumbnail":"8607\/icon\/S\/icon1_0_5.png","screenshot":"8607\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"}]}