{"publicApplicationId":"com.appible.thedevilspoolaudio","description":"In this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\n    George Sand (the pen name of Amantine-Lucile-Aurore Dupin 1804-1876) is famous for flaunting the conventions of behavour expected of women of her standing in France at the time and for her numerous romantic liaisons including her long standing affair with Frédéric Chopin. The Devil’s Pool (published in 1846 as La Mare au Diable) is one of several short pastoral novels drawn from her childhood experiences in the rural French region of Berri. It tells the story of a young widower, Germain, who, at the insistence of his father-in-law, sets out to remarry so that he will have someone to help raise his three young children.\n\n    Summary written by the reader.\n\n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.5","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"276640","installSize":"276640","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.2","currency":"USD","filename":"com.appible.thedevilspoolaudio_1.0.5_all.ipk","free":false,"images":[{"thumbnail":"8610\/icon\/S\/icon1_0_5.png","screenshot":"8610\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"},{"thumbnail":"8610\/icon\/S\/icon1_0_5.png","screenshot":"8610\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"}]}