{"publicApplicationId":"com.appible.thegoldensayingsofepictetusaudio","description":"In this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\nEpictetus (Greek: Ἐπίκτητος; AD 55 – AD 135) was a Greek Stoic philosopher. He was born a slave at Hierapolis, Phrygia (present day Pamukkale, Turkey), and lived in Rome until banishment when he went to Nicopolis in northwestern Greece where he lived the rest of his life. His teachings were noted down and published by his pupil Arrian in his Discourses. Philosophy, he taught, is a way of life and not just a theoretical discipline. To Epictetus, all external events are determined by fate, and are thus beyond our control, but we can accept whatever happens calmly and dispassionately. Individuals, however, are responsible for their own actions, which they can examine and control through rigorous self-discipline. Suffering arises from trying to control what is uncontrollable, or from neglecting what is within our power. As part of the universal city that is the universe, human beings have a duty to care for all fellow humans. The person who followed these precepts would achieve happiness and peace of mind. (Summary by Wikipedia)\n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.5","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"280464","installSize":"280464","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.2","currency":"USD","filename":"com.appible.thegoldensayingsofepictetusaudio_1.0.5_all.ipk","free":false,"images":[{"thumbnail":"8618\/icon\/S\/icon1_0_5.png","screenshot":"8618\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"},{"thumbnail":"8618\/icon\/S\/icon1_0_5.png","screenshot":"8618\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"}]}