{"publicApplicationId":"com.appible.thegreenfairybookaudio","description":"In this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\nAndrew Lang's Fairy Books or Andrew Lang's \"Coloured\" Fairy Books constitute a twelve-book series of fairy tale collections. Although Andrew Lang did not collect the stories himself from the oral tradition, the extent of his sources, who had collected them originally (with the notable exception of Madame d'Aulnoy), made them an immensely influential collection, especially as he used foreign-language sources, giving many of these tales their first appearance in English. As acknowledged in the prefaces, although Lang himself made most of the selections, his wife and other translators did a large portion of the translating and telling of the actual stories.\n\n\"The irony of Lang's life and work is that although he wrote for a profession—literary criticism; fiction; poems; books and articles on anthropology, mythology, history, and travel ... he is best recognized for the works he did not write.\"\nMany of the books were illustrated by Henry J. Ford, Lancelot Speed, and G. P. Jacomb-Hood also contributed some illustrations. \n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.5","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"279442","installSize":"279442","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.2","currency":"USD","filename":"com.appible.thegreenfairybookaudio_1.0.5_all.ipk","free":false,"images":[{"thumbnail":"8620\/icon\/S\/icon1_0_5.png","screenshot":"8620\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"},{"thumbnail":"8620\/icon\/S\/icon1_0_5.png","screenshot":"8620\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"}]}