{"publicApplicationId":"com.appible.thehouseofthesevengablesaudio","description":"In this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\n    The House of the Seven Gables is a gloomy New England mansion, haunted from its foundation by fraudulent dealings, accusations of witchcraft, and sudden death. The current resident, the dignified but desperately poor Hepzibah Pyncheon, opens a shop in a side room to support her brother Clifford, who is about to leave prison after serving twenty-five years for murder. She refuses all assistance from her unpleasant wealthy cousin Judge Jaffrey Pyncheon. A distant relative, the pretty young Phoebe, turns up and quickly becomes invaluable, charming customers and rousing Clifford from depression. A delicate romance grows between Phoebe and the mysterious lodger Holgrave, who is writing a history of the Pyncheon family.\n\n    The House of the Seven Gables is set mainly in the mid-19th century, with glimpses into the history of the house, which was built in the late 17th century. The primary interest of this book is in the subtle and involved descriptions of character and motive.\n    (Summary from Wikipedia)\n\n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.5","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"279632","installSize":"279632","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.2","currency":"USD","filename":"com.appible.thehouseofthesevengablesaudio_1.0.5_all.ipk","free":false,"images":[{"thumbnail":"8622\/icon\/S\/icon1_0_5.png","screenshot":"8622\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"},{"thumbnail":"8622\/icon\/S\/icon1_0_5.png","screenshot":"8622\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"}]}