{"publicApplicationId":"com.appible.theitaliancookbookaudiotext","description":"This Plus version of The Italian Cook Book includes both audio and text so you can follow along or read without the audio.\n\nIn this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\nOne of the beneficial results of the Great War has been the teaching of thrift to the American housewife. For patriotic reasons and for reasons of economy, more attention has been bestowed upon the preparing and cooking of food that is to be at once palatable, nourishing and economical.\n\nIn the Italian cuisine we find in the highest degree these three qualities. That it is palatable, all those who have partaken of food in an Italian trattoria or at the home of an Italian family can testify, that it is healthy the splendid manhood and womanhood of Italy is a proof more than sufficient. And who could deny, knowing the thriftiness of the Italian race, that it is economical?\n\nIt has therefore been thought that a book of practical recipes of the Italian cuisine could be offered to the American public with hope of success. It is not a pretentious book, and the recipes have been made as clear and simple as possible. Some of the dishes described are not peculiar to Italy. All, however, are representative of the Cucina Casalinga of the peninsular Kingdom, which is not the least product of a lovable and simple people, among whom the art of living well and getting the most out of life at a moderate expense has been attained to a very high degree. (Preface of the book)  \n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.5","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"279832","installSize":"279832","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.8","currency":"USD","filename":"com.appible.theitaliancookbookaudiotext_1.0.5_all.ipk","free":false,"images":[{"thumbnail":"8631\/icon\/S\/icon1_0_5.png","screenshot":"8631\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"},{"thumbnail":"8631\/icon\/S\/icon1_0_5.png","screenshot":"8631\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"}]}