{"publicApplicationId":"com.appible.thejoyfulwisdomaudio","description":"In this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\n    The Joyful Wisdom (later translated as The Gay Science), written in 1882, just before Zarathustra, is rightly judged to be one of Nietzsche’s best books. Here the essentially grave and masculine face of the poet-philosopher is seen to light up and suddenly break into a delightful smile. The warmth and kindness that beam from his features will astonish those hasty psychologists who have never divined that behind the destroyer is the creator, and behind the blasphemer the lover of life. In the retrospective valuation of his work which appears in Ecce Homo the author himself observes with truth that the fourth book, “Sanctus Januarius,” deserves especial attention: “The whole book is a gift from the Saint, and the introductory verses express my gratitude for the most wonderful month of January that I have ever spent.” Book fifth “We Fearless Ones”, the Appendix “Songs of Prince Free-as-a-Bird,” and the Preface, were added to the second edition in 1887.\n\n    (Summary by Dr Oscar Levy)\n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.5","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"278748","installSize":"278748","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.2","currency":"USD","filename":"com.appible.thejoyfulwisdomaudio_1.0.5_all.ipk","free":false,"images":[{"thumbnail":"8634\/icon\/S\/icon1_0_5.png","screenshot":"8634\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"},{"thumbnail":"8634\/icon\/S\/icon1_0_5.png","screenshot":"8634\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"}]}