{"publicApplicationId":"com.appible.thelawandtheladyaudio","description":"In this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\nValeria Brinton marries Eustace Woodville despite objections from Woodville's family leading to disquiet for Valeria's own family and friends.\n\nJust a few days after the wedding, various incidents lead Valeria to suspect her husband is hiding a dark secret in his past and she discovers that he has been using a false name. He refuses to discuss it leading them to curtail their honeymoon and return to London where Valeria learns that he was on trial for his first wife's murder by arsenic. He was tried in a Scottish court and the verdict was 'Not Proven' rather than 'not guilty' implying his guilt but without enough proof for a jury to convict him.\n\nValeria sets out to save their happiness by proving her husband innocent of the crime. In her quest, she comes across the disabled character Miserrimus Dexter, a fascinating but mentally unstable genius, and his devoted female cousin, Ariel. Dexter will prove crucial to uncovering the disturbing truth behind the mysterious death. (Introduction by wikipedia) \n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.5","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"288174","installSize":"288174","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.2","currency":"USD","filename":"com.appible.thelawandtheladyaudio_1.0.5_all.ipk","free":false,"images":[{"thumbnail":"8642\/icon\/S\/icon1_0_5.png","screenshot":"8642\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"},{"thumbnail":"8642\/icon\/S\/icon1_0_5.png","screenshot":"8642\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"}]}