{"publicApplicationId":"com.appible.thelogofacowboyaudio","description":"In this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\nThe Log of a Cowboy is an account of a five-month drive of 3,000 cattle from Brownsville, Texas, to Montana in 1882 along the Great Western Cattle Trail. Although the book is fiction, it is firmly based on Adams's own experiences on the trail, and it is considered by many to be the best account of cowboy life in literature. Adams was disgusted by the unrealistic cowboy fiction being published in his day; The Log of a Cowboy was his response. It is still in print, and even modern reviewers consider it a compelling classic. The Chicago Herald said: \"As a narrative of cowboy life, Andy Adams' book is clearly the real thing. It carries its own certificate of authentic first-hand experience on every page.\" (Introduction by wikipedia) \n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.5","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"298384","installSize":"298384","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.2","currency":"USD","filename":"com.appible.thelogofacowboyaudio_1.0.5_all.ipk","free":false,"images":[{"thumbnail":"8646\/icon\/S\/icon1_0_5.png","screenshot":"8646\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"},{"thumbnail":"8646\/icon\/S\/icon1_0_5.png","screenshot":"8646\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"}]}