{"publicApplicationId":"com.appible.thelongestjourneyaudio","description":"In this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\nFrederick Elliot is a student at early 20th century Cambridge, a university that seems like paradise to him, amongst bright if cynical companions, when he receives a visit from two friends, an engaged young woman, Agnes Pembroke, and her older brother, Herbert. The Pembrokes are Rickie’s only friends from home. An orphan who grew up living with cousins, he was sent to a public (boarding) school where he was shunned and bullied because of his lame foot, an inherited weakness, and frail body. Agnes, as it happens, is engaged to Gerald, now in the army, who was one of the sturdy youths who bullied Rickie at school. Rickie is not brilliant at argument, but he is intensely responsive to poetry and art, and is accepted within a circle of philosophical and intellectual fellow-students led by a brilliant but especially cynical aspiring philosopher, Stuart Ansell, who refuses, when he is introduced to her, even to acknowledge that Agnes exists. (from Wikipedia)\n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.5","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"278420","installSize":"278420","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.2","currency":"USD","filename":"com.appible.thelongestjourneyaudio_1.0.5_all.ipk","free":false,"images":[{"thumbnail":"8647\/icon\/S\/icon1_0_5.png","screenshot":"8647\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"},{"thumbnail":"8647\/icon\/S\/icon1_0_5.png","screenshot":"8647\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"}]}