{"publicApplicationId":"com.appible.theloststradivariusaudiotext","description":"This Plus version of The Lost Stradivarius includes both audio and text so you can follow along or read without the audio.\n\nIn this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\nThe Lost Stradivarius (1895), by J. Meade Falkner, is a short novel of ghosts and the evil that can be invested in an object, in this case an extremely fine Stradivarius violin. After finding the violin of the title in a hidden compartment in his college rooms, the protagonist, a wealthy young heir, becomes increasingly secretive as well as obsessed by a particular piece of music, which seems to have the power to call up the ghost of its previous owner. Roaming from England to Italy, the story involves family love, lordly depravity, and the tragedy of obsession (Summary by Wikipedia)\n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.5","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"288642","installSize":"288642","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.8","currency":"USD","filename":"com.appible.theloststradivariusaudiotext_1.0.5_all.ipk","free":false,"images":[{"thumbnail":"8649\/icon\/S\/icon1_0_5.png","screenshot":"8649\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"},{"thumbnail":"8649\/icon\/S\/icon1_0_5.png","screenshot":"8649\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"}]}