{"publicApplicationId":"com.appible.themanfromglengarryaudio","description":"In this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\nWith international book sales in the millions, Ralph Connor was the best-known Canadian novelist of the first two decades of the Twentieth Century. The Man from Glengarry was his most popular and accomplished work. Immediately after its publication in 1901, the novel spent several months in the top ranks of the New York Times \"Books in Demand\" list.\n\nWe follow the story of Ranald Macdonald, who is shaped by family and community in rural eastern Ontario in the early decades after Canadian confederation. This is a book about the making of men, but also, ultimately, about the making of a nation, as the mature Ranald moves west to take a leadership role in the fledgling province of British Columbia.\n\nThe Man from Glengarry features adventure and romance, and is, above all, a work of serious moral purpose. \"Ralph Connor\" was the pen-name of the Reverend Charles Gordon, a prominent Canadian minister, and his stories are woven through with his religious convictions. His is a two-fisted Christianity — or, as he said in his autobiography, a religion that can appeal to \"red-blooded\" people who aren't afraid to engage in physical conflict for causes that they know are right. (Summary by Bruce Pirie) \n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.5","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"285044","installSize":"285044","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.2","currency":"USD","filename":"com.appible.themanfromglengarryaudio_1.0.5_all.ipk","free":false,"images":[{"thumbnail":"8651\/icon\/S\/icon1_0_5.png","screenshot":"8651\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"},{"thumbnail":"8651\/icon\/S\/icon1_0_5.png","screenshot":"8651\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"}]}