{"publicApplicationId":"com.appible.themanwhoknewtoomuchaudio","description":"In this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\nGilbert Keith Chesterton (1874-1936) was an influential and prolific English writer of the early 20th century. He was a journalist, a poet and a novelist. He wrote 80 books and 200 short stories in addition to his other work. He is perhaps best remembered for his ‘Father Brown’ stories; two collections of which are available at Librivox.org.\n‘The Man Who Knew Too Much’ has some similarities to the Father Brown stories: Horne Fisher the eponymous hero is connected and indeed related to many of the high-ranking politicians of his age and thus ‘knows too much’ about the background of the mysteries in which he becomes embroiled and which he unravels. (Summary by Martin Clifton)\n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.5","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"287036","installSize":"287036","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.2","currency":"USD","filename":"com.appible.themanwhoknewtoomuchaudio_1.0.5_all.ipk","free":false,"images":[{"thumbnail":"8653\/icon\/S\/icon1_0_5.png","screenshot":"8653\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"},{"thumbnail":"8653\/icon\/S\/icon1_0_5.png","screenshot":"8653\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"}]}