{"publicApplicationId":"com.appible.themeltingofmollyaudio","description":"In this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\n    Meet Molly: a quirky, spirited twenty-five-year old, widowed for 6 years, living in picturesque Hillsboro with her aunt amidst gossipy neighbors, on a strict diet, and in serious boy trouble. There’s Arthur, her childhood sweetheart; then, there’s the enigmatic, charming Judge Wade; and of course, there’s her cousin Tom; and then, her infuriating neighbor, John Moore… But who will melt her heart?\n\n    It is Arthur’s return, and his seemingly simple request of wanting to see her in the same blue dress she wore when he left, that throws everything into turmoil…\n\n    Sometimes, one can only find some solace in one’s garden.\n\n    Narrated in a refreshingly modern and playful style by none other than Molly herself, this book is the British magazine version; there’s a significantly different American novel version. (Summary by Elli, Julie VW and Stav Nisser) \n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.5","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"285666","installSize":"285666","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.2","currency":"USD","filename":"com.appible.themeltingofmollyaudio_1.0.5_all.ipk","free":false,"images":[{"thumbnail":"8656\/icon\/S\/icon1_0_5.png","screenshot":"8656\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"},{"thumbnail":"8656\/icon\/S\/icon1_0_5.png","screenshot":"8656\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"}]}