{"publicApplicationId":"com.appible.themovingpicturegirlsaudio","description":"In this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\n    Ruth and Alice DeVere and their father Hosmer struggle to make ends meet in New York City – times are hard, even for a talented actor like Mr. DeVere. Just as he successfully auditions for a new play, an old voice affliction renders him terribly hoarse and he loses the role. Despite voice rest and medical treatment, Mr. DeVere’s voice fails to improve, and it is impossible to find theatre work.\n\n    A friend and neighbour in their apartment building suggests that Mr. DeVere tries acting in the moving pictures (which being silent, would not need him to speak at all) but Mr. DeVere considers that business to be common and cheap. However, when they receive an eviction notice, and local shops refuse to extend credit, Mr. DeVere may have no choice … and where he goes, his daughters will follow.\n\n    Summary by Cori Samuel.\n\n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.5","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"279874","installSize":"279874","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.2","currency":"USD","filename":"com.appible.themovingpicturegirlsaudio_1.0.5_all.ipk","free":false,"images":[{"thumbnail":"8661\/icon\/S\/icon1_0_5.png","screenshot":"8661\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"},{"thumbnail":"8661\/icon\/S\/icon1_0_5.png","screenshot":"8661\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"}]}