{"publicApplicationId":"com.appible.theoresteiaaudio","description":"In this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\nThe Oresteia is a trilogy by Aeschylus, one of the foremost playwrights of ancient Greece. It encompasses three plays: Agamemnon, The Libation Bearers, and The Furies. It tells the tragic tale of the House of Atreus, whose inhabitants have been cursed and are doomed to play out their bloody, vengeful destinies. At the beginning of the first part, the Trojan War has ended and the Greek general, Agamemnon, is returning victorious to his wife Clytemnestra. Yet she finds it difficult to forgive his sacrifice of their daughter, Iphigenia, who was killed to ensure the Greek fleet fair winds in their voyage to Troy. Her desire for vengeance, and its dire consequences, instigates the action of these poetic tragedies. (Summary by Elizabeth Klett)  \n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.5","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"278838","installSize":"278838","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.2","currency":"USD","filename":"com.appible.theoresteiaaudio_1.0.5_all.ipk","free":false,"images":[{"thumbnail":"8669\/icon\/S\/icon1_0_5.png","screenshot":"8669\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"},{"thumbnail":"8669\/icon\/S\/icon1_0_5.png","screenshot":"8669\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"}]}