{"publicApplicationId":"com.appible.theothersideofthedooraudio","description":"In this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\nIt's 1865 in the city of San Francisco. Pretty, young Ellie Fenwick is walking to the market early one morning to surprise her father with some fresh mushrooms. As she passes a gambling house, she hears a gunshot and two young men emerge. One man falls dead on the pavement and the other is Johnny Montgomery, a handsome young man Ellie recognizes from seeing him previously at a dance. Johnny is holding a smoking pistol in his hand. This incident propels the proper young Ellie into a world of prisons and courtrooms as a murder trial unfolds and the fate of Johnny may rest with her testimony. But, what is the connection with the mysterious Spanish Woman, who lives in a grand house and supposedly has friends in 'high places'? Who else was in the gambling house at that time of the morning before it had opened? What about the whispered conversations between Ellie's father, Mr. Fenwick, and his friend, Mr. Bingley, a prominent attorney prosecuting the case? Things are not always what they may seem... (Introduction by Lee Ann Howlett)  \n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.5","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"289114","installSize":"289114","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.2","currency":"USD","filename":"com.appible.theothersideofthedooraudio_1.0.5_all.ipk","free":false,"images":[{"thumbnail":"8670\/icon\/S\/icon1_0_5.png","screenshot":"8670\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"},{"thumbnail":"8670\/icon\/S\/icon1_0_5.png","screenshot":"8670\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"}]}