{"publicApplicationId":"com.appible.theoutlineofsciencevol1audio","description":"In this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\n    Regardless of your personal sentiments on Darwin’s theory of evolution, Thomson provides well-chosen examples that illustrate why this theory arose. He examines not only the fossil record but the evidences present in modern living beings that the process of evolution is by no means finished, but ongoing.\n\n    Even at that time, Thomson worried over the future of energy sources. He contemplated the exhaustion of the coal fields and indeed, the eventual exhaustion of all usable energy in the universe, foreshadowing our concept of entropy.\n\n    This book has been consistently among the “Top 100 E-Books” published by Project Gutenberg.\n\n    Summary by Mark F. Smith. \n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.5","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"279540","installSize":"279540","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.2","currency":"USD","filename":"com.appible.theoutlineofsciencevol1audio_1.0.5_all.ipk","free":false,"images":[{"thumbnail":"8671\/icon\/S\/icon1_0_5.png","screenshot":"8671\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"},{"thumbnail":"8671\/icon\/S\/icon1_0_5.png","screenshot":"8671\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"}]}