{"publicApplicationId":"com.appible.thepathofprosperityaudio","description":"In this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\n    Summary from The Path of Prosperity:\n\n    I looked around upon the world, and saw that it was shadowed by sorrow and scorched by the fierce fires of suffering. And I looked for the cause. I looked around, but could not find it; I looked in books, but could not find it; I looked within, and found there both the cause and the self-made nature of that cause. I looked again, and deeper, and found the remedy.\n\n    I found one Law, the Law of Love; one Life, the Life of adjustment to that Law; one Truth, the truth of a conquered mind and a quiet and obedient heart. And I dreamed of writing a book which should help men and women, whether rich or poor, learned or unlearned, worldly or unworldly, to find within themselves the source of all success, all happiness, all accomplishment, all truth. And the dream remained with me, and at last became substantial; and now I send it forth into the world on its mission of healing and blessedness, knowing that it cannot fail to reach the homes and hearts of those who are waiting and ready to receive it. \n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.5","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"288580","installSize":"288580","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.2","currency":"USD","filename":"com.appible.thepathofprosperityaudio_1.0.5_all.ipk","free":false,"images":[{"thumbnail":"8672\/icon\/S\/icon1_0_5.png","screenshot":"8672\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"},{"thumbnail":"8672\/icon\/S\/icon1_0_5.png","screenshot":"8672\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"}]}