{"publicApplicationId":"com.appible.thephantomoftheoperaaudiotext","description":"This Plus version of The Phantom of the Opera includes both audio and text so you can follow along or read without the audio.\n\nIn this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\nChristine Daae was brought up in the Paris Opera house. Her musician father suddenly dies, telling her he will send her an angel of music to look after her. She grows up and discovers that she is hearing a voice, telling her and teaching her to sing. She believes he is the angel of music but he is known in the Opera House simply as The Phantom. Although she is fascinated and drawn towards the phantom, she falls in love with her childhood sweetheart, The Vicomte de Chagny - or Raoul - but the Phantom won't take this lightly... (Summary by Ralph Snelson)\n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.5","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"278260","installSize":"278260","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.8","currency":"USD","filename":"com.appible.thephantomoftheoperaaudiotext_1.0.5_all.ipk","free":false,"images":[{"thumbnail":"8674\/icon\/S\/icon1_0_5.png","screenshot":"8674\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"},{"thumbnail":"8674\/icon\/S\/icon1_0_5.png","screenshot":"8674\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"}]}