{"publicApplicationId":"com.codingbees.headlines","description":"Stay up-to-date on the latest news around the web with style!\nHeadlines is an app that fetches Google News to provide you with the latest news available all around the web. It shows all the standard available Google News feeds and allows you to add your own custom keyword based feeds.\n\nFeatures:\n\n- enable&disable all available standard Google News feeds\n- add as many custom Google News feeds based on keywords\n- In-App view of headlines with Google Mobilizer\/Instapaper Mobilizer support for better readability\n- Support for 36 local news feeds available (see full list below)\n- Send articles directly to Instapaper or Read it Later (both require separate account)\n- Share stories via Mail, Facebook, Messaging, different Twitter apps (completely customizable)\n- Context Menu (Tap&Hold) a article to access sharing options without opening story\n- different themes\n- auto-refresh times configurable\n\nSupported local news:\nAustralia, India, Israel, Malaysia, New Zealand, Singapore, 中国版 (China), 香港版 (Hong Kong), 日本 (Japan), Belgique, Česká republika, Deutschland, España, France, Ireland, Italia, Nederland, Norge, Österreich, Polska, Portugal, Schweiz, South Africa, Suisse, Sverige, Türkiye, U.K.,Argentina, Brasil, Canada English, Canada Français, Chile, Colombia, Cuba, Estados Unidos, México, U.S.\n\nAvailable in English & German.\n\nChangelog:\n- fixed load timeout on app start\n- added more themes (Old Newspaper, Red, Retro Style)\n- integrated webView now supports choosen theme when using a mobilizer\n- font size now also affects the topics view\n- added font submenu to inline view for fast size changes (temporary)\n- power swipe (2-fingers left\/right) in main scene to jump quickly from first to last topic and backwards\n- power scroll (2-fingers top\/bottom) in topic view scene to jump quickly to the bottom or top of an article\n- enhanced\/fixed German translation","version":"1.0.2","homeURL":"http:\/\/codingbees.com","supportURL":"http:\/\/codingbees.com","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2011 The CodingBees","licenseURL":"http:\/\/codingbees.com","locale":null,"appSize":"1101770","installSize":"1101770","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.98","currency":"USD","filename":"com.codingbees.headlines_1.0.2_all.ipk","free":false,"images":[{"thumbnail":"8687\/icon\/S\/icon_1_0_2.png","screenshot":"8687\/icon\/S\/icon_1_0_2.png","orientation":"P","device":"P"}]}