{"publicApplicationId":"com.appible.thepupilaudio","description":"In this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\nPemberton, a young American with an Oxford education and out of money, takes a job tutoring Morgan Moreen, the 12-year old son of an American couple living in Europe in a style not quite matched by their income. Morgan, who is highly intelligent, is also precocious and perceptive enough to understand his parents' pretentious aimlessness. Nor, as it happens, do his parents pay Pemberton the salary to which they'd agreed -- shouldn't he be satisfied, after all, by his life with them, and by the joy of tutoring young Morgan? Alternately charmed and put off by the Moreen family, Pemberton is left to choose between his attachment to his young pupil and his need to get on in life. (Summary by Nicholas Clifford) \n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.5","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"278672","installSize":"278672","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.2","currency":"USD","filename":"com.appible.thepupilaudio_1.0.5_all.ipk","free":false,"images":[{"thumbnail":"8745\/icon\/S\/icon1_0_5.png","screenshot":"8745\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"},{"thumbnail":"8745\/icon\/S\/icon1_0_5.png","screenshot":"8745\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"}]}