{"publicApplicationId":"com.appible.theregentaudiotext","description":"This Plus version of The Regent includes both audio and text so you can follow along or read without the audio.\n\nIn this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\n'The Regent' is, if not a sequel to 'The Card', then a 'Further Adventures of' the eponymous hero of that novel.\n\nDenry Machin is now forty-three and begins to feel that he is getting old, that making money and a happy home life are not enough and that he has lost his touch as the entrepreneur and entertainer of the 'Five Towns'.\n\nIn fact, as he says to himself 'What I want is change - and a lot of it too!'. A chance meeting at the local theatre leads to his going to London and then... (Summary by A.J.M.)\n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.5","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"279556","installSize":"279556","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.8","currency":"USD","filename":"com.appible.theregentaudiotext_1.0.5_all.ipk","free":false,"images":[{"thumbnail":"8746\/icon\/S\/icon1_0_5.png","screenshot":"8746\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"},{"thumbnail":"8746\/icon\/S\/icon1_0_5.png","screenshot":"8746\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"}]}