{"publicApplicationId":"com.appible.theriverwaranaccountofthereconquestofthesudanaudio","description":"In this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\nWhen the self-proclaimed Mahdi (“Guided One”) gathered Islamic forces and kicked the Anglo-Egyptians out of the Sudan, he unleashed a backlash. With the image of the heroic General Charles Gordon dying at Khartoum, the British public was ready to support a war to reclaim the lost territories. And when the political time was right, a British-Egyptian-Sudanese expedition led by the redoubtable Herbert Kitchener set out to do just that.\n\nThe river involved was the Nile. For millennia, its annual flood has made habitable a slender strip, though hundreds of miles of deserts, between its tributaries and its delta. Through this desolate region, man and beast struggled to supply the bare essentials of life. Though this same region, the expedition had to find and defeat an enemy several times larger than itself.\n\nThe young Churchill was hot to gain war experience to aid his career, and so he wangled a transfer to the 21st Lancers and participated in the last successful cavalry charge the world ever saw, in the climactic battle of Omdurman. He also had a position as war correspondent for the Morning Post, and on his return to England he used his notes to compose this book. \n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.5","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"304502","installSize":"304502","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.2","currency":"USD","filename":"com.appible.theriverwaranaccountofthereconquestofthesudanaudio_1.0.5_all.ipk","free":false,"images":[{"thumbnail":"8748\/icon\/S\/icon1_0_5.png","screenshot":"8748\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"},{"thumbnail":"8748\/icon\/S\/icon1_0_5.png","screenshot":"8748\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"}]}