{"publicApplicationId":"com.appible.thestoryofasoulaudio","description":"In this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\nMarie Francoise Therese Martin, affectionately known as ‘The Little Flower’, was born on January 2, 1873, in Alencon, France to Louis Martin and Zelie Guerin. She was the youngest and one of five surviving sisters of the nine Martin children. When Therese was 3, her mother died. Louis Martin moved his family to Lisieux to be closer to his late wife’s brother and his family. It was there that Therese’s sister, Pauline, entered the Carmel at Lisieux on October 2, 1882. Therese at that time also heard the Divine Call to religious life. Therese entered the Carmel on April 9, 1888, after much oppostion to her entering at the age of 15. It was there that she wrote L’Histoire d’une Ame (The Story of a Soul) through obedience. Eventually, Therese’s other sisters entered the religious life, one at the Carmel of Lisieux and the other became a Poor Clare at the Visitation Convent at Caen. Therese died on September 30, 1897, at the Carmel of Lisieux of tuberculosis. She was beatified on April 29, 1923 and canonized on May 17, 1925. (Summary written by Ann Boulais.)\n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.5","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"280164","installSize":"280164","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.2","currency":"USD","filename":"com.appible.thestoryofasoulaudio_1.0.5_all.ipk","free":false,"images":[{"thumbnail":"8764\/icon\/S\/icon1_0_5.png","screenshot":"8764\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"},{"thumbnail":"8764\/icon\/S\/icon1_0_5.png","screenshot":"8764\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"}]}