{"publicApplicationId":"com.appible.thestoryofmarymaclaneaudio","description":"In this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\nAt the age of 19 in 1902, MacLane published her first book, The Story of Mary MacLane. It sold 100,000 copies in the first month and was popular among young girls, but was strongly criticized by conservative readers, and lightly ridiculed by H. L. Mencken. She had always chafed at living in Butte, which was a small mining town, and used the money from sales of this book to move to Greenwich Village where she continued to write books and newspaper articles.\nSome critics have suggested that even by today’s standards, MacLane’s writing is raw, honest, unflinching, self-aware, sensual and extreme. She wrote openly about egoism and her own self-love, about sexual attraction and love for other women, and even about her desire to marry the devil. (Summary from Wikipedia) \n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.5","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"280248","installSize":"280248","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.2","currency":"USD","filename":"com.appible.thestoryofmarymaclaneaudio_1.0.5_all.ipk","free":false,"images":[{"thumbnail":"8767\/icon\/S\/icon1_0_5.png","screenshot":"8767\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"},{"thumbnail":"8767\/icon\/S\/icon1_0_5.png","screenshot":"8767\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"}]}