{"publicApplicationId":"com.appible.thestoryofmormonismaudiotext","description":"This Plus version of The Story of Mormonism includes both audio and text so you can follow along or read without the audio.\n\nIn this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\nA few years before James E. Talmage was called to serve as an apostle for the Church of Jesus Christ of Latter-day Saints (also known as the \"Mormon\" church), he gave a series of lectures at universities such as the University of Michigan and Cornell, describing the history of the Church. These lectures were later compiled and published as 'The Story of \"Mormonism.\"' It is a concise, yet informative summary for all interested in learning the history and beliefs of the \"Mormon\" church. (Summary by Nathan Markham)\n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.5","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"281754","installSize":"281754","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.8","currency":"USD","filename":"com.appible.thestoryofmormonismaudiotext_1.0.5_all.ipk","free":false,"images":[{"thumbnail":"8769\/icon\/S\/icon1_0_5.png","screenshot":"8769\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"},{"thumbnail":"8769\/icon\/S\/icon1_0_5.png","screenshot":"8769\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"}]}