{"publicApplicationId":"com.codebeyond.appbox","description":"LIMITED DISCOUNT: The app will be on sale for a limited time. Buy it today. WHATS NEW (v1.5.0) Added two NEW Apps. 1.Blood Pressure Recorder app to record and track blood pressure. 2. Expenses app to track any type of expense including travel, budget, shopping calculator etc.  OVERVIEW: Appbox is a collection of twenty (20) full featured apps for the Palm that anyone can use. Apps include passwords, tip calculator, days until, birthdays, converter, weight tracker, fuel log, loan calculator, grocery comparison, scientific calculator, countdown, stop watch, flashlight and many more. DATA SECURITY: All data within Appbox is stored securely on the non media partition.WHY APPBOX: Save space on your phone. Organize all apps centrally. Do not waste time finding apps on your phone. No ads. Consistent quality across apps. Continuously improved and updated based on user feedback. One low price. Free updates. SELECTED DESCRIPTIONS: . 1. Birthdays - Create birthdays and get reminders. Pull contacts from your phone automatically. Manage items on Calendar. 2.Days Until - Countdown to important dates and events in your life. Manage items on calendar. 3.Passwords - Store all your passwords on the Palm protected by a master password. 4. Converter - Convert unit measures from one unit to another in 14 categories. 5. Loan Calculator – Calculates a wide variety of loans and gives amortization schedule. 6. Weight tracker – Track your weight and view progress in list and graph view. 7. Fuel Log – Calculate your fuel efficiency as well as track its progress over time. 8. Countdown - Countdown timer with sound and vibration alarms 9. Stop Watch with lap counter for your Palm. 10. Tip Calculator - Calculate single tips and split bills. App remembers settings.","version":"1.5.0","versionNote":"","homeURL":"http:\/\/appbox.codebeyond.com","supportURL":"http:\/\/appbox.codebeyond.com","custsupportemail":"appbox@codebeyond.com","custsupportphonenum":"","copyright":"copyright 2010 Code Beyond Inc.","licenseURL":"","locale":"en_US","appSize":3007728,"installSize":12517376,"isEncrypted":false,"adultRating":false,"islocationbased":false,"lastModifiedTime":"2010-11-08T15:36:34.000+0000","mediaLink":null,"mediaIcon":null,"attributes":{"provides":{"noApp":false,"dockMode":false,"universalSearch":false,"connectors":[],"services":[],"optimizedUserExperience":false}},"price":0.99,"currency":"USD","isAdvertized":false,"filename":"com.codebeyond.appbox_1.5.0_all.ipk","free":false,"touchpad_exclusive":false,"images":{"1":{"thumbnail":"877\/en\/images\/1\/S\/dashboard.png","screenshot":"877\/en\/images\/1\/L\/dashboard.png","orientation":"P","device":"P"},"2":{"thumbnail":"877\/en\/images\/2\/S\/days-until.png","screenshot":"877\/en\/images\/2\/L\/days-until.png","orientation":"P","device":"P"},"3":{"thumbnail":"877\/en\/images\/3\/S\/converter.png","screenshot":"877\/en\/images\/3\/L\/converter.png","orientation":"P","device":"P"},"4":{"thumbnail":"877\/en\/images\/4\/S\/tip.png","screenshot":"877\/en\/images\/4\/L\/tip.png","orientation":"P","device":"P"},"5":{"thumbnail":"877\/en\/images\/5\/S\/password.png","screenshot":"877\/en\/images\/5\/L\/password.png","orientation":"P","device":"P"}}}