{"publicApplicationId":"com.appible.thetrailofthehawkaudiotext","description":"This Plus version of The Trail of the Hawk includes both audio and text so you can follow along or read without the audio.\n\nIn this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\n    (Summary by Mike Vendetti)Trail of the Hawk, narrated by Mike Vendetti aka Miketheauctioneer, is Sinclair Lewis’ second novel published under his own name. \n\nWe travel with The Hawk, or Carl Ericson, son of Norwegian immigrants, born at the end of the 19th century through the first three adventurous periods of the young man’s life. We see him as an adventurous boy, running away with Gertie Cowels, the girl that lives in the big house in the better part of town, only to be rescued by Bone Stillman, a backwoods philosopher and influence on Carl.\n\n    We travel with him as he leaves his childhood, Gertie and Joralemon behind, for a short attempt at higher education, then to pursue the hobo life, a Bowery bartender, an engineer in Panama and an aviator. It is during the aviator phase that he becomes Hawk Ericson barnstorming his way across America, an exciting but dangerous lifestyle. Leaving aviation after too many close calls, and the loss of his best friend, he becomes an automobile man, and moves into phase three.\n\n    It is in phase three, love adventure, that we find The Hawk in New York, mingling with polite society quite by accident. He is smitten by Ruth Winslow, while riding on a streetcar after a fight with Gertie, and follows Ruth to a party which he crashes.\n\n    Mike Vendetti  \n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.5","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"300984","installSize":"300984","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.8","currency":"USD","filename":"com.appible.thetrailofthehawkaudiotext_1.0.5_all.ipk","free":false,"images":[{"thumbnail":"8798\/icon\/S\/icon1_0_5.png","screenshot":"8798\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"},{"thumbnail":"8798\/icon\/S\/icon1_0_5.png","screenshot":"8798\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"}]}