{"publicApplicationId":"com.appible.thevoyageofthebeagleaudio","description":"In this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\nThe book, also known as Darwin’s Journal of Researches, is a vivid and exciting travel memoir as well as a detailed scientific field journal covering biology, geology, and anthropology that demonstrates Darwin’s keen powers of observation, written at a time when Western Europeans were still discovering and exploring much of the rest of the world. Although Darwin revisited some areas during the expedition, for clarity the chapters of the book are ordered by reference to places and locations rather than chronologically. With hindsight, ideas which Darwin would later develop into his theory of evolution by natural selection are hinted at in his notes and in the book (Summary from Wikipedia).\n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.5","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"300312","installSize":"300312","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.2","currency":"USD","filename":"com.appible.thevoyageofthebeagleaudio_1.0.5_all.ipk","free":false,"images":[{"thumbnail":"8806\/icon\/S\/icon1_0_5.png","screenshot":"8806\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"},{"thumbnail":"8806\/icon\/S\/icon1_0_5.png","screenshot":"8806\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"}]}