{"publicApplicationId":"com.appible.thewardenaudio","description":"In this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\nIn the mid nineteenth century there were a number of financial scandals in the Church of England including those of Rochester, where the endowments which should have supported the King’s School Canterbury had been diverted to the Dean and Chapter; and of the hospital of St Cross at Winchester where the Rev. Francis North, later the Earl of Guildford, had been appointed to the mastership of the hospital by his father the bishop. The revenues of the hospital were very considerable, the work involved minimal. The scandal soon broke.\n\nTrollope based ‘The Warden’ on the St Cross case, but in the novel the Warden is a kindly, devoted, priest, beloved by all that knew him and is racked by fear that he is accepting money to which he is not entitled. His antagonist is his prospective son-in-law John Bold and his (somewhat unwelcome) ally is one of Trollope’s strongest characters, the Archdeacon of Barchester, Dr. Theophilus Grantly. (summary by Andy Minter)\n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.5","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"287772","installSize":"287772","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.2","currency":"USD","filename":"com.appible.thewardenaudio_1.0.5_all.ipk","free":false,"images":[{"thumbnail":"8807\/icon\/S\/icon1_0_5.png","screenshot":"8807\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"},{"thumbnail":"8807\/icon\/S\/icon1_0_5.png","screenshot":"8807\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"}]}