{"publicApplicationId":"com.appible.thewastelandaudio","description":"In this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\nThe Waste Land is a highly influential 433-line modernist poem by T. S. Eliot. It is perhaps the most famous and most written-about long poem of the 20th century, dealing with the decline of civilization and the impossibility of recovering meaning in life. Despite the alleged obscurity of the poem—its shifts between satire and prophecy, its abrupt and unannounced changes of speaker, location and time, its elegiac but intimidating summoning up of a vast and dissonant range of cultures and literatures—the poem has nonetheless become a familiar touchstone of modern literature. Among its famous phrases are “April is the cruelest month” (its first line); “I will show you fear in a handful of dust”; and “Shantih shantih shantih” (its last line). The title is sometimes mistakenly written as “The Wasteland”. (Summary from wikipedia.org)\n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.5","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"278410","installSize":"278410","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.2","currency":"USD","filename":"com.appible.thewastelandaudio_1.0.5_all.ipk","free":false,"images":[{"thumbnail":"8808\/icon\/S\/icon1_0_5.png","screenshot":"8808\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"},{"thumbnail":"8808\/icon\/S\/icon1_0_5.png","screenshot":"8808\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"}]}