{"publicApplicationId":"com.appible.thewillowsaudio","description":"In this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\nA tale of horror in which a pleasant sojourn down the Danube tumbles terrifyingly awry as the veil between this world and an unfathomably weird dimension is inadvertently pierced by an innocent pair of vacationers, “The Willows”, arguably Algernon Blackwood’s seminal contribution to supernatural literature, has had a lasting influence on the field. No less a personage than H. P. Lovecraft describing it as “…the greatest weird tale ever written.” A reading will reveal a clear influence to one familiar with Lovecraft’s work. The masterful handling of mystery and suspense that build to a quite satisfyingly unnerving crescendo may be particularly noted by the discerning aficionado of the genre.(Summary by Michael T. Robinson)\n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.5","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"289808","installSize":"289808","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.2","currency":"USD","filename":"com.appible.thewillowsaudio_1.0.5_all.ipk","free":false,"images":[{"thumbnail":"8815\/icon\/S\/icon1_0_5.png","screenshot":"8815\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"},{"thumbnail":"8815\/icon\/S\/icon1_0_5.png","screenshot":"8815\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"}]}