{"publicApplicationId":"com.appible.thewomaninwhiteaudio","description":"In this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\n    The Woman in White is an epistolary novel written by Wilkie Collins in 1859, serialized in 1859-1860, and first published in book form in 1860. It is considered to be to the first mystery novel, and is widely regarded as one of the first (and finest) in the genre of ’sensation novels’….\n\n    The Woman in White is also an early example of a particular type of Collins narrative in which several characters in turn take up the telling of the story. This creates a complex web in which readers are unsure which narrator can, and cannot, be trusted. Collins used this technique in his other novels, including The Moonstone. This technique was copied by other novelists, including Bram Stoker, author of Dracula (1897), although by the end of the 19th century the technique was considered “old-fashioned”. (Summary from Wikipedia) \n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.5","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"288992","installSize":"288992","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.2","currency":"USD","filename":"com.appible.thewomaninwhiteaudio_1.0.5_all.ipk","free":false,"images":[{"thumbnail":"8817\/icon\/S\/icon1_0_5.png","screenshot":"8817\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"},{"thumbnail":"8817\/icon\/S\/icon1_0_5.png","screenshot":"8817\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"}]}