{"publicApplicationId":"com.jiyer.classifieds2go","description":"\/\/Please rate us on how well the app delivers on its current functionality.  Share your feedback and its easy to add features to a future update. \/\/   With this app you have the largest database of local classifieds at your fingertips. Shop for used cars, motorcycles, homes for sale, apartments for rent, jobs, pets for sale, sports & concert tickets, and services.   You can currently search for classifieds in 5 countries: USA, UK, Canada, India and Ireland.    Features:   Search thousands of local classifieds sites at once.      Narrow down using categories and filters.    Automatically saves your last 7 searches along with all the filter options.  Easily repeat a previous search in one tap.   Search by city, state or by zip.  Search in or around a city or the entire country.    Remembers your last used location, category, country and distance even if you close and restart the app.    Filter the searches with additional search options.  Restrict results by, distance, mileage, price, bedrooms, bathrooms, seller type, industry, job type & year.   Easily scroll through the results in a list.  You can go to the original listing by tapping on result and selecting ‘Open Web Page’.    Each result shows which site carries that specific listing.   Quickly share a listing with others using email\/text.  The app neatly composes the email\/text with a title and a link.   Please watch for scams and follow typical safety precautions.  Always deal locally.  Classifieds powered by Oodle.com.  Content owned by Oodle and respective third-party sites.  Tags: real estate, rentals, boats, commercial vehicles, motorcycle, rv, coupon, education, entertainment, finance, food, health, massage, local,  newspaper ads,  appliance, construction, electrical, furniture, plumbing, lawn, pool, tech, transportation, theater, book, business,  clothes, shopping, accessories, jewelry, collectible, computers, electronics, kids, music, sports, sale, toys, legal,  work,  art, housing, office. ","version":"1.0.1","versionNote":"","homeURL":"http:\/\/www.jiyer.com\/classifieds2go","supportURL":"http:\/\/www.jiyer.com\/classifieds2go","custsupportemail":"classifieds2go@jiyer.com","custsupportphonenum":"..","copyright":"copyright 2010 SealsMedia","licenseURL":"","locale":"en_US","appSize":26422,"installSize":1565651,"isEncrypted":false,"adultRating":false,"islocationbased":false,"lastModifiedTime":"2010-03-02T13:45:50.000+0000","mediaLink":null,"mediaIcon":null,"attributes":{"provides":{"noApp":false,"dockMode":false,"universalSearch":false,"connectors":[],"services":[],"optimizedUserExperience":false}},"price":0,"currency":"USD","isAdvertized":false,"filename":"com.jiyer.classifieds2go_1.0.1_all.ipk","free":false,"touchpad_exclusive":false,"images":{"1":{"thumbnail":"882\/en\/images\/1\/S\/classifieds2go-1.png","screenshot":"882\/en\/images\/1\/L\/classifieds2go-1.png","orientation":"P","device":"P"},"2":{"thumbnail":"882\/en\/images\/2\/S\/classifieds2go-2.png","screenshot":"882\/en\/images\/2\/L\/classifieds2go-2.png","orientation":"P","device":"P"},"3":{"thumbnail":"882\/en\/images\/3\/S\/classifieds2go-3.png","screenshot":"882\/en\/images\/3\/L\/classifieds2go-3.png","orientation":"P","device":"P"},"4":{"thumbnail":"882\/en\/images\/4\/S\/classifieds2go-4.png","screenshot":"882\/en\/images\/4\/L\/classifieds2go-4.png","orientation":"P","device":"P"},"5":{"thumbnail":"882\/en\/images\/5\/S\/classifieds2go-5.png","screenshot":"882\/en\/images\/5\/L\/classifieds2go-5.png","orientation":"P","device":"P"}}}