{"publicApplicationId":"com.appible.thewoodbeyondtheworldaudio","description":"In this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\n    The Wood beyond the World is a fantasy novel by William Morris, perhaps the first modern fantasy writer to unite an imaginary world with the element of the supernatural, and thus the precursor of much of present-day fantasy literature. His use of archaic language has been seen by some modern readers as making his fiction difficult to read, but brings a wonderful atmosphere to the telling.\n\n    Morris considered his fantasies a revival of the medieval tradition of chivalrous romances. In consequence, they tend to have sprawling plots of strung-together adventures. In this story, Walter leaves his father and his own unfaithful wife and sets sail in search of adventure. This he finds aplenty, encountering love, treachery and magic in the Wood of the title and travelling through the Mountains of the Folk of the Bears. But can he find happiness and peace by means of this Quest?\n\n    Summary by Cori with reference to Wikipedia.\n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.5","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"291934","installSize":"291934","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.2","currency":"USD","filename":"com.appible.thewoodbeyondtheworldaudio_1.0.5_all.ipk","free":false,"images":[{"thumbnail":"8820\/icon\/S\/icon1_0_5.png","screenshot":"8820\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"},{"thumbnail":"8820\/icon\/S\/icon1_0_5.png","screenshot":"8820\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"}]}