{"publicApplicationId":"com.appible.threemenandamaidaudiotext","description":"This Plus version of Three Men and a Maid includes both audio and text so you can follow along or read without the audio.\n\nIn this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\n    This book with two titles, Three Men and a Maid in the USA and The Girl on the Boat in the UK is a typical P.G. Wodehouse romantic comedy, involving, at various times: a disastrous talent quest, a lawyer with a revolver, a bulldog with a mind of his own and a suit of armour!\n\n    The maid, or marriageable young woman, of the American title is red-haired, dog-loving Wilhelmina “Billie” Bennet. The three men are Bream Mortimer, a long-time friend and admirer of Billie, Eustace Hignett, a poet of sensitive disposition who is engaged to Billie at the opening of the tale, and Sam Marlowe, Eustace’s would-be-dashing cousin, who falls for Billie at first sight. All four find themselves on an ocean liner headed for England together (hence the British title), along with an elephant-gun-wielding young woman called Jane Hubbard who is smitten with Eustace the poet. Typically Wodehousian romantic shenanigans ensue. Even Estace’s redoubtable mother (a Theosophist author and public speaker) fails to quell the excitement. (Summary by WikiPedia, adapted by Tim Bulkeley.) \n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.5","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"285936","installSize":"285936","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.8","currency":"USD","filename":"com.appible.threemenandamaidaudiotext_1.0.5_all.ipk","free":false,"images":[{"thumbnail":"8822\/icon\/S\/icon1_0_5.png","screenshot":"8822\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"},{"thumbnail":"8822\/icon\/S\/icon1_0_5.png","screenshot":"8822\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"}]}