{"publicApplicationId":"com.appible.threesoldiersaudiotext","description":"This Plus version of Three Soldiers includes both audio and text so you can follow along or read without the audio.\n\nIn this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\nThree Soldiers, the second novel by John Dos Passos, follows the experiences of several young Americans thrown into the confusion and brutality of World War I.\n\nWritten when the author was just twenty-three, it was key to the development of a realistic depiction of war in American literature, and earned Dos Passos, later named by Jean-Paul Sartre \"the greatest living writer of our time\", important early attention.\n\nCritic H L Menken said of it: \"no war story can be written in the United States without challenging comparison with it--and no story that is less meticulously true will stand up to it. It changed the whole tone of American opinion about the war; it even changed the recollections of actual veterans of the war. They saw, no doubt, substantially what Dos Passos saw, but it took his bold realism to disentangle their recollections from the prevailing buncombe and sentimentality\". (Summary by mb \n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.5","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"277014","installSize":"277014","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.8","currency":"USD","filename":"com.appible.threesoldiersaudiotext_1.0.5_all.ipk","free":false,"images":[{"thumbnail":"8824\/icon\/S\/icon1_0_5.png","screenshot":"8824\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"},{"thumbnail":"8824\/icon\/S\/icon1_0_5.png","screenshot":"8824\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"}]}