{"publicApplicationId":"com.appible.toletvoliiiaudio","description":"In this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\n    ‘The Forsyte Saga’ is the story of a wealthy London family stretching from the eighteen-eighties until the nineteen-twenties.\n\n    To Let is the third and final book in the saga (although Galsworthy later published two further trilogies which extend the story). We are now in 1920, about twenty years since Irene married Young Jolyon and gave birth to John and since Soames married Annette, who gave him a daughter, Fleur. The two sides of the family have not met since those times and John and Fleur do not even know of each other’s existence.\n\n    All the old Forsytes are dead except for Timothy. Val and Holly have returned from South Africa and Val is training racehorses in Sussex. June has opened her gallery near Cork Street.\n\n    Soames arranges to meet Fleur at June’s gallery and while there, and again later in a patisserie, they see Irene and John. Soames ignores them but Fleur and John are attracted to one another at a distance. As they leave, Fleur drops her handkerchief…\n    (Summary by Andy Minter)\n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.5","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"278418","installSize":"278418","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.2","currency":"USD","filename":"com.appible.toletvoliiiaudio_1.0.5_all.ipk","free":false,"images":[{"thumbnail":"8825\/icon\/S\/icon1_0_5.png","screenshot":"8825\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"},{"thumbnail":"8825\/icon\/S\/icon1_0_5.png","screenshot":"8825\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"}]}