{"publicApplicationId":"com.appible.tractatuslogicophilosophicusaudio","description":"In this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\nTractatus Logico-Philosophicus is the only book-length philosophical work published by the Austrian philosopher Ludwig Wittgenstein during his lifetime. He wrote it as a soldier and a prisoner of war during World War I. The slim volume (fewer than eighty pages) comprises a system of short statements, numbered 1, 1.1, 1.11, 1.12, etc., through to 7, intended to be such that 1.1 is a comment on or elaboration of 1, 1.11 and 1.12 comments on 1.1, and so forth. It is an ambitious project to identify the relationship between language and reality and to define the limits of science. (Summary from Wikipedia) \n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.5","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"279464","installSize":"279464","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.2","currency":"USD","filename":"com.appible.tractatuslogicophilosophicusaudio_1.0.5_all.ipk","free":false,"images":[{"thumbnail":"8827\/icon\/S\/icon1_0_5.png","screenshot":"8827\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"},{"thumbnail":"8827\/icon\/S\/icon1_0_5.png","screenshot":"8827\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"}]}