{"publicApplicationId":"com.appible.trailinaudio","description":"In this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\n    “Max Brand”, the most used pseudonym of Frederick Schiller Faust (1892-1944), is best known today for his western fiction. Faust began in the early twentieth century selling his stories to the pulp magazines, writing in many genres under numerous pseudonyms. He is probably best known as the creator of the character Destry. His novel Destry Rides Again has been filmed several times, most notably the 1939 version starring James Stewart and Marlene Dietrich. Also his character Dr. Kildare which was popularized in film and on television earned him a fortune. Faust’s novel The Untamed, the first of three novels featuring the classic western hero Dan Barry was filmed in 1920, starring Tom Mix.\n\n    Trailin’! (1919) tells the story of Anthony Bard, a young aristocract from the east with a hunger for adventure, who sees his father murdered in the yard of their home. This starts young Anthony on a trail of vengeance that leads him to the far west. Here, Anthony, a tenderfoot with a knack for survival must track down a legendary outlaw who waits for him, not with a gun, but with a story. Along the way he braves the elements, resists a band of cold-blooded killers and finds love. A classic western revenge plot…..with a twist. (summary by Rowdy Delaney) \n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.5","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"297910","installSize":"297910","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.2","currency":"USD","filename":"com.appible.trailinaudio_1.0.5_all.ipk","free":false,"images":[{"thumbnail":"8828\/icon\/S\/icon1_0_5.png","screenshot":"8828\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"},{"thumbnail":"8828\/icon\/S\/icon1_0_5.png","screenshot":"8828\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"}]}