{"publicApplicationId":"com.appible.twoyearsintheforbiddencityaudio","description":"In this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\nTHE author of the following narrative has peculiar qualifications for her task. She is a daughter of Lord Yu Keng, a member of the Manchu White Banner Corps, and one of the most advanced and progressive Chinese officials of his generation. she became First Lady-in-Waiting to the Empress Dowager, and while serving at the Court in that capacity she received the impressions which provide the subject-matter of this book. Her opportunity to observe and estimate the characteristics of the remarkable woman who ruled China for so long was unique, and her narrative throws a new light on one of the most extraordinary personalities of modern times. Yielding to the urgent solicitation of friends, she consented to put some of her experiences into literary form, and the following chronicle, in which the most famous of Chinese women, the customs and atmosphere of her Court are portrayed by an intimate of the same race, is a result. (Summary adapted from the Foreword)\n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.5","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"279418","installSize":"279418","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.2","currency":"USD","filename":"com.appible.twoyearsintheforbiddencityaudio_1.0.5_all.ipk","free":false,"images":[{"thumbnail":"8830\/icon\/S\/icon1_0_5.png","screenshot":"8830\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"},{"thumbnail":"8830\/icon\/S\/icon1_0_5.png","screenshot":"8830\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"}]}