{"publicApplicationId":"com.appible.uneasymoneyaudio","description":"In this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\n    Uneasy Money is a romantic comedy by P.G. Wodehouse, published during the First World War, it offers light escapism. More romantic but only a little less humorous that his mature works, it tells of the vicissitudes of poor Lord Dawlish, who inherits five million dollars, but becomes a serially disappointed groom.\n\n    When the story opens Bill (Lord Dawlish, a thoroughly pleasant man) is engaged to a demanding actress. His first thought when hearing of his massive legacy from a stranger whose tendency to slice he once cured on a West Country golf course is of the disappointed relatives. His trip to the USA attempting to give back the windfall results in complication after complication, including firearms and burglaries as well as the usual human misunderstandings that accompany any human life.\n\n    Uneasy Money was first published as a serial in the Saturday Evening Post in the USA from December 1915, and in the UK in Strand Magazine starting December 1916. It first appeared in book form on March 17, 1916 by D. Appleton \n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.5","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"284856","installSize":"284856","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.2","currency":"USD","filename":"com.appible.uneasymoneyaudio_1.0.5_all.ipk","free":false,"images":[{"thumbnail":"8835\/icon\/S\/icon1_0_5.png","screenshot":"8835\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"},{"thumbnail":"8835\/icon\/S\/icon1_0_5.png","screenshot":"8835\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"}]}