{"publicApplicationId":"com.appible.washingtonsquareaudio","description":"In this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\n    Washington Square is a short novel by Henry James. Originally published in 1880 as a serial in Cornhill Magazine and Harper’s New Monthly Magazine, it is a structurally simple tragicomedy that recounts the conflict between a dull but sweet daughter and her brilliant, domineering father.\n\n    The book is often compared to Jane Austen’s work for the clarity and grace of its prose and its intense focus on family relationships. James was hardly a great admirer of Jane Austen, so he might not have regarded the comparison as flattering. In fact, James was not a great fan of Washington Square itself. He tried to read it over for inclusion in the New York Edition of his fiction (1907-1909) but found that he couldn’t, and the novel was not included. Other readers, though, have sufficiently enjoyed the book to make it one of the more popular works of the Jamesian canon.\n\n    (Summary from Wikipedia).\n\n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.5","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"279306","installSize":"279306","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.2","currency":"USD","filename":"com.appible.washingtonsquareaudio_1.0.5_all.ipk","free":false,"images":[{"thumbnail":"8840\/icon\/S\/icon1_0_5.png","screenshot":"8840\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"},{"thumbnail":"8840\/icon\/S\/icon1_0_5.png","screenshot":"8840\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"}]}