{"publicApplicationId":"com.appible.whatibelieveaudio","description":"In this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\n\"The inner working of my soul, which I wish to speak of here, was not the result of a methodical investigation of doctrinal theology, or of the actual texts of the gospel; it was a sudden removal of all that hid the true meaning of the Christian doctrine – a momentary flash of light, which made everything clear to me. It was something like that which might happen to a man who, after vainly attempting, by a false plan, to build up a statue out of a confused heap of small pieces of marble, suddenly guesses at the figure they are intended to form by the shape of the largest piece; and then, on beginning to set up the statue, finds his guess confirmed by the harmonious joining in of the various pieces.\" (Extract from Chapter 1)\n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.5","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"288914","installSize":"288914","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.2","currency":"USD","filename":"com.appible.whatibelieveaudio_1.0.5_all.ipk","free":false,"images":[{"thumbnail":"8841\/icon\/S\/icon1_0_5.png","screenshot":"8841\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"},{"thumbnail":"8841\/icon\/S\/icon1_0_5.png","screenshot":"8841\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"}]}