{"publicApplicationId":"com.appible.zastrozziaromanceaudio","description":"In this app you can download & store chapters for listening without an internet connection, perhaps on your next flight or road trip. These audiobooks are great for your commute, long trips, hours at the gym or to just listen while washing the dishes.\n\n“Would Julia of Strobazzo’s heart was reeking on my dagger!”\n\nFrom the asthmatic urgency of its opening abduction scene to the Satanic defiance of the villain’s departure “with a wild convulsive laugh of exulting revenge”, this first of Shelley’s Gothic novelettes recycles much sensational boyhood reading and also points to some of his more mature concerns.\n\nIt is the ego-driven pursuit of passionate extremes, revenge included, which consigns figures like Zastrozzi and the murderous Matilda to an isolation which is socially destructive as well as self-annihilating. The story of their downfall is related in a relentlessly hysterical style – possibly more easily enjoyed when read aloud! (Summary by Martin Geeson)\n\nThis audiobook uses recordings from Librivox.org, a community of generous volunteers who record public domain works and then publish their recordings in the public domain. The app is based on drPodder which was graciously provided to the open source community by drnull.","version":"1.0.5","homeURL":"http:\/\/appible.com\/contact","supportURL":"http:\/\/appible.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2010 Appible LLC","licenseURL":"http:\/\/appible.com\/contact","locale":null,"appSize":"290316","installSize":"290316","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.2","currency":"USD","filename":"com.appible.zastrozziaromanceaudio_1.0.5_all.ipk","free":false,"images":[{"thumbnail":"8844\/icon\/S\/icon1_0_5.png","screenshot":"8844\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"},{"thumbnail":"8844\/icon\/S\/icon1_0_5.png","screenshot":"8844\/icon\/S\/icon1_0_5.png","orientation":"P","device":"P"}]}