{"publicApplicationId":"com.defranco.converter","description":"This third release of Converter now has men and women’s clothing, outdoor grill cooking time charts and volume & surface area calculators. This release brings Converter to over 30 types of conversions and several hundreds units. Converter includes all the standard conversions and many esoteric but useful conversions and charts too. For example, drill bit & tap sizes, dress sizes, pants sizes, women and men size to measurements, shirt sizes with tying a tie instructions and height & weight to size conversions. One thumb operation using the virtual number pad and input in both directions makes Converter results instant and super easy. The “Copy” button makes copying results to the clipboard and into other programs a no brainer. Converter, on the fly, can either skip or remember the two units you select for each conversion. The Outdoor Grilling Charts are the recommendations of the most famous grill manufacturer in the world. Converter takes the mystery out of how long and at what temperature to cook just about any kind of food you’d think of (and not think of) putting on a grill. Since this program doesn’t require access to the internet, you can expect every bit of information to be instantaneous and at your finger tips. No embarrassing minutes waiting and wondering if your phone will come up with an answer. All calculations are done with floating point math for accuracy. The Shape Volume & Surface Area calculators allow you to quickly calculate simple and complex combination shapes like partial filled spheres, dome covered silos and “n” sided pyramids and polygons. Ever wonder how many gallons of water are in your neighbor’s round pool with the three pentagon pedestals in the center, or how many more square miles are on the surface of the Earth than on the moon. Well…okay maybe not, bad example but you get the idea, Bug fixes ellipsoid calculation and Mens shirt sizing glitch. ","version":"1.0.5","versionNote":"","homeURL":"http:\/\/home.rr.com\/defranco","supportURL":"http:\/\/home.rr.com\/defranco","custsupportemail":"jdefranco@wi.rr.com","custsupportphonenum":"..","copyright":"De Franco","licenseURL":"","locale":"en_US","appSize":216394,"installSize":13911678,"isEncrypted":false,"adultRating":false,"islocationbased":false,"lastModifiedTime":"2010-02-23T23:03:02.000+0000","mediaLink":null,"mediaIcon":null,"attributes":{"provides":{"noApp":false,"dockMode":false,"universalSearch":false,"connectors":[],"services":[],"optimizedUserExperience":false}},"price":1.5,"currency":"USD","isAdvertized":false,"filename":"com.defranco.converter_1.0.5_all.ipk","free":false,"touchpad_exclusive":false,"images":{"1":{"thumbnail":"893\/en\/images\/1\/S\/converter_2010-01-02_072617.png","screenshot":"893\/en\/images\/1\/L\/converter_2010-01-02_072617.png","orientation":"P","device":"P"},"2":{"thumbnail":"893\/en\/images\/2\/S\/converter_2010-01-02_073305.png","screenshot":"893\/en\/images\/2\/L\/converter_2010-01-02_073305.png","orientation":"P","device":"P"},"3":{"thumbnail":"893\/en\/images\/3\/S\/converter_2010-01-02_073405.png","screenshot":"893\/en\/images\/3\/L\/converter_2010-01-02_073405.png","orientation":"P","device":"P"},"4":{"thumbnail":"893\/en\/images\/4\/S\/converter_2010-01-02_073859.png","screenshot":"893\/en\/images\/4\/L\/converter_2010-01-02_073859.png","orientation":"P","device":"P"},"5":{"thumbnail":"893\/en\/images\/5\/S\/List.png","screenshot":"893\/en\/images\/5\/L\/List.png","orientation":"P","device":"P"}}}