{"publicApplicationId":"com.sumtotalsystems.sumtotalmobility","description":"Leverage the power of SumTotal’s award-winning Software as a Service (SaaS) Learning Management System (LMS) from your mobile device. The SumTotal Mobile application is an app that allows for the secure download and access of mobile-friendly learning content to any webOS device. Upon installing the app you will be asked to provide your SumTotal Maestro username & password. Note: you must have an account for SumTotal Maestro and your account must be mobile-enabled. Please contact your site administrator if you have any questions regarding login or accessibility. Once logged in users can select from a variety of learning modules and activities (including videos and simulations) to download locally to the device - all controlled from a security standpoint based on their learning management system permissions. Content can include tests and knowledge checks with the scores from these exams, as well as overall status of the content, feeding back to the GeoMaestro LMS for reporting purposes. The mobile learning solution delivered by SumTotal Maestro is ideal for organizations looking to educate a mobile and remote workforce with up-to-date product information, sales updates, certification or compliance training, performance support materials, and other types of knowledge and communications. Expand the reach of information to both your internal organization as well as extended enterprise by leveraging SumTotal Maestro's mobility solution and make it more convenient for your employees and partners to gain the knowledge they need, when they need it. \n\nFor sales inquiries or for more information about the SumTotal Mobile, please visit http:\/\/www.sumtotalsystems.com or contact us via phone at 1-866-768-6825.","version":"1.0.2","versionNote":"","homeURL":"http:\/\/www.sumtotalsystems.com","supportURL":"http:\/\/www.sumtotalsystems.com","custsupportemail":"sales@sumtotalsystems.com","custsupportphonenum":"","copyright":"Copyright 2011 SumTotal Systems, Inc.","licenseURL":"","locale":"en_US","appSize":129974,"installSize":3440640,"isEncrypted":false,"adultRating":false,"islocationbased":false,"lastModifiedTime":"2011-05-12T15:19:52.000+0000","mediaLink":null,"mediaIcon":null,"attributes":{"provides":{"noApp":false,"dockMode":false,"universalSearch":false,"connectors":[],"services":[],"optimizedUserExperience":false}},"price":0,"currency":"USD","isAdvertized":false,"filename":"com.sumtotalsystems.sumtotalmobility_1.0.2_all.ipk","free":false,"touchpad_exclusive":false,"images":{"1":{"thumbnail":"8931\/en\/images\/1\/S\/screenshot1.png","screenshot":"8931\/en\/images\/1\/L\/screenshot1.png","orientation":"P","device":"P"},"2":{"thumbnail":"8931\/en\/images\/2\/S\/screenshot2.png","screenshot":"8931\/en\/images\/2\/L\/screenshot2.png","orientation":"P","device":"P"},"3":{"thumbnail":"8931\/en\/images\/3\/S\/screenshot3.png","screenshot":"8931\/en\/images\/3\/L\/screenshot3.png","orientation":"P","device":"P"},"4":{"thumbnail":"8931\/en\/images\/4\/S\/screenshot4.png","screenshot":"8931\/en\/images\/4\/L\/screenshot4.png","orientation":"P","device":"P"},"5":{"thumbnail":"8931\/en\/images\/5\/S\/screenshot5.png","screenshot":"8931\/en\/images\/5\/L\/screenshot5.png","orientation":"P","device":"P"}}}