{"publicApplicationId":"com.kalemsoft.gizmo","description":"Gizmo is an award winning Sega Master System\/GameGear console emulator. You can play hundreds of Sega games, also known as SMS\/GG roms with a single application. Gizmo comes with a sample SMS game. More games can be obtained separately and added to the application simply by placing them into the gizmo folder on the USB drive of the phone. Just connect your phone to your PC via USB cable and select USB drive mode on your phone when prompted. A new drive will appear on your computer. Open the drive by clicking its icon and create a folder named gizmo (all lowercase) there. Then, copy your games with .sms or .gg file extension to the gizmo folder directly (the games may also be zip compressed). Finally, right click on the drive icon and select eject option to exit the USB drive mode. Gizmo will see the games you added next time it is run (sometimes a phone restart may be needed for the file system to recognize the files newly added). Gizmo has the following features. Support for various resolutions including full screen, on screen gamepad, state saving with screenshots, haptic (vibration) feedback and configurable keyboard controls. ** Gizmo was developed from scratch. Many hours were spent on building and testing it over 7 years. It is not based on any Open Source work. We charge for Gizmo just to recover part of the effort put towards building and maintaining it for different PALM devices over 7 years. **","version":"1.0.0","homeURL":"http:\/\/www.kalemsoft.com\/support","supportURL":"http:\/\/www.kalemsoft.com\/support","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2003-2011 KalemSoft","licenseURL":"http:\/\/www.kalemsoft.com\/support","locale":null,"appSize":"473162","installSize":"473162","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"4.99","currency":"USD","filename":"com.kalemsoft.gizmo_1.0.0_all.ipk","free":false,"images":[{"thumbnail":"8986\/images\/1\/L\/sc1.png","screenshot":"8986\/images\/1\/L\/sc1.png","orientation":"P","device":"P"},{"thumbnail":"8986\/images\/2\/L\/sc2.png","screenshot":"8986\/images\/2\/L\/sc2.png","orientation":"P","device":"P"},{"thumbnail":"8986\/images\/3\/L\/sc3.png","screenshot":"8986\/images\/3\/L\/sc3.png","orientation":"P","device":"P"},{"thumbnail":"8986\/images\/4\/L\/sc4.png","screenshot":"8986\/images\/4\/L\/sc4.png","orientation":"P","device":"P"},{"thumbnail":"8986\/images\/5\/L\/sc6.png","screenshot":"8986\/images\/5\/L\/sc6.png","orientation":"P","device":"P"}]}