{"publicApplicationId":"capedcriminal.com","description":"So you want bigger muscles? You want to get stronger?  The only way to get your body into the shape you desire is to improve.  Improve on the amount of weight you lift.  Improve on the number of reps you perform at a certain weight or even how often you work a specific body part. So how do you know if you are actually improving?  Keeping a journal can help. In the journal you write down the weights and reps performed for various exercises.  Unfortunately, every set you perform for a given exercise can be done differently.  You might lift the weight up faster (concentric phase) than last time. You might not pause the weight at peak contraction for the same amount of time as you did last time. You may not keep the same time lowering the weight (Eccentric phase) or you might be changing your resting time between reps.  \"Rep Master CC\" will keep you on track, making sure your sets are consistent, and removing any doubt as to whether you are improving or not.  Rep Master CC, will let you define the speed at which you contract, pause, extend, and rest between each repetition. You set the time desired, Rep Master CC will keep your timing on track and count your repetitions for you.  Start Improving Now! \nFor each rep performed you have 2 movements and 2 potential pauses or \"holds\".  The first movement phase could be concentric (like when performing a bicep curl) or Eccentric (like when performing a standard bench press), Followed by a pause or a holding of the weight in that position, followed by the second movement phase, and finally followed by the final pause before starting another rep.  Each of these 4 phases have a specific time element involved. You could take 1 second for the first movement, followed by no holding, followed by 2 seconds for the second movement, followed by a 1 second pause before performing another rep. Each of these 4 variables can change!\nStart improving! Start knowing for sure with Rep Master CC! (Also 1 Rep Max Calculator!)","version":"1.0.1","versionNote":"","homeURL":"http:\/\/www.capedcriminal.com","supportURL":"http:\/\/www.capedcriminal.com","custsupportemail":"","custsupportphonenum":"","copyright":"copyright 2011","licenseURL":"","locale":"en_US","appSize":79240,"installSize":1277952,"isEncrypted":false,"adultRating":false,"islocationbased":false,"lastModifiedTime":"2012-06-01T22:24:59.000+0000","mediaLink":null,"mediaIcon":null,"attributes":{"provides":{"noApp":false,"dockMode":false,"universalSearch":false,"connectors":["null"],"services":[],"optimizedUserExperience":false}},"price":0.99,"currency":"USD","isAdvertized":false,"filename":"capedcriminal.com_1.0.1_all.ipk","free":false,"touchpad_exclusive":false,"images":{"1":{"screenshot":"9011\/1.0.1\/en\/images\/1\/L\/SS_Begin.jpg","thumbnail":"9011\/1.0.1\/en\/images\/1\/L\/SS_Begin.jpg","orientation":"P","device":"P"},"2":{"screenshot":"9011\/1.0.1\/en\/images\/2\/L\/SS_workout.jpg","thumbnail":"9011\/1.0.1\/en\/images\/2\/L\/SS_workout.jpg","orientation":"P","device":"P"},"3":{"screenshot":"9011\/1.0.1\/en\/images\/3\/L\/SS_settings.jpg","thumbnail":"9011\/1.0.1\/en\/images\/3\/L\/SS_settings.jpg","orientation":"P","device":"P"},"4":{"screenshot":"9011\/1.0.1\/en\/images\/4\/L\/SS_RepMax.jpg","thumbnail":"9011\/1.0.1\/en\/images\/4\/L\/SS_RepMax.jpg","orientation":"P","device":"P"}}}