{"publicApplicationId":"com.patvalsri.znibblepro","description":"*Available for this limited time introductory price*\n\nzNibble Ringtone Maker Pro is the first webOS ringtone creation app. zNibble Ringtone Maker Pro allows you to make ringtones (up to one minute long) of any part, of any song including iTunes, that you currently have on your webOS 2.1+ device. Making ringtones is easy with zNibble Pro. It's fun to use. Just slide your left trimmer to where you want your ringtone to start in the song, then slide your right trimmer to where you want the ringtone to end in the song, tap \"Make Tone\", and shortly thereafter your ringtone will automatically be placed into the Sounds & Ringtones location on your device. You can make a different ringtone for each of your stored contacts.  Make that special ringtone and assign it to your love one for instance, maybe your parents, or anyone you desire. It will better your mood whenever you get a call! \nWhy pay for ringtones and NOT get your favorite part of the song?…. Instead pay for the song and make your own ringtones, as many different versions as you like! With Ringtone Maker Pro you can also make voice tones. This awesome application allows you to add effects to your ringtones and your voice tones such as: fade effect, pitch changes, and more. Features include: Sharing your created ringtones with anyone via email. Convert your ringtone to an MP3. Make any ringtone you create, your phones default ringer right from the app.\n\n*Note that due to webOS limitations ringtones are precise to 3 seconds only.","version":"2.1.03","versionNote":"ver. 2.1.03: Added a new Loudness feature. This will allow you to  increase the natural sound volume of the ringtones you create. Simply put, this added feature will make your ringtones louder regardless whether the original song recordings sound level was naturally low. This has nothing to do with the volume control buttons on your device.","homeURL":"http:\/\/znibble.com","supportURL":"http:\/\/znibble.com","custsupportemail":"patrick@znibble.com","custsupportphonenum":"","copyright":"Copyright 2010 Patick Francis","licenseURL":"","locale":"en_US","appSize":7066124,"installSize":16580608,"isEncrypted":false,"adultRating":false,"islocationbased":false,"lastModifiedTime":"2011-06-07T13:20:09.000+0000","mediaLink":null,"mediaIcon":null,"attributes":{"provides":{"noApp":false,"dockMode":false,"universalSearch":false,"connectors":[],"services":["com.patvalsri.znibblepro.service"],"optimizedUserExperience":false}},"price":1.59,"currency":"USD","isAdvertized":false,"filename":"com.patvalsri.znibblepro_2.1.03_all.ipk","free":false,"touchpad_exclusive":false,"images":{"1":{"thumbnail":"9015\/en\/images\/1\/S\/ph_img0.png","screenshot":"9015\/en\/images\/1\/L\/ph_img0.png","orientation":"P","device":"P"},"2":{"thumbnail":"9015\/en\/images\/2\/S\/ph_img1a.png","screenshot":"9015\/en\/images\/2\/L\/ph_img1a.png","orientation":"P","device":"P"},"3":{"thumbnail":"9015\/en\/images\/3\/S\/ph_img2a.png","screenshot":"9015\/en\/images\/3\/L\/ph_img2a.png","orientation":"P","device":"P"},"4":{"thumbnail":"9015\/en\/images\/4\/S\/ph_img3a.png","screenshot":"9015\/en\/images\/4\/L\/ph_img3a.png","orientation":"P","device":"P"},"5":{"thumbnail":"9015\/en\/images\/5\/S\/ph_img4.png","screenshot":"9015\/en\/images\/5\/L\/ph_img4.png","orientation":"P","device":"P"}}}