{"publicApplicationId":"com.dcco.app.isilo","description":"Document reader for viewing document files in iSilo, Palm Doc, and plain text format.\n\nBonus: Get the complete edition of the CIA World Factbook 2010 for free, with layout optimized for viewing on your webOS device using iSilo. In addition to full information for all the countries of the world, the complete edition contains appendixes, reference maps, field cross-reference links, rank order pages, country profiles for all fields, enlarged flag pages with descriptions, enlarged country maps, and more.\n\nThousands of documents, eBooks, reference works, non-fiction, fiction available for ready download. Create your own documents too.\n\nDocument list provides recently viewed list of documents, ability to categorize documents into single or multiple categories, marking of favorite folders for easy access, and file explorer access to entire document directory with document file management operations, such as copying\/moving\/deleting\/renaming document files.\n\nDocument viewing options provide for font size and typeface selection, along with customizable color themes with selectable background and text colors. Autoscroll with selectable speed. Jump history for easily navigating back and forth when following hyperlinks and jumping to different locations in the document. Documents open to last viewed location. Bookmarks. Document text search.","version":"6.05.0","homeURL":"http:\/\/www.iSilo.com\/support","supportURL":"http:\/\/www.iSilo.com\/support","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 1999-2012 DC & Co., All Rights Reserved.","licenseURL":"http:\/\/www.iSilo.com\/support","locale":null,"appSize":"865388","installSize":"865388","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"9.99","currency":"USD","filename":"com.dcco.app.isilo_6.05.0_all.ipk","free":false,"images":[{"thumbnail":"9073\/icon\/S\/icon_6_05_0.png","screenshot":"9073\/icon\/S\/icon_6_05_0.png","orientation":"P","device":"P"}]}