{"publicApplicationId":"com.scrollmotion.curiousgeorge","description":"Enjoy the beloved CURIOUS GEORGE in a whole new way! ScrollMotion Kids transforms the story of the little monkey with big curiosity into an unparalleled experience on your HP TouchPad.\n\nThe man in the yellow hat discovers Curious George in the jungle and brings him home to the city. In awe of the new wonders all around him, the little monkey lets his curiosity get the better of him. George explores the world, along the way getting himself and the man in the yellow hat into all sorts of misadventures with telephones, balloons and even firefighters! \n\nFEATURES:\n► Complete story narration\n► Illustrated Table of Contents - Instantly jump to your favorite page. \n► Page Flow - Swipe forward and back to move around the illustrations in tandem with the text. \n\nABOUT HOUGHTON MIFFLIN:  Boston-based Houghton Mifflin Harcourt Publishing Company is a global education leader and the world's largest publisher of educational materials for pre-K–12 schools. The Company publishes a comprehensive set of best-in-class educational solutions, ranging from research-based textbook programs to instructional technology to standards-based assessments for students and educators. The Company also publishes an extensive line of reference works and award-winning literature for adults and young readers. With origins dating back to 1832, Houghton Mifflin Harcourt combines its tradition of excellence with a commitment to innovation. To learn more about Houghton Mifflin Harcourt, visit www.hmhpub.com. \n\nABOUT SCROLLMOTION KIDS: ScrollMotion Kids helps families discover new ways to learn and play, combining your favorite childhood stories with the wonder of digital interactivity. To find out more, please visit www.scrollmotionkids.com","version":"1.0.2","homeURL":"http:\/\/scrollmotionkids.com","supportURL":"http:\/\/scrollmotionkids.com","custsupportemail":"","custsupportphonenum":"","copyright":"copyright 2009 by ScrollMotion, Inc.","licenseURL":"http:\/\/scrollmotionkids.com","locale":null,"appSize":"27313156","installSize":"27313156","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.99","currency":"USD","filename":"com.scrollmotion.curiousgeorge_1.0.2_all.ipk","free":false,"images":[{"thumbnail":"9204\/en\/images\/1\/L\/conv_tb_Image00001.jpg","screenshot":"9204\/en\/images\/1\/L\/conv_tb_Image00001.jpg","orientation":"P","device":"T"},{"thumbnail":"9204\/en\/images\/2\/L\/conv_tb_Image00002.jpg","screenshot":"9204\/en\/images\/2\/L\/conv_tb_Image00002.jpg","orientation":"P","device":"T"},{"thumbnail":"9204\/en\/images\/3\/L\/conv_tb_Image00003.jpg","screenshot":"9204\/en\/images\/3\/L\/conv_tb_Image00003.jpg","orientation":"P","device":"T"}]}