{"publicApplicationId":"com.zuuka.fr.kung-fu-panda2","description":"iStoryTime brings the fun and adventure of Kung Fu Panda 2 to your TouchPad. Parents and their children can enjoy images from the film and hear the voices of Po and Tigress directly from the movie. Reviews: \"10 out of 10\" – AppCraver \"...universal app that brings all the fun of the upcoming theatrical release to a storybook filled with images and audio -- including the voices of stars Jack Black and Angelina Jolie..\" - MacLife Follow Po living his dream as the Dragon Warrior protecting the Valley of Peace alongside his friends and fellow kung fu masters, the Furious Five – Tigress, Crane, Mantis, Viper and Monkey. But Po’s new life of awesomeness is threatened by the emergence of a formidable villain who plans to use a secret, unstoppable weapon to conquer China and destroy kung fu. Welcome to iStoryTime, a library of narrated children’s books. iStoryTime books are illustrated and narrated, so your child can enjoy the book even when you’re busy. Best of all, the app is simple to use because it’s designed for kids 2-years and up. iStoryTime has been featured in New York Times, LA Times, CBS Early Show, theiPhoneMom.com, CNET, and winner of the PTPA Media (Parent Tested Parent Approved) Seal of Approval. FEATURES: - Includes actual character audio from the movie - Includes actual images from the movie for authentic experience and - Automatic navigation and ‘narrator’ options make it incredibly simple to use Please CHECK OUT THE LIBRARY OF iStoryTime BOOKS (sold separately) at www.istorytime.com Related Topics: kids books, kids entertainment, education, reading, fun, kids travel apps","version":"1.1.2","homeURL":"http:\/\/istorytime.com\/support","supportURL":"http:\/\/istorytime.com\/support","custsupportemail":"","custsupportphonenum":"","copyright":"2011 DreamWorks Animation L.L.C.","licenseURL":"http:\/\/istorytime.com\/support","locale":null,"appSize":"21816832","installSize":"21816832","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"2.99","currency":"USD","filename":"com.zuuka.fr.kung-fu-panda2_1.1.2_all.ipk","free":false,"images":[{"thumbnail":"9233\/en\/images\/1\/L\/conv_tb_KFP2-1.png","screenshot":"9233\/en\/images\/1\/L\/conv_tb_KFP2-1.png","orientation":"P","device":"T"},{"thumbnail":"9233\/en\/images\/2\/L\/conv_tb_KFP2-2.png","screenshot":"9233\/en\/images\/2\/L\/conv_tb_KFP2-2.png","orientation":"P","device":"T"},{"thumbnail":"9233\/en\/images\/3\/L\/conv_tb_KFP2-3.png","screenshot":"9233\/en\/images\/3\/L\/conv_tb_KFP2-3.png","orientation":"P","device":"T"},{"thumbnail":"9233\/en\/images\/4\/L\/conv_tb_KFP2-4.png","screenshot":"9233\/en\/images\/4\/L\/conv_tb_KFP2-4.png","orientation":"P","device":"T"},{"thumbnail":"9233\/en\/images\/5\/L\/conv_tb_KFP2-5.png","screenshot":"9233\/en\/images\/5\/L\/conv_tb_KFP2-5.png","orientation":"P","device":"T"}]}