{"publicApplicationId":"com.scrollmotion.athome-9780385533591-rh","description":"From one of the most beloved authors of our  time—more than six million copies of his books have been sold in this country alone—a fascinating excursion into the history behind the place we call home. “Houses aren’t refuges from history. They are where history ends up.”  Bill Bryson and his family live in a Victorian parsonage in a part of England where nothing of any great significance has happened since the Romans decamped. Yet one day, he began to consider how very little he knew about the ordinary things of life as he found it in that comfortable home. To remedy this, he formed the idea of journeying about his house from room to room to “write a history of the world without leaving home.” The bathroom provides the occasion for a history of hygiene; the bedroom, sex, death, and sleep; the kitchen, nutrition and the spice trade; and so on, as Bryson shows how each has fig­ured in the evolution of private life. Whatever happens in the world, he demonstrates, ends up in our house, in the paint and the pipes and the pillows and every item of furniture. Bill Bryson has one of the liveliest, most inquisitive minds on the planet, and he is a master at turning the seemingly isolated or mundane fact into an occasion for the most diverting exposi­tion imaginable. His wit and sheer prose fluency make At Home one of the most entertaining books ever written about private life.From the Hardcover edition.","version":"0.9.9","homeURL":"http:\/\/www.scrollmotion.com","supportURL":"http:\/\/www.scrollmotion.com","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright ScrollMotion, Inc.","licenseURL":"http:\/\/www.scrollmotion.com","locale":null,"appSize":"9512840","installSize":"9512840","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"28.96","currency":"USD","filename":"com.scrollmotion.athome-9780385533591-rh_0.9.9_all.ipk","free":false,"images":[{"thumbnail":"9242\/images\/1\/L\/conv_tb_athome-9780385533591-rh_2011-14-06_160929.png","screenshot":"9242\/images\/1\/L\/conv_tb_athome-9780385533591-rh_2011-14-06_160929.png","orientation":"P","device":"T"},{"thumbnail":"9242\/images\/2\/L\/conv_tb_athome-9780385533591-rh_2011-14-06_160944.png","screenshot":"9242\/images\/2\/L\/conv_tb_athome-9780385533591-rh_2011-14-06_160944.png","orientation":"P","device":"T"},{"thumbnail":"9242\/images\/3\/L\/conv_tb_athome-9780385533591-rh_2011-14-06_161030.png","screenshot":"9242\/images\/3\/L\/conv_tb_athome-9780385533591-rh_2011-14-06_161030.png","orientation":"P","device":"T"}]}