{"publicApplicationId":"com.scrollmotion.confessionsofashopaholic-9780440334453-rh","description":"BONUS: This edition contains an excerpt from Sophie Kinsella’s Mini Shopaholic  Rebecca Bloomwood just hit rock bottom.  But she's never looked better....  Becky   Bloomwood has a fabulous flat in London's trendiest neighborhood, a troupe of glamorous   socialite friends, and a closet brimming with the season's must-haves. The only trouble   is that she can't actually afford it -- not any of it.   Her job writing at Successful   Savings not only bores her to tears, it doesn't pay much at all. And lately Becky's   been chased by dismal letters from Visa and the Endwich Bank -- letters with large   red sums she can't bear to read -- and they're getting ever harder to ignore.   She   tries cutting back; she even tries making more money. But none of her efforts succeeds.   Becky's only consolation is to buy herself something ... just a little something...  Finally a story arises that Becky actually cares about, and her front-page article   catalyzes a chain of events that will transform her life--and the lives of those   around her--forever.   Sophie Kinsella has brilliantly tapped into our collective   consumer conscience to deliver a novel of our times -- and a heroine who grows stronger   every time she weakens. Becky Bloomwood's hilarious schemes to pay back her debts   are as endearing as they are desperate. Her \"confessions\" are the perfect pick-me-up   when life is hanging in the (bank) balance.","version":"0.9.9","homeURL":"http:\/\/www.scrollmotion.com","supportURL":"http:\/\/www.scrollmotion.com","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright ScrollMotion, Inc.","licenseURL":"http:\/\/www.scrollmotion.com","locale":null,"appSize":"4600624","installSize":"4600624","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"7.99","currency":"USD","filename":"com.scrollmotion.confessionsofashopaholic-9780440334453-rh_0.9.9_all.ipk","free":false,"images":[{"thumbnail":"9251\/images\/1\/L\/conv_tb_confessionsofashopaholic-9780440334453-rh_2011-14-06_161214.png","screenshot":"9251\/images\/1\/L\/conv_tb_confessionsofashopaholic-9780440334453-rh_2011-14-06_161214.png","orientation":"P","device":"T"},{"thumbnail":"9251\/images\/2\/L\/conv_tb_confessionsofashopaholic-9780440334453-rh_2011-14-06_161211.png","screenshot":"9251\/images\/2\/L\/conv_tb_confessionsofashopaholic-9780440334453-rh_2011-14-06_161211.png","orientation":"P","device":"T"},{"thumbnail":"9251\/images\/3\/L\/conv_tb_confessionsofashopaholic-9780440334453-rh_2011-14-06_161240.png","screenshot":"9251\/images\/3\/L\/conv_tb_confessionsofashopaholic-9780440334453-rh_2011-14-06_161240.png","orientation":"P","device":"T"}]}