{"publicApplicationId":"com.glu.app.famguy2xga","description":"What the deuce…? A master plan gone awry sends Stewie and Brian hurtling back through time in Family Guy™: Time Warped! Avoid roving bands of thugs as you pursue Peter through modern-day Quahog! Rescue Rupert from gangs of ornery cowboys headed by an evil 1850’s Lois! Face murderous centurions headed by the Emperor Quagligula, ruling Ancient Rome with his iron… er, um... fist! All this while being pursued by the relentless Time Police and their robot sentinels, charged with protecting history from bungling time travelers like you. Liquidate your foes with a variety of weapons, from baseball bats to shotguns to bottles of ipecac! Uranium rods collected along the way endow you with dazzling new abilities - like the double-jump and the jump-glide – and let you power your way back to modern-day Quahog!\n\nFamily Guy: Time Warped presents a new side to the Griffin family's epic saga, available only on the mobile platform. Grab yours and get set for time-warped chaos, Family Guy-style!\n\n• Play as both Stewie and Brian.\n\n• Travel through the Old West, Ancient Rome and Modern Day Quahog.\n\n• Exclusive time period and levels for smartphones: travel to Ancient Egypt and battle Joe & Meg\n\n• Encounter a variety of time-warped enemies including Pharoah Guards, Centurions, Cowboys, and Time Cops!\n\n• Collect a variety of weapons including shotguns, ipecac, and laser guns!\n\n• Fight climactic boss battles against foes like Lois, Peter, Quagmire and Chris.\n\n• Authentic Family Guy video and audio enlivens your adventure!\n\n• Cameos from fan-favorite characters such as Consuela, Mort, and Herbert","version":"1.0.1","homeURL":"http:\/\/www.glu.com\/support","supportURL":"http:\/\/www.glu.com\/support","custsupportemail":"","custsupportphonenum":"","copyright":"© 2010 Glu Mobile Inc.","licenseURL":"http:\/\/www.glu.com\/support","locale":null,"appSize":"204648856","installSize":"204648856","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"5.49","currency":"USD","filename":"com.glu.app.famguy2xga_1.0.1_all.ipk","free":false,"images":[{"thumbnail":"9279\/images\/1\/L\/conv_tb_fgtw_ipad_001.png","screenshot":"9279\/images\/1\/L\/conv_tb_fgtw_ipad_001.png","orientation":"P","device":"T"},{"thumbnail":"9279\/images\/2\/L\/conv_tb_fgtw_ipad_002.png","screenshot":"9279\/images\/2\/L\/conv_tb_fgtw_ipad_002.png","orientation":"P","device":"T"},{"thumbnail":"9279\/images\/3\/L\/conv_tb_fgtw_ipad_003.png","screenshot":"9279\/images\/3\/L\/conv_tb_fgtw_ipad_003.png","orientation":"P","device":"T"}]}