{"publicApplicationId":"com.glu.app.deer4","description":"The most realistic mobile hunting franchise returns with an all new adventure: Deer Hunter: African Safari! Travel to African countries such as Namibia, Cameroon and Tanzania to bag exotic big game:  Lion, Buffalo, Kudu, and even the mighty Rhinoceros! Experience breathtaking African scenery as you hunt big game, unlocking new difficulty levels and purchasing new items. Participate in multi-day hunting excursions or opt for quickplay mode where you can choose from a one-day Quick Hunt or Shooting Gallery. \n\nBased on the multi-platform, best-selling hunting game from Atari, Deer Hunter: African Safari is as real as it gets!\n\n- Hunt in different African countries including Namibia, Cameroon and Tanzania, all expertly rendered to make for the most realistic hunting sim experience available on mobile phones.\n - All new exotic big game indigenous to Africa: Lion, Buffalo, Kudu, and Rhinoceros - all with true-to-life sense and behaviors!\n- Toggle weapons mid-hunt - you can now choose between 2 different weapons during any given hunt.\n- Use the dynamic scope to zoom in and fire more precise shots, hitting your target's \"kill zone.\" \n- The bigger the game, the better the game - unlock new hunts and purchase new gear and weapons by bagging the biggest animals. \n- Shooting Gallery mode: Shoot the running Kudu for two minutes and score as many hits as you can!","version":"1.2.0","versionNote":"","homeURL":"http:\/\/www.glu.com","supportURL":"http:\/\/www.glu.com\/support","custsupportemail":"","custsupportphonenum":"","copyright":"Source code © 2010 Glu Mobile Inc.","licenseURL":"","locale":"en_US","appSize":164379788,"installSize":166330368,"isEncrypted":false,"adultRating":false,"islocationbased":false,"lastModifiedTime":"2012-06-01T23:18:53.000+0000","mediaLink":null,"mediaIcon":null,"attributes":{"provides":{"noApp":false,"dockMode":false,"universalSearch":false,"connectors":["null"],"services":[],"optimizedUserExperience":true}},"price":4.99,"currency":"USD","isAdvertized":false,"filename":"com.glu.app.deer4_1.2.0_all.ipk","free":false,"touchpad_exclusive":true,"images":{"1":{"screenshot":"9319\/1.2.0\/en\/images\/1\/L\/tb_dhas_scrn1.png","thumbnail":"9319\/1.2.0\/en\/images\/1\/S\/tb_dhas_scrn1.png","orientation":"L","device":"T"},"2":{"screenshot":"9319\/1.2.0\/en\/images\/2\/L\/tb_dhas_scrn2.png","thumbnail":"9319\/1.2.0\/en\/images\/2\/S\/tb_dhas_scrn2.png","orientation":"L","device":"T"},"3":{"screenshot":"9319\/1.2.0\/en\/images\/3\/L\/tb_dhas_scrn3.png","thumbnail":"9319\/1.2.0\/en\/images\/3\/S\/tb_dhas_scrn3.png","orientation":"L","device":"T"}}}