{"publicApplicationId":"com.avnerarbel.animalsoundbox","description":"Animals Sound Box is a fun application for kids and their parents. Press the picture of an animal and enjoy the sound effects.  This will keep any young child busy for hours.  Going on a long trip in the car?  Are you trying to keep your child occupied?  Give your child your Palm Pre and open the Animal Sound Box.  Play a game where you make an animal sound and your child has to press the correct animal and make the corresponding correct sound.  Then you name an animal and your child has to make the sound of the animal by pressing the picture of the correct animal.  Play another game where you describe an animal and your child has to guess which animal you are describing by pressing the correct animal picture and making the correct animal picture.  Have your child press all the animals he sees in your neighborhood. Then have your child press all the animals that he or she has seen in real life.  Have your child press the pictures and make the sounds of those animals he or she has never seen.  If you are traveling in a car, train, or bus, have your child press the pictures of those animals he sees while looking out the window.  Even if your child is simply looking out the window of your home, have him or her press the picture of any animal he sees.  This is a cute educational game that increases the child's awareness and improves coordination and reaction times.  Enjoy!","version":"1.0.6","versionNote":"","homeURL":"http:\/\/avnerarbel.wordpress.com\/","supportURL":"http:\/\/avnerarbel.wordpress.com\/","custsupportemail":"AvnerArbel@gmail.com","custsupportphonenum":"..","copyright":"Copyright 2009 Avner Arbel","licenseURL":"","locale":"en_US","appSize":4138106,"installSize":5216126,"isEncrypted":false,"adultRating":false,"islocationbased":false,"lastModifiedTime":"2009-12-24T09:10:02.000+0000","mediaLink":null,"mediaIcon":null,"attributes":{"provides":{"noApp":false,"dockMode":false,"universalSearch":false,"connectors":[],"services":[],"optimizedUserExperience":false}},"price":0.99,"currency":"USD","isAdvertized":false,"filename":"com.avnerarbel.animalsoundbox_1.0.6_all.ipk","free":false,"touchpad_exclusive":false,"images":{"1":{"thumbnail":"934\/en\/images\/1\/S\/AnimalSoundBox.png","screenshot":"934\/en\/images\/1\/L\/AnimalSoundBox.png","orientation":"P","device":"P"}}}