{"publicApplicationId":"com.infiniteappz.pregnancylog","description":"Track your health information during Pregnancy. Save all your pregnancy related health information in one place.\n \n*) Are you a pregnant and do you want save all your health data in one place? Or Do you want to keep track of all your health related information in a single place?. Use this password protected pregnancy log and save all your major health related information safe and secure in one place.\n\n*) Use this password protected Pregnancy Log application and keep track for all your health related issues in a single application. \n\n*) Using pregnancy log app you can keep track of your glucose level, BP, weight and moods.\n\n*) This application will support to adding multiple health records per-day.\n\n*) Are you forgetting to take the in time medicine or any general related information. This application contains the simple checklist so that you will never forget to taking the medicine’s etc..,\n\n*) You can also track your information using graphs provided by the application.\n\n*) This application also will capable of searching by log by note.\n\n*) We respect your privacy!, this application is a password protected and complete non network based application. So you can enable or disable password at any point of time.\n\n*) This application will take the last menstrual period and it will show you the due date. And using this application you can change the due date and menstrual period.\n\n*) This is best tool for pregnancy ladies.\n\n*) You can install all the feacture updates are free of cost.","version":"1.0.0","homeURL":"http:\/\/www.infiniteappz.com","supportURL":"http:\/\/www.infiniteappz.com","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2011 Infinite Appz","licenseURL":"http:\/\/www.infiniteappz.com","locale":null,"appSize":"298296","installSize":"298296","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"1.99","currency":"USD","filename":"com.infiniteappz.pregnancylog_1.0.0_all.ipk","free":false,"images":[{"thumbnail":"9396\/en\/images\/1\/L\/ph_Home.JPG","screenshot":"9396\/en\/images\/1\/L\/ph_Home.JPG","orientation":"P","device":"P"},{"thumbnail":"9396\/en\/images\/2\/L\/ph_Logs.JPG","screenshot":"9396\/en\/images\/2\/L\/ph_Logs.JPG","orientation":"P","device":"P"},{"thumbnail":"9396\/en\/images\/3\/L\/ph_Events.JPG","screenshot":"9396\/en\/images\/3\/L\/ph_Events.JPG","orientation":"P","device":"P"},{"thumbnail":"9396\/en\/images\/4\/L\/ph_reports.JPG","screenshot":"9396\/en\/images\/4\/L\/ph_reports.JPG","orientation":"P","device":"P"},{"thumbnail":"9396\/en\/images\/5\/L\/ph_Settings.JPG","screenshot":"9396\/en\/images\/5\/L\/ph_Settings.JPG","orientation":"P","device":"P"}]}