{"publicApplicationId":"com.innox.tieknots","description":"Now you can easily learn cool knots for your neck tie, with Tie Knots in Split Color Video. This is the only app in existence that teaches you how to make tie knots using easy-to-follow, two color videos. Click “...More” to learn why you should download this App today! \n\nThere’s this guy you work with who wears intricately knotted ties. He always looks very professional and your female co-workers think the guy is pretty sexy. What a show off! One day he’s wearing a Windsor knot, the next day he may be sporting the Onassis or Merovingian. You don’t even know what a Merovingian is. \n\nIt’s obvious that you have tie knot envy but take heart dear fellow, because help is here, in the Tie Knots in Split Color Video app. Just follow along with the easy, two color videos and before you know it, you’ll be knotting your neck tie like a pro. \n\nIn no time at all, the ‘tie guy’ from work will be the one watching you. Imagine the look on his face when you show up with an Italian or Oriental knot! That’s right; you’ll send him running for his tie knot handbook while you’re cooly impressing your clients, your boss and others in the office, just by looking great. \n\nThink you can’t tie a perfect symmetrical knot? Think again! You can do this. Just watch the video for that knot to learn how. The application contains 13 videos, so you can use a different knot everyday for variety. \n\nDon’t worry if you need more than one practice try to get your knot perfect, the videos are recorded in two colors so you can clearly see what part of the tie is going where and the videos go in slower motion on the hard turns. You get complete visual clarity, so you’ll be able to follow even the most complex knots. Oh yes, and the videos are mirrored too, so you don’t have to give any thought to which hand you should be using.\n\nGo ahead, watch, stop, rewind…as many times as you need and want to. Tie Knots in Split Color Video has everything possible to help you learn to tie your tie in really cool ways.","version":"1.0.0","versionNote":"","homeURL":"http:\/\/www.innox.com.mx","supportURL":"http:\/\/www.innox.com.mx","custsupportemail":"ribarra@innox.com.mx","custsupportphonenum":"","copyright":"Innovacion Inteligente S de RL de CV","licenseURL":"","locale":"en_US","appSize":107893400,"installSize":124518400,"isEncrypted":false,"adultRating":false,"islocationbased":false,"lastModifiedTime":"2012-06-01T23:22:01.000+0000","mediaLink":"http:\/\/www.youtube.com\/watch?v=IVLI3ABkeZQ","mediaIcon":"http:\/\/img.youtube.com\/vi\/IVLI3ABkeZQ\/2.jpg","attributes":{"provides":{"noApp":false,"dockMode":false,"universalSearch":false,"connectors":["null"],"services":[],"optimizedUserExperience":false}},"price":2,"currency":"USD","isAdvertized":false,"filename":"com.innox.tieknots_1.0.0_all.ipk","free":false,"touchpad_exclusive":false,"images":{"1":{"screenshot":"9399\/1.0.0\/en\/images\/1\/L\/ph_tieknot1.png","thumbnail":"9399\/1.0.0\/en\/images\/1\/S\/ph_tieknot1.png","orientation":"P","device":"P"},"2":{"thumbnail":"9399\/1.0.0\/en\/images\/2\/S\/ph_tieknot2.png","screenshot":"9399\/1.0.0\/en\/images\/2\/L\/ph_tieknot2.png","orientation":"P","device":"P"},"3":{"thumbnail":"9399\/1.0.0\/en\/images\/3\/S\/ph_tieknot_3.png","screenshot":"9399\/1.0.0\/en\/images\/3\/L\/ph_tieknot_3.png","orientation":"P","device":"P"},"4":{"screenshot":"9399\/1.0.0\/en\/images\/4\/L\/ph_tieknot_4.png","thumbnail":"9399\/1.0.0\/en\/images\/4\/S\/ph_tieknot_4.png","orientation":"P","device":"P"},"5":{"screenshot":"9399\/1.0.0\/en\/images\/5\/L\/ph_tieknot_5.png","thumbnail":"9399\/1.0.0\/en\/images\/5\/S\/ph_tieknot_5.png","orientation":"P","device":"P"}}}