{"publicApplicationId":"com.dblpartners.comlex","description":"Upward Mobility presents our COMLEX Level 1 Exam Prep app for Palm webOS, perfect for the busy med student. ----OVERVIEW: This module contains a targeted curriculum of 254 questions covering the required content areas for the Level 1 Comprehensive Osteopathic Medical Licensing Examination of the United States. All questions were written exclusively for Upward Mobility by expert writers, with a thorough and up-to-date knowledge of osteopathic medicine. ----FEATURES: Study well with  254 multiple-choice questions with detailed, explanatory answers. These questions cover the following topics: Asymptomatic Conditions & General Symptoms, Digestion & Metabolism, Sensory Alterations, Motor Alterations, Human Sexuality & Urination, Respiration & Circulation, Thermoregulation, Tissues and Trauma, and Human Development. Also enjoy  Upward Mobility’s exclusive, intuitive interface. In Study Mode, each question is paired with a clear and useful explanation. Study at your own pace! The Test Mode is designed to simulate the exam experience. Set your own question and time constraints. ----This app is not affiliated with the National Board of Osteopathic Medical Examiners (NBOME).  ----ABOUT UPWARD MOBILITY: Upward Mobility is an independent test-preparation apps company that creates high quality material that is witty and engaging, perfect for on-the-go students and ambitious professionals. All of our content is developed exclusively for Upward Mobility by writers who are subject matter experts. We are a double bottom line company that is committed to education in the developing world. Some of the profits will be used to deploy education via mobile phone in emerging countries to improve their total factor productivity growth. Customer satisfaction is our top priority, and if you have any questions or comments or are unsatisfied with our products in any way, please contact us at info@upwardpro.com and we will do our best to help you.","version":"1.0.3","versionNote":"","homeURL":"http:\/\/www.upwardpro.com","supportURL":"http:\/\/www.upwardpro.com","custsupportemail":"info@upwardpro.com","custsupportphonenum":"","copyright":"DBL Partners LLC","licenseURL":"","locale":"en_US","appSize":139972,"installSize":1900544,"isEncrypted":false,"adultRating":false,"islocationbased":false,"lastModifiedTime":"2012-06-01T22:11:04.000+0000","mediaLink":null,"mediaIcon":null,"attributes":{"provides":{"noApp":false,"dockMode":false,"universalSearch":false,"connectors":["null"],"services":[],"optimizedUserExperience":false}},"price":4.99,"currency":"USD","isAdvertized":false,"filename":"com.dblpartners.comlex_1.0.3_all.ipk","free":false,"touchpad_exclusive":false,"images":{"1":{"screenshot":"9400\/1.0.3\/en\/images\/1\/L\/ph_portrait1.png","thumbnail":"9400\/1.0.3\/en\/images\/1\/S\/ph_portrait1.png","orientation":"L","device":"P"},"2":{"screenshot":"9400\/1.0.3\/en\/images\/2\/L\/ph_portrait2.png","thumbnail":"9400\/1.0.3\/en\/images\/2\/S\/ph_portrait2.png","orientation":"L","device":"P"},"3":{"screenshot":"9400\/1.0.3\/en\/images\/3\/L\/ph_portrait3.png","thumbnail":"9400\/1.0.3\/en\/images\/3\/S\/ph_portrait3.png","orientation":"L","device":"P"},"4":{"thumbnail":"9400\/1.0.3\/en\/images\/4\/S\/ph_landscape1.png","screenshot":"9400\/1.0.3\/en\/images\/4\/L\/ph_landscape1.png","orientation":"L","device":"P"},"5":{"thumbnail":"9400\/1.0.3\/en\/images\/5\/S\/ph_landscape2.png","screenshot":"9400\/1.0.3\/en\/images\/5\/L\/ph_landscape2.png","orientation":"L","device":"P"}}}