{"publicApplicationId":"com.dijit.mexia","description":"Mexia, a.k.a the \"Mexican Messiah\", a Latin hip-hop artist spittin nimble rhymes in Spanish, English, and Spanglish over electro-tinged beats. Mexia, the cipher tested skateboard kid from San Jose California's predominantly chicano East Side who cut his teeth in MC battles. Also, Mexia (government named Hernan Hernandez Jr.) who grew up watching his father and uncles perform in norteno's Grammy-stacking version of the Rolling Stones, Los Tigres Del Norte. Now the past and present is meshing for an exciting future as the younger Hernandez emerges from behind his father's enormous shadow. It would haven been easy for Mexia to carry on the family tradition, singing beloved corridos. Yet, each generation discovers its own voice and vessel and for Mexia, that was hip-hop. He was an avid break-dancer, MC, and graffiti writer. He and his cousin, a DJ, would obsess over the latest 12\" singles from EPMD or A Tribe Called Quest. Curiosity taking over, a 15 year old Mexia would goof off around in the Tigres' rehearsal studio, making drum loops, and spittin rhymes. Soon, Mexia was hooking up with like-minded MCs and DJs, slanging CDs outside of malls, sneaking into clubs, and jumping into freestyle ciphers. His latest hit single \"Descontrol\" is an up-tempo, wildin' out cuts that make club security and high school principals nervous with its demand to \"muevelolo\", with an emphasis on the latter \"lo\". Produced by acclaimed studio technicians the Iklectix, \"Descontrol\" is a rowdy club banger that bridges Latin pop, hip-hop, and electro that will bring a sweat to your brow and a sway to your hips. Mexia is combining the contemporary and traditional worlds to form his own unique galaxy in Latin hip-hop.","version":"2.0.4","versionNote":"","homeURL":"http:\/\/www.dijit.com","supportURL":"http:\/\/www.dijit.com\/contact-dijit.aspx","custsupportemail":"support@dijit.com","custsupportphonenum":"877.547.2711","copyright":"copyright 2009 Dijit","licenseURL":"","locale":"en_US","appSize":2402896,"installSize":2748221,"isEncrypted":false,"adultRating":false,"islocationbased":false,"lastModifiedTime":"2009-12-25T09:24:33.000+0000","mediaLink":null,"mediaIcon":null,"attributes":{"provides":{"noApp":false,"dockMode":false,"universalSearch":false,"connectors":[],"services":[],"optimizedUserExperience":false}},"price":0.99,"currency":"USD","isAdvertized":false,"filename":"com.dijit.mexia_2.0.4_all.ipk","free":false,"touchpad_exclusive":false,"images":{"1":{"thumbnail":"947\/en\/images\/1\/S\/mexia1.png","screenshot":"947\/en\/images\/1\/L\/mexia1.png","orientation":"P","device":"P"},"2":{"thumbnail":"947\/en\/images\/2\/S\/mexia2.png","screenshot":"947\/en\/images\/2\/L\/mexia2.png","orientation":"P","device":"P"},"3":{"thumbnail":"947\/en\/images\/3\/S\/mexia3.png","screenshot":"947\/en\/images\/3\/L\/mexia3.png","orientation":"P","device":"P"}}}