{"publicApplicationId":"com.scrollmotion.brahmasdreamanovel-9780385672559-rhca","description":"Written with exceptional grace and empathy,  Brahma’s Dream  explores the richness of relationships and the mystery of how one life is defined through its connection to others.  Set in Bombay amid the turbulence of India’s surge towards independence, Brahma’s Dream tells the story of thirteen-year-old Mohini, an unforgettable character whose medical problems set her apart from the world around her, and give her a wisdom and special place in it. Mohini suffers from a rare form of anemia that gradually diminishes her physically but increases her understanding of life in a way incomprehensible to those who move more easily through it.  Under her kind, wry gaze, a family, a city, and a country convulse with idealism and hope. Through Mohini the reader encounters the extraordinary characters who live in her family home, Koleshwar Nivas. Vishnupant, Mohini’s grandfather, is a forward-thinking professor of history who has devoted his life to making sense of India’s past so that the country might fulfil the promise of its future. Keshav, Mohini’s father, who, while embracing the prospect of independence, is eager to hold on to any progress made through British rule. But for both men Mohini is the centre of the universe, as she is for her devoted mother, Kamala, who has sacrificed the intimacy of her marriage to care for her child, and Vasanti, Mohini’s aunt who, having lost the chance at a life beyond the confines of family, looks to her remarkable niece for comfort and understanding.","version":"0.9.90","homeURL":"http:\/\/www.scrollmotion.com","supportURL":"http:\/\/www.scrollmotion.com","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright (c) 2011","licenseURL":"http:\/\/www.scrollmotion.com","locale":null,"appSize":"5938390","installSize":"5938390","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"13.37","currency":"USD","filename":"com.scrollmotion.brahmasdreamanovel-9780385672559-rhca_0.9.90_all.ipk","free":false,"images":[{"thumbnail":"9557\/images\/1\/L\/conv_tb_screenshot1.png","screenshot":"9557\/images\/1\/L\/conv_tb_screenshot1.png","orientation":"P","device":"T"},{"thumbnail":"9557\/images\/2\/L\/conv_tb_screenshot2.png","screenshot":"9557\/images\/2\/L\/conv_tb_screenshot2.png","orientation":"P","device":"T"},{"thumbnail":"9557\/images\/3\/L\/conv_tb_screenshot3.png","screenshot":"9557\/images\/3\/L\/conv_tb_screenshot3.png","orientation":"P","device":"T"}]}