{"publicApplicationId":"com.scrollmotion.a90ofthegameishalfmentalandothe-9780345504876-rh","description":"\"Yogi Berra once said: If you come to a fork in the road, take it. But for lifelong baseball aficionado Emma Span, it hasn't always been that simple. Now, in this winning collection of essays, Span chronicles her love of the sport, from childhood hobby to full-blown obsession, from big break (becoming The Village Voices first staff sports reporter in years) to heartbreak (getting a pink slip within a year). She recounts elbowing her way to get a quote from Yankees captain Derek Jeter and waiting for Mets pitcher Pedro Martinez to put some pants on for an interview. She literally gives her lifeblood to see the Mets and hops a plane to Taiwan, home to perhaps the largest concentration of Yankees fans outside of the five boroughs. But after getting laid off and being forced to leave her press pass behind, Span wonders if her passion for the sport will fade. Highly unlikely. Baseball helped Span forge a lasting bond with her father, connect with total strangers, and endure even the toughest times. With a fresh voice, a devastating wit, and an alarmingly encyclopedic knowledge of the game,Span offers a new perspective on Americas favorite pasttime as a journalist, a baseball nerd, a daughter, and a fervent stay-until-the-last-out fan.","version":"0.9.903","homeURL":"http:\/\/scrollmotion.com","supportURL":"http:\/\/scrollmotion.com","custsupportemail":"","custsupportphonenum":"","copyright":"copyright2011","licenseURL":"http:\/\/scrollmotion.com","locale":null,"appSize":"4163834","installSize":"4163834","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"15","currency":"USD","filename":"com.scrollmotion.a90ofthegameishalfmentalandothe-9780345504876-rh_0.9.903_all.ipk","free":false,"images":[{"thumbnail":"9559\/images\/1\/L\/conv_tb_screenshot1.png","screenshot":"9559\/images\/1\/L\/conv_tb_screenshot1.png","orientation":"P","device":"T"},{"thumbnail":"9559\/images\/2\/L\/conv_tb_screenshot2.png","screenshot":"9559\/images\/2\/L\/conv_tb_screenshot2.png","orientation":"P","device":"T"},{"thumbnail":"9559\/images\/3\/L\/conv_tb_screenshot3.png","screenshot":"9559\/images\/3\/L\/conv_tb_screenshot3.png","orientation":"P","device":"T"}]}