{"publicApplicationId":"com.scrollmotion.badfeelingsselectedpsychoanaly-9781590514283-rh","description":"Bad feelings are ubiquitous to human experience. Everyone deals with grief, envy,  disappointment, dejection, humiliation, mortification, and anxiety. However, when  we consciously push troubling feelings aside and then avoid them, we should be under  no illusions that such repression empowers us to lead untroubled lives. The price  that we pay, simply, is feeling less alive. Our attempts to avoid feeling pain manifest  themselves in feelings of disconnection and numbness. To make matters worse, bad  feelings often bring moralistic self-condemnation that arises unconsciously or even  consciously: \"It is bad of you to feel that way. You're being a nuisance to worry  about that! Many families even elevate mental health to the status of an Eleventh  Commandment. They believe that when they have negative feelings and express them,  this constitutes behavioral problems. When they begin to feel anxious, glum, or ashamed,  they are stricken with guilt or fears of punishment. Their goal is perfect adjustment,  and their taboo is the secret forbidden pleasure hidden by pain. This book demonstrates  how psychoanalytic understanding can reduce the painfulness of negative feelings  and increase our tolerance for emotional pain. This work can enable freedom from  frightening, vengeful, and guilt-ridden fantasies, decrease reliance on passive and  masochistic ways of being, and increase our ability to take pleasure in the body,  to enjoy relations with others, the use of one's assets, and to take pride in one's  achievements. These changes outweigh the emotional pains that we inevitably suffer  by living, and they help us feel that it is worth our while to enjoy a lively existence. From the Trade Paperback edition.","version":"0.9.903","homeURL":"http:\/\/scrollmotion.com","supportURL":"http:\/\/scrollmotion.com","custsupportemail":"","custsupportphonenum":"","copyright":"copyright 2011","licenseURL":"http:\/\/scrollmotion.com","locale":null,"appSize":"3287800","installSize":"3287800","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"28","currency":"USD","filename":"com.scrollmotion.badfeelingsselectedpsychoanaly-9781590514283-rh_0.9.903_all.ipk","free":false,"images":[{"thumbnail":"9564\/images\/1\/L\/conv_tb_screenshot1.png","screenshot":"9564\/images\/1\/L\/conv_tb_screenshot1.png","orientation":"P","device":"T"},{"thumbnail":"9564\/images\/2\/L\/conv_tb_screenshot2.png","screenshot":"9564\/images\/2\/L\/conv_tb_screenshot2.png","orientation":"P","device":"T"},{"thumbnail":"9564\/images\/3\/L\/conv_tb_screenshot3.png","screenshot":"9564\/images\/3\/L\/conv_tb_screenshot3.png","orientation":"P","device":"T"}]}