{"publicApplicationId":"com.scrollmotion.dimestoremagic-9780307358752-rhca","description":"From Canada's new queen of suspense, another hugely entertaining supernatural thriller that will have you on the edge of your seat. Prepare to be enchanted . . .  For years real witches have hidden their powers, afraid of being persecuted. They have integrated so well into the community, you could have a witch living right next door and never know about it. Take Paige, for instance, whom we first met in Kelley Armstrong's novel \"Stolen\". Just an ordinary twenty-something who runs her own website design company, worries about her weight and wonders if she'll ever find a boyfriend. Okay, so she's leader of the American Coven and guardian of Savannah, the teenage daughter of a black witch. Really, life is ordinary. But then a telekinetic half-demon, Leah O'Donnell, shows up to fight for custody of Savannah. And although Paige is ready for her, she's not quite so prepared for the team of supernaturals that Leah brings with her, including a powerful sorcerer who claims to be Savannah's father. When all hell breaks loose -- literally -- and Paige is accused of witchcraft, Satanism and murder, the Coven, fearing exposure, abandons her. Cut off from her friends, Paige is forced against her better judgment to accept the help of a young sorcerer lawyer. And she quickly comes to realize that keeping Savannah could mean losing everything else.","version":"0.9.90","homeURL":"http:\/\/scrollmotion.com","supportURL":"http:\/\/scrollmotion.com","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2011","licenseURL":"http:\/\/scrollmotion.com","locale":null,"appSize":"6323698","installSize":"6323698","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"11.23","currency":"USD","filename":"com.scrollmotion.dimestoremagic-9780307358752-rhca_0.9.90_all.ipk","free":false,"images":[{"thumbnail":"9569\/images\/1\/L\/conv_tb_screenshot1.png","screenshot":"9569\/images\/1\/L\/conv_tb_screenshot1.png","orientation":"P","device":"T"},{"thumbnail":"9569\/images\/2\/L\/conv_tb_screenshot2.png","screenshot":"9569\/images\/2\/L\/conv_tb_screenshot2.png","orientation":"P","device":"T"},{"thumbnail":"9569\/images\/3\/L\/conv_tb_screenshot3.png","screenshot":"9569\/images\/3\/L\/conv_tb_screenshot3.png","orientation":"P","device":"T"}]}