{"publicApplicationId":"com.scrollmotion.finlandculturesmart-9781857335866-rh","description":"Culture Smart! provides essential information on attitudes, beliefs and behavior in different countries, ensuring that you arrive at your destination aware of basic manners, common courtesies, and sensitive issues. These concise guides tell you what to expect, how to behave, and how to establish a rapport with your hosts. This inside knowledge will enable you to steer clear of embarrassing gaffes and mistakes, feel confident in unfamiliar situations, and develop trust, friendships, and successful business relationships. Culture Smart! offers illuminating insights into the culture and society of a particular country. It will help you to turn your visit-whether on business or for pleasure-into a memorable and enriching experience. Contents include customs, values, and traditions - historical, religious, and political background - life at home - leisure, social, and cultural life - eating and drinking - do's, don'ts, and taboos - business practices - communication, spoken and unspoken. \"Culture Smart has come to the rescue of hapless travellers.\" Sunday Times Travel \"... the perfect introduction to the weird, wonderful and downright odd quirks and customs of various countries\" Global Travel \"...full of fascinating-as well as common-sense-tips to help you avoid embarrassing faux pas\" Observer \"...as useful as they are entertaining.\" Easyjet Magazine\"...offer glimpses into the psyche of a faraway world.\" New York Times","version":"0.9.903","homeURL":"http:\/\/scrollmotion.com","supportURL":"http:\/\/scrollmotion.com","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2011","licenseURL":"http:\/\/scrollmotion.com","locale":null,"appSize":"7630570","installSize":"7630570","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"9.95","currency":"USD","filename":"com.scrollmotion.finlandculturesmart-9781857335866-rh_0.9.903_all.ipk","free":false,"images":[{"thumbnail":"9583\/images\/1\/L\/conv_tb_screenshot1.png","screenshot":"9583\/images\/1\/L\/conv_tb_screenshot1.png","orientation":"P","device":"T"},{"thumbnail":"9583\/images\/2\/L\/conv_tb_screenshot2.png","screenshot":"9583\/images\/2\/L\/conv_tb_screenshot2.png","orientation":"P","device":"T"},{"thumbnail":"9583\/images\/3\/L\/conv_tb_screenshot3.png","screenshot":"9583\/images\/3\/L\/conv_tb_screenshot3.png","orientation":"P","device":"T"}]}