{"publicApplicationId":"com.scrollmotion.globalwarmingforbeginners-9781934389430-rh","description":"\"The science is in: Global warming is for real. But what does it all really mean, and what can or should we do about it? This clear, fluid narrative by a leading scientist and educator takes a scrupulously balanced approach in explaining for the reader the history of global climate monitoring and change, and the wheres and whys of the interaction between human activity and recent trends in the Earths climate.Global Warming For Beginners is organized into five compelling sections: Global Warming, An Introduction The Cause The Consequences The Solutions What Steps Can I Take? Working from the premise that no one can do everything but everyone can do something, Goodwin challenges readers with experiments they can conduct to gain a better understanding of the science underlying the problems facing our planet, and concludes with a list of fifty easy actions people can choose from to start doing their part in the effort to slow or stop global warming.  As with all For Beginners titles, this volume is illustrated throughout with entertaining drawings that help readers understand and retain the information in Goodwins lively and comprehensive text.\"","version":"0.9.903","homeURL":"http:\/\/scrollmotion.com","supportURL":"http:\/\/scrollmotion.com","custsupportemail":"","custsupportphonenum":"","copyright":"copyright 2011","licenseURL":"http:\/\/scrollmotion.com","locale":null,"appSize":"12133310","installSize":"12133310","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"14.96","currency":"USD","filename":"com.scrollmotion.globalwarmingforbeginners-9781934389430-rh_0.9.903_all.ipk","free":false,"images":[{"thumbnail":"9585\/images\/1\/L\/conv_tb_screenshot1.png","screenshot":"9585\/images\/1\/L\/conv_tb_screenshot1.png","orientation":"P","device":"T"},{"thumbnail":"9585\/images\/2\/L\/conv_tb_screenshot2.png","screenshot":"9585\/images\/2\/L\/conv_tb_screenshot2.png","orientation":"P","device":"T"},{"thumbnail":"9585\/images\/3\/L\/conv_tb_screenshot3.png","screenshot":"9585\/images\/3\/L\/conv_tb_screenshot3.png","orientation":"P","device":"T"}]}