{"publicApplicationId":"com.scrollmotion.brigadiergentlehero-9781770490031-rhca","description":"The true story of a gentle hero who won hearts and affection for  his commitment to “serve and protect.”   A big boy right from the start, Brig was a Belgian draft cross, or grade horse, with just the right temperament to earn his place on the Mounted Unit of the Toronto Police Department. Brigadier was a golden chestnut with four white socks, and his size alone was imposing. But that wasn’t why Sergeant Graham Acott chose this horse above all the others with such certainty. The animal’s large, intelligent, and gentle eyes were what struck him. This was a horse, and a partner, perfectly suited to the job for which he’d been bred.  Brigadier never let Graham or anyone else down for a moment, and his years of service with the force were happy ones. When, on that last night, he turned into the path of an oncoming car and took the full force of its impact, he did what he was trained to do and he did it with the heart of a gentle hero.  Thousands wept and were outraged by the senseless cruelty that ended Brig’s life. For his selfless act, Brigadier received full honors, a police funeral, and tributes from around the world. But his days of willing service, the smiles he brought, and his gift of companionship are what he will always be remembered for.    From the Trade Paperback edition.","version":"0.9.90","homeURL":"http:\/\/www.scrollmotion.com","supportURL":"http:\/\/www.scrollmotion.com","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright (c) 2011","licenseURL":"http:\/\/www.scrollmotion.com","locale":null,"appSize":"5664344","installSize":"5664344","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"5.6","currency":"USD","filename":"com.scrollmotion.brigadiergentlehero-9781770490031-rhca_0.9.90_all.ipk","free":false,"images":[{"thumbnail":"9640\/images\/1\/L\/conv_tb_screenshot1.png","screenshot":"9640\/images\/1\/L\/conv_tb_screenshot1.png","orientation":"P","device":"T"},{"thumbnail":"9640\/images\/2\/L\/conv_tb_screenshot2.png","screenshot":"9640\/images\/2\/L\/conv_tb_screenshot2.png","orientation":"P","device":"T"},{"thumbnail":"9640\/images\/3\/L\/conv_tb_screenshot3.png","screenshot":"9640\/images\/3\/L\/conv_tb_screenshot3.png","orientation":"P","device":"T"}]}