{"publicApplicationId":"com.scrollmotion.doingdangerouslywell-9780307374165-rhca","description":"A dark comedy about disaster capitalism, cutthroat office politics, vicious sibling rivalry, hapless do-gooderism and the corporatization of water. When a humanitarian catastrophe strikes Nigeria, an unforgettable cast of Machiavellian opportunists and quixotic do-gooders swoop in to make the most of the tragedy. Some time in the near future, Kainji Dam, the engineering marvel that is the pride of Nigeria, collapses, killing thousands of villagers. The Minister of Natural Resources can hardly believe his luck - now he can make a bid for the presidency. On the other side of the world, the grimly ambitious executive of a water company also sniffs an opportunity - to make her bosses happy by privatizing a major African river. Her sister, Barbara, who has never encountered a cause she wouldn't carry a placard for, joins forces with Femi Jegede, a charismatic Nigerian activist whose family was swept away in the disaster. The result: a wickedly satirical romp along a road to hell paved with both good and bad intentions. Brazen, hilarious and sublimely written, Carole Enahoro's debut novel is simply dazzling.","version":"0.9.90","homeURL":"http:\/\/scrollmotion.com","supportURL":"http:\/\/scrollmotion.com","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2011","licenseURL":"http:\/\/scrollmotion.com","locale":null,"appSize":"6606324","installSize":"6606324","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"19.67","currency":"USD","filename":"com.scrollmotion.doingdangerouslywell-9780307374165-rhca_0.9.90_all.ipk","free":false,"images":[{"thumbnail":"9641\/images\/1\/L\/conv_tb_screenshot1.png","screenshot":"9641\/images\/1\/L\/conv_tb_screenshot1.png","orientation":"P","device":"T"},{"thumbnail":"9641\/images\/2\/L\/conv_tb_screenshot2.png","screenshot":"9641\/images\/2\/L\/conv_tb_screenshot2.png","orientation":"P","device":"T"},{"thumbnail":"9641\/images\/3\/L\/conv_tb_screenshot3.png","screenshot":"9641\/images\/3\/L\/conv_tb_screenshot3.png","orientation":"P","device":"T"}]}