{"publicApplicationId":"com.tourtempo.totalgame","description":"Used by beginners through Major Championship winners on the PGA Tour, and validated by an Independent Scientific Study by the Departments of Physics and Biomechanics at Yale University. \n\nThe Total Game App allows you to learn how to correctly integrate the Tempo of the Tour Pros into your golf swing.  Over 100,000 golfers worldwide, including Major Championship winners on the PGA Tour, have improved their games by using Tour Tempo. \n\n\"It will be the best thing that you will ever do for your game.\" - Pat Dempsey, 2002 RE\/MAX World Long Drive Sr. Champion \n\n\"You will get better right away!  When you synch your swing to that of the Tour Pros with Tour Tempo, you’ll get better right now!\" - Dan Rooney, PGA Teaching Professional & F-16 Pilot \n\n\"The Unified Theory of Tempo\" - Golf Digest \n\n\"No one has ever come up with a way to teach Tempo until now.\" - Travel + Leisure Golf \n\n\"The Swing Secret no one has ever told you\" - Golf for Women Magazine \n\nBased on the international best selling golf book, Tour Tempo.  The book outlines and explains the discovery of a specific mathematical ratio regarding the elapsed time of the backswing and the elapsed time of the downswing of the Tour Pros.  The Tour Tempo System is simple and easy to learn.  All you do is react to three scientifically spaced musical notes.  These musical notes alert you to start your takeaway, start your downswing, and then the third note lines you up with impact.  It’s just that easy - you literally download the App, turn it on, grab a club and start swinging to the Tempo of the Tour Pros. \n\nDISCOUNT COUPON \nThe Total Game App is your first step towards a more powerful, consistent golf game, & that is why we are giving you a discount at the Tour Tempo Shop.  When you buy now, inside your app in the Info Section you will find a one-time discount code good for $10 off your order in our Tour Tempo Online Shop.","version":"1.0.3","versionNote":"","homeURL":"http:\/\/www.tourtempo.com","supportURL":"http:\/\/www.tourtempo.com","custsupportemail":"info@tourtempo.com","custsupportphonenum":"","copyright":"Copyright 2010 Tour Tempo, Inc.","licenseURL":"","locale":"en_US","appSize":311261668,"installSize":336101376,"isEncrypted":false,"adultRating":false,"islocationbased":false,"lastModifiedTime":"2012-06-02T02:24:40.000+0000","mediaLink":null,"mediaIcon":null,"attributes":{"provides":{"noApp":false,"dockMode":false,"universalSearch":false,"connectors":["null"],"services":[],"optimizedUserExperience":true}},"price":24.99,"currency":"USD","isAdvertized":false,"filename":"com.tourtempo.totalgame_1.0.3_all.ipk","free":false,"touchpad_exclusive":true,"images":[]}