{"publicApplicationId":"com.onghu.onkana-tp","description":"Ever needed to type something in Japanese, but felt restricted by the lack of support for Japanese entry in webOS?  OnKANA lets you enter romaji text and convert it to Hiragana or Katakana. You can also use the virtual keyboard to enter common Kanji.  The text can then be copied to the clipboard or used as a starting point for an e-mail, message, memo or Google Search.  Copied text can be pasted into any application, e.g. as a calendar entry or into a text box on the internet (Wikipedia lookup for a Japanese word).\n\nNote:\nOnKANA is not a converter to Kanji. Kana to Kanji conversion is a difficult task and requires quite a bit of development effort to get it right. OnKANA is a much simpler application that allows you to get the text into Hiragana\/ Katakana for use in messaging, emails or searching things on the Internet.\n\nUsage:\nJust tap the message area and start typing on your keyboard. OnKANA follows simple rules for converting Romaji to Kana (details in the in-app Help). You can also tap the virtual keys on the screen to input special symbols. For convenience, a very small set of Kanji is included to allow you to type dates and time. To change from Hiragana to Katakana to English, tap the selector just above the blue text area and select the correct entry mode.\n\nLimitations and Known Issues:\nThe following are limitations in OnKANA:\n* Half-width Katakana: OnKANA currently only supports full-width Katakana and Hiragana.\n* Cut and Paste: Pasting text into the OnKANA text entry box may result in strange results. Currently, it is expected that you enter text directly into the OnKANA text entry box.\n* Entering text not at the end: Currently, OnKANA does not allow you to enter any text into the middle of an already-typed sentence. It is assumed that all text is entered at the end of the line.\n\nQuestions, Feedback, Suggestions:\nIf you find any bugs, or have any feedback, or would like to suggest a new feature, please contact Mohit Sindhwani at mohits@onghu.com","version":"0.9.5","versionNote":"","homeURL":"http:\/\/www.onghu.com\/","supportURL":"http:\/\/www.onghu.com\/webos\/","custsupportemail":"mohits@onghu.com","custsupportphonenum":"","copyright":"Copyright 2011 Mohit Sindhwani","licenseURL":"","locale":"en_US","appSize":129458,"installSize":1081344,"isEncrypted":false,"adultRating":false,"islocationbased":false,"lastModifiedTime":"2011-07-07T00:20:34.000+0000","mediaLink":null,"mediaIcon":null,"attributes":{"provides":{"noApp":false,"dockMode":false,"universalSearch":false,"connectors":[],"services":[],"optimizedUserExperience":false}},"price":0,"currency":"USD","isAdvertized":false,"filename":"com.onghu.onkana-tp_0.9.5_all.ipk","free":false,"touchpad_exclusive":true,"images":{"1":{"thumbnail":"9656\/en\/images\/1\/S\/conv_tb_onkana-tp_095_001.png","screenshot":"9656\/en\/images\/1\/L\/conv_tb_onkana-tp_095_001.png","orientation":"P","device":"P"},"2":{"thumbnail":"9656\/en\/images\/2\/S\/conv_tb_onkana-tp_095_002.png","screenshot":"9656\/en\/images\/2\/L\/conv_tb_onkana-tp_095_002.png","orientation":"P","device":"P"},"3":{"thumbnail":"9656\/en\/images\/3\/S\/conv_tb_onkana-tp_095_003.png","screenshot":"9656\/en\/images\/3\/L\/conv_tb_onkana-tp_095_003.png","orientation":"P","device":"P"},"4":{"thumbnail":"9656\/en\/images\/4\/S\/tb_onkana-tp_095_004.png","screenshot":"9656\/en\/images\/4\/L\/tb_onkana-tp_095_004.png","orientation":"P","device":"P"},"5":{"thumbnail":"9656\/en\/images\/5\/S\/tb_onkana-tp_095_005.png","screenshot":"9656\/en\/images\/5\/L\/tb_onkana-tp_095_005.png","orientation":"P","device":"P"}}}