{"publicApplicationId":"com.scrollmotion.borkmannspointaninspectorvanve-9780385673020-rhca","description":"A riveting detective novel from the internationally acclaimed author Håkan Nesser in which Detective Chief Inspector Van Veeteren is summoned to Kaalbringen, a quiet European town by the sea, to track down the link between a series of murders.  An ex-con is brutally murdered with an axe in the unusually quiet town of Kaalbringen. And then the body of a wealthy real estate mogul is found, also violently attacked. With what appears to be a serial killer on the loose, Detective Chief Inspector Van Veeteren is called in to help out the local investigation. In his storied career he’s never faced an axe murderer and has only ever left one case unsolved. As details surrounding the murders are collected, Van Veeteren finds there is almost nothing to go on; nothing he can find links the two victims. But then there’s another murder and one of his colleagues, a promising female detective, goes missing, perhaps because the criminal knows she has come too close to the truth...  In this riveting novel, full of fascinating, realistic characters and motives, Håkan Nesser introduces American readers to his unique and entertaining new detective, Van Veeteren, and spins a story that leaves even the most veteran crime novel readers chilled.    From the Hardcover edition.","version":"0.9.90","homeURL":"http:\/\/www.scrollmotion.com","supportURL":"http:\/\/www.scrollmotion.com","custsupportemail":"","custsupportphonenum":"","copyright":"copyright (c) 2011","licenseURL":"http:\/\/www.scrollmotion.com","locale":null,"appSize":"5845762","installSize":"5845762","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"14","currency":"USD","filename":"com.scrollmotion.borkmannspointaninspectorvanve-9780385673020-rhca_0.9.90_all.ipk","free":false,"images":[{"thumbnail":"9681\/en\/images\/1\/L\/conv_tb_screenshot1.png","screenshot":"9681\/en\/images\/1\/L\/conv_tb_screenshot1.png","orientation":"P","device":"T"},{"thumbnail":"9681\/en\/images\/2\/L\/conv_tb_screenshot2.png","screenshot":"9681\/en\/images\/2\/L\/conv_tb_screenshot2.png","orientation":"P","device":"T"},{"thumbnail":"9681\/en\/images\/3\/L\/conv_tb_screenshot3.png","screenshot":"9681\/en\/images\/3\/L\/conv_tb_screenshot3.png","orientation":"P","device":"T"}]}