{"publicApplicationId":"com.scrollmotion.depths-9780307370297-rhca","description":"October 1914: the destroyer Svea emerged from the Stockholm archipelago bearing south-southeast. On board was Lars Tobiasson-Svartman, a naval engineer charged with making depth soundings to find a navigable channel for the Swedish navy. As a child Tobiasson-Svartman was fascinated by measurement; nothing is as magical as exact knowledge. His instinct for his profession is reflected in the comfortable domesticity he enjoys with his wife - herself meticulous in every detail. Close to the waters where soundings are taken Tobiasson-Svartman alights on a barren skerry, presumed uninhabited, and is surprised to discover there a young woman, Sara Fredrika. Despite her almost feral appearance, something about her strikes him to the core. The mission is a success and the Svea returns to Gothenburg. Tobiasson-Svartman, however, remains haunted by this chance encounter; his equilibrium has been disturbed, and he is now compelled to find any pretence to return to the remote islet. Mankell has produced a novel as tense and compelling in every way as the Wallander series, but also powerful, moving and ultimately tragic.","version":"0.9.90","homeURL":"http:\/\/scrollmotion.com","supportURL":"http:\/\/scrollmotion.com","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2011","licenseURL":"http:\/\/scrollmotion.com","locale":null,"appSize":"5923724","installSize":"5923724","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"21","currency":"USD","filename":"com.scrollmotion.depths-9780307370297-rhca_0.9.90_all.ipk","free":false,"images":[{"thumbnail":"9695\/en\/images\/1\/L\/conv_tb_screenshot1.png","screenshot":"9695\/en\/images\/1\/L\/conv_tb_screenshot1.png","orientation":"P","device":"T"},{"thumbnail":"9695\/en\/images\/2\/L\/conv_tb_screenshot2.png","screenshot":"9695\/en\/images\/2\/L\/conv_tb_screenshot2.png","orientation":"P","device":"T"},{"thumbnail":"9695\/en\/images\/3\/L\/conv_tb_screenshot3.png","screenshot":"9695\/en\/images\/3\/L\/conv_tb_screenshot3.png","orientation":"P","device":"T"}]}