{"publicApplicationId":"com.dblpartners.foodsafetypro","description":"With 201 targeted questions and detailed, helpful explanations, Upward Mobility's Food Safety Pro app for Palm’s webOS will help you hone your knowledge of critical kitchen habits. Perfect for the culinary professional, kitchen manager, food safety professional, or home cook, this app re-enforces knowledge of safe food preparation, food storage, and kitchen practices, as well as U.S. legal procedures and the science of contamination. All of our app content is created exclusively for Upward Mobility by expert culinary safety writers. This app was designed to encompass the requirements of the  ServSafe Food Protection Manager Certification Examination, the American Food Safety Institute (AFSI) Food Manager Certification (FMC) exam, and the National Registry of Food Safety Professionals (NRFSP) Certified Food Safety Professional examination, and the content is also applicable to state level exams.\n\n\nABOUT UPWARD MOBILITY:   \nUpward Mobility is an independent test-preparation apps company that creates high quality material that is witty and engaging, perfect for on-the-go students and ambitious professionals. All of our content is developed exclusively for Upward Mobility by writers who are subject matter experts. We are a double bottom line company that is committed to education in the developing world. Some of the profits will be used to deploy education via mobile phone in emerging countries to improve their total factor productivity growth. Customer satisfaction is our top priority, and if you have any questions or comments or are unsatisfied with our products in any way, please contact us at info@upwardpro.com and we will do our best to help you.","version":"1.0.3","homeURL":"http:\/\/upwardpro.com","supportURL":"http:\/\/upwardpro.com","custsupportemail":"","custsupportphonenum":"","copyright":"DBL Partners LLC","licenseURL":"http:\/\/upwardpro.com","locale":null,"appSize":"126202","installSize":"126202","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"3.99","currency":"USD","filename":"com.dblpartners.foodsafetypro_1.0.3_all.ipk","free":false,"images":[{"thumbnail":"9851\/images\/1\/L\/ph_1.png","screenshot":"9851\/images\/1\/L\/ph_1.png","orientation":"P","device":"P"},{"thumbnail":"9851\/images\/2\/L\/ph_2.png","screenshot":"9851\/images\/2\/L\/ph_2.png","orientation":"P","device":"P"},{"thumbnail":"9851\/images\/3\/L\/ph_3.png","screenshot":"9851\/images\/3\/L\/ph_3.png","orientation":"P","device":"P"},{"thumbnail":"9851\/images\/4\/L\/ph_4.png","screenshot":"9851\/images\/4\/L\/ph_4.png","orientation":"P","device":"P"},{"thumbnail":"9851\/images\/5\/L\/ph_5.png","screenshot":"9851\/images\/5\/L\/ph_5.png","orientation":"P","device":"P"}]}