{"publicApplicationId":"com.dblpartners.praxis2k6","description":"With 200 targeted multiple-choice questions and detailed explanations, Upward Mobility’s Praxis II K-6 app for Palm’s webOS is the perfect tool for on-the-go teaching professionals preparing for the Praxis II: Principles of Learning and Teaching K-6 exam.\n\nOVERVIEW:\nThis module contains realistic teaching scenarios in a targeted curriculum of questions covering the required content areas for the Praxis II: PLT K-6 exam, including Students as Learners, Teacher Professionalism, Instruction and Assessment, and Communication Techniques. All questions were written exclusively for Upward Mobility by expert writers. Additionally, this app uses Upward Mobility’s exclusive, intuitive interface. Read explanations as you go in Study Mode, or set a time limit and a number of questions in Test Mode.\n\nThis app is not affiliated with or endorsed by ETS.\n\nABOUT UPWARD MOBILITY:\nUpward Mobility is an independent test-preparation apps company that creates high quality material that is witty and engaging, perfect for on-the-go students and ambitious professionals. All of our content is developed exclusively for Upward Mobility by writers who are subject matter experts and undergoes a thorough review process.\n\nWe are a double bottom line company that is committed to education in the developing world. Some of the profits will be used to deploy education via mobile phone in emerging countries to improve their total factor productivity growth.\n\nCustomer satisfaction is our top priority, and if you have any questions or comments or are unsatisfied with our products in any way, please contact us at info@upwardpro.com and we will do our best to help you.","version":"1.0.3","homeURL":"http:\/\/upwardpro.com","supportURL":"http:\/\/upwardpro.com","custsupportemail":"","custsupportphonenum":"","copyright":"DBL Partners, LLC","licenseURL":"http:\/\/upwardpro.com","locale":null,"appSize":"161736","installSize":"161736","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"3.99","currency":"USD","filename":"com.dblpartners.praxis2k6_1.0.3_all.ipk","free":false,"images":[{"thumbnail":"9885\/images\/1\/L\/ph_1.png","screenshot":"9885\/images\/1\/L\/ph_1.png","orientation":"P","device":"P"},{"thumbnail":"9885\/images\/2\/L\/ph_2.png","screenshot":"9885\/images\/2\/L\/ph_2.png","orientation":"P","device":"P"},{"thumbnail":"9885\/images\/3\/L\/ph_3.png","screenshot":"9885\/images\/3\/L\/ph_3.png","orientation":"P","device":"P"},{"thumbnail":"9885\/images\/4\/L\/ph_4.png","screenshot":"9885\/images\/4\/L\/ph_4.png","orientation":"P","device":"P"},{"thumbnail":"9885\/images\/5\/L\/ph_5.png","screenshot":"9885\/images\/5\/L\/ph_5.png","orientation":"P","device":"P"}]}