{"publicApplicationId":"com.glu.app.paperboy","description":"A veritable classic from the golden age of video gaming returns to a new route on the mobile platform! The arcade game you remember from the 80's has been brought back to life with updated graphics and a new Story Mode with more forgiving game-play mechanics. As the Paperboy, you'll fight for customers against the enigmatic \"Grifter.\" Successfully deliver papers to the customers on your route, scoring bonus points for landing papers directly in their mailbox. You'll have plenty of obstacles to contend with along the way: avoid dogs, cars, burglars, breakdancers, trash cans, runaway lawnmowers and more! As you play through the story, you'll acquire different skills and abilities - like yo-yo and multi-paper throws - to get help you through challenging areas. Pay attention for clues as the story unfolds - will you get the girl? Who are the mysterious paper barons trying to muscle in on your turf? All will be revealed in this humorous, nostalgic and faithful re-creation of the 80's classic!\nFeatures:\n- An update that retains the humor and core game play of the original 80's stand-up arcade classic\n- Easy controls make pick-up-and-play a snap: turn left\/right, speed up\/slow down, throw papers. \n- Funny, engaging storyline set in the 80s, supported by new obstacles, gameplay enhancements and characters. \n- A NEW, easier STORY Mode in addition to CLASSIC Mode - just like the original!\n- Refined artwork and graphics make for a deeper, richer and more 3D experience than ever before.\n- Develop your paperboy character by unlocking 6 special skills and abilities in Story Mode such as the yo-yo throw or multi-paper throw.","version":"1.0.3","homeURL":"http:\/\/www.glu.com\/support","supportURL":"http:\/\/www.glu.com\/support","custsupportemail":"","custsupportphonenum":"","copyright":"Paperboy © 2010 Warner Bros. Entertainment Inc.","licenseURL":"http:\/\/www.glu.com\/support","locale":null,"appSize":"12856190","installSize":"12856190","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"3.99","currency":"USD","filename":"com.glu.app.paperboy_1.0.3_all.ipk","free":false,"images":[{"thumbnail":"9900\/images\/1\/L\/conv_tb_paperboy_1024x768.jpg","screenshot":"9900\/images\/1\/L\/conv_tb_paperboy_1024x768.jpg","orientation":"P","device":"T"},{"thumbnail":"9900\/images\/2\/L\/conv_tb_paperboy_1024x768_2.jpg","screenshot":"9900\/images\/2\/L\/conv_tb_paperboy_1024x768_2.jpg","orientation":"P","device":"T"},{"thumbnail":"9900\/images\/3\/L\/conv_tb_paperboy_1024x768_3.jpg","screenshot":"9900\/images\/3\/L\/conv_tb_paperboy_1024x768_3.jpg","orientation":"P","device":"T"}]}