{"publicApplicationId":"com.discipleskies.weightlosswizard","description":"With Weight Loss Wizard, you don't just get thin: You get fit , stay fit and have fun doing it!  The software was developed by Jordan Train, M.D., a lifelong exercise enthusiast and physician with years of experience in designing exercise programs and applications to help patient's manage their weight and improve general fitness and health.  Features include speed tracking, distance tracking, ascension tracking, and Calorie meters for ascension and distance traveled. Fat Lost is also calculated and recorded.  There are 20 built-in speed modes for calculating Calories burned and each mode is set automatically, based on your travel speed and weight. Weight Loss Wizard makes use of the latest exercise physiology studies to produce the most accurate 'Calories Burned' reports available. The app has multiple tap areas that allow you to view and customize speed and travel data.  A beautiful statistics page shows your total miles, number of workouts and metabolic stats for each exercise session. Tap on speed and distance and convert the units to various forms of US and metric meaurements.  The included fitness module  calculates your pulse and reports the adequacy of your aerobic workout and a Body Mass Index Evaluation Tool reports the level of obesity \/ thinness according to the International Standard.  The application is extremely well documented with ample help and prompts making this one of the easiest-to-use exercise incentive tools around. For a limited time, this is a Palm device exlusive. Special Features: The software also serves as an excellent navigation tool and includes moment-by-moment coordinate tracking and a trail tracing that records and optionally stores your path. The software does not require internet or phone service and may be used in far-flung places where these services are not available.","version":"3.1.0","versionNote":"","homeURL":"http:\/\/www.discipleskies.com","supportURL":"http:\/\/www.discipleskies.com","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2011 Disciple Skies Software","licenseURL":"","locale":"en_US","appSize":833230,"installSize":3964928,"isEncrypted":false,"adultRating":false,"islocationbased":true,"lastModifiedTime":"2012-06-02T03:57:27.000+0000","mediaLink":null,"mediaIcon":null,"attributes":{"provides":{"noApp":false,"dockMode":false,"universalSearch":false,"connectors":["null"],"services":[],"optimizedUserExperience":false}},"price":1.99,"currency":"USD","isAdvertized":false,"filename":"com.discipleskies.weightlosswizard_3.1.0_all.ipk","free":false,"touchpad_exclusive":false,"images":{"1":{"screenshot":"9926\/3.1.0\/en\/images\/1\/L\/ph_weight2.png","thumbnail":"9926\/3.1.0\/en\/images\/1\/S\/ph_weight2.png","orientation":"P","device":"P"},"2":{"screenshot":"9926\/3.1.0\/en\/images\/2\/L\/ph_weight3.png","thumbnail":"9926\/3.1.0\/en\/images\/2\/S\/ph_weight3.png","orientation":"P","device":"P"},"3":{"screenshot":"9926\/3.1.0\/en\/images\/3\/L\/ph_weight5.png","thumbnail":"9926\/3.1.0\/en\/images\/3\/S\/ph_weight5.png","orientation":"P","device":"P"},"4":{"screenshot":"9926\/3.1.0\/en\/images\/4\/L\/ph_weight4.png","thumbnail":"9926\/3.1.0\/en\/images\/4\/S\/ph_weight4.png","orientation":"P","device":"P"},"5":{"screenshot":"9926\/3.1.0\/en\/images\/5\/L\/ph_weight1.png","thumbnail":"9926\/3.1.0\/en\/images\/5\/S\/ph_weight1.png","orientation":"P","device":"P"}}}