{"publicApplicationId":"com.blackboard.app.mobilecentral-spu","description":"SPU Mobile helps you stay connected to Seattle Pacific University from wherever you are, on or off campus.\n\nUse SPU Mobile to find anyone in the campus directory and get in touch instantly, stay-in-the-loop with the latest campus news, keep tabs on Falcon sports scores, watch videos from recent events, and browse the course catalog. It’s SPU in the palm of your hand!\n\nFeatures:\n\nDirectory: Get in touch with anyone campus-wide by accessing the SPU White Pages from your phone. You can also add that person directly to your phone's address book!\n\nTime Schedule: Browse and search courses for current and future terms, see course descriptions, times, locations, and availability, and even contact the instructor directly from the app.\n\nLibrary: Easily find library resources including location and call number, and even see current availability.\n\nMaps: Pinpoint your location on our campus map to help you find campus buildings and locations. Find courses in the Time Schedule and see their location on the map.\n\nNews: Keep up with all the happenings on and off campus with news from a variety of sources including the Falcon Sports News, Ethix.org, Lectio: Guided Bible Readings, and President Eaton’s Blog.\n\nVideos: Access SPU’s video content in one easy-to-view place.\n\nImages: Check out scenic shots of the SPU campus and view photos from the campus events. Save images to your phone or save as a background to show your school pride.\n\nGet Help: Get access to important numbers and information when you need them. Call to report an emergency or get information from the Seattle Pacific University Emergency Information Hotline.","version":"1.0.0","versionNote":"","homeURL":"http:\/\/mobile.spu.edu\/","supportURL":"http:\/\/mobile.spu.edu\/","custsupportemail":"mobiledu@terriblyclever.com","custsupportphonenum":"","copyright":"copyright","licenseURL":"","locale":"en_US","appSize":2595690,"installSize":22446080,"isEncrypted":false,"adultRating":false,"islocationbased":false,"lastModifiedTime":"2011-07-26T06:02:40.000+0000","mediaLink":null,"mediaIcon":null,"attributes":{"provides":{"noApp":false,"dockMode":false,"universalSearch":false,"connectors":[],"services":[],"optimizedUserExperience":false}},"price":0,"currency":"USD","isAdvertized":false,"filename":"com.blackboard.app.mobilecentral-spu_1.0.0_all.ipk","free":false,"touchpad_exclusive":false,"images":{"1":{"thumbnail":"9937\/en\/images\/1\/S\/ph_springboard_palm.png","screenshot":"9937\/en\/images\/1\/L\/ph_springboard_palm.png","orientation":"P","device":"P"},"2":{"thumbnail":"9937\/en\/images\/2\/S\/ph_courses_palm.png","screenshot":"9937\/en\/images\/2\/L\/ph_courses_palm.png","orientation":"P","device":"P"},"3":{"thumbnail":"9937\/en\/images\/3\/S\/ph_directory_palm.png","screenshot":"9937\/en\/images\/3\/L\/ph_directory_palm.png","orientation":"P","device":"P"}}}