{"publicApplicationId":"com.bitsofgodsoftware.simplebiblepro","description":"Displays full screen on the TouchPad.\n\nSimple Bible Pro is an “offline” Bible reader and study app.  Once you have downloaded a Bible you may use Simple Bible Pro anywhere without the need for an Internet connection.  Free Bibles that are available for download are: YLT, ASV, DNT, GEN, KJV, WBS, WEY and WEB.  A partial list of the Paid Bibles includes: ESV, HCSB, NAB, NASB, NIV, NKJV, NLT and MSG.  The pricing for paid Bibles ranges from $9.99 to $24.99.  For a complete list of Simple Bible Pro compatible Bibles and their pricing, please visit our website at www.bitsofgodsoftware.com.\n\nOther features included in Simple Bible Pro are: Bookmarks with Categories, Notes, Highlights, Search, Keyboard Navigation, Auto-Scroll, Red Words of Christ and Passage Sharing.\n\nSimple Bible Pro uses Laridian, Inc. published Bibles that are also used in MyBible on PalmOS, PocketBible on iOS, Android, Windows Mobile and Windows PC and Noah Bible Software on Blackberry.  That means Bibles you have bought in the past from Laridian for these other platforms can now be downloaded for use with Simple Bible Pro on webOS at no cost to you.\n\n\nPlease Note, the Bible Database files used by Simple Bible Pro are about 10-15 times larger than a typical Bible Database.  As a result, downloading a Bible will take about 5-6 minutes on a good connection.  It will take even longer if you don’t have a strong cellular signal.  Downloads on the TouchPad can take up to twice as long as on a phone.","version":"1.0.9","homeURL":"http:\/\/www.bitsofgodsoftware.com\/contact","supportURL":"http:\/\/www.bitsofgodsoftware.com\/contact","custsupportemail":"","custsupportphonenum":"","copyright":"Copyright 2011 Bits of God Software, LLC","licenseURL":"http:\/\/www.bitsofgodsoftware.com\/contact","locale":null,"appSize":"272374","installSize":"272374","isEncrypted":null,"adultRating":null,"islocationbased":null,"lastModifiedTime":null,"mediaLink":null,"mediaIcon":null,"attributes":[],"price":"4.99","currency":"USD","filename":"com.bitsofgodsoftware.simplebiblepro_1.0.9_all.ipk","free":false,"images":[{"thumbnail":"9942\/icon\/S\/icon_1_0_9.png","screenshot":"9942\/icon\/S\/icon_1_0_9.png","orientation":"P","device":"P"}]}