{"publicApplicationId":"com.cellflare.app.cf","description":"Our app uses your Palm Pre or Palm Pixi’s GPS system to locate you and your contacts on the move in real time.  Cellflare  gives you the ability to locate yourself or your friends directly on your device using our live scalable map. This makes finding your way a whole lot easier as you can accurately navigate around the city in the palm of your hand using either the road, satellite or hybrid map view. All while letting your contacts locate you at the same time.   After downloading the app onto your Palm Pre or Palm Pixi you will need to go to cellflare.com and create a free account.  Next you will use your 10 digit phone number and your unique 6 digit license key -given when you update your profile- to activate Cellflare on your phone.   Now you are ready to add your friends and create your Cellflare social locating empire.  Cellflare’s website map gives you instant visual reference of your online contacts, showing you who is out and about. Not only does Cellflare work in real time it also locates users within 5 meters of their exact location. Each contact is displayed using a colored dot and their profile picture.    Safety is a huge aspect of Cellflare; its features are designed to help give users peace of mind while on the move, making it a practical tool in today’s world. •         Quick Locate allows unregistered guests to have a quick peek at a desired user’s whereabouts, with the user’s permission. •         The History feature allows users to retrace their recent movements displaying their trips from A to B, showing the speed. •         With the GeoFence, you can set a parameter around a certain location and receive email notifications when contacts enter or exit the set boundaries. •         Friends on the Map shows your Contacts on the map on your mobile device in real time. •         With Cellflare Messaging you can SMS or Email your Palm Contacts with a message and your Address Location.  Get ready to look and locate! ","version":"3.0.2","versionNote":"","homeURL":"http:\/\/www.cellflare.com","supportURL":"http:\/\/www.cellflare.com\/forums\/default.aspx","custsupportemail":"support@cellflare.com","custsupportphonenum":"..","copyright":"Copyright 2009 Cellflare Inc.","licenseURL":"","locale":"en_US","appSize":246360,"installSize":5386033,"isEncrypted":false,"adultRating":false,"islocationbased":true,"lastModifiedTime":"2010-03-22T13:44:58.000+0000","mediaLink":"http:\/\/www.youtube.com\/watch?v=SB9ns5KjiC8","mediaIcon":"http:\/\/img.youtube.com\/vi\/SB9ns5KjiC8\/2.jpg","attributes":{"provides":{"noApp":false,"dockMode":false,"universalSearch":false,"connectors":[],"services":[],"optimizedUserExperience":false}},"price":0,"currency":"USD","isAdvertized":false,"filename":"com.cellflare.app.cf_3.0.2_all.ipk","free":false,"touchpad_exclusive":false,"images":{"1":{"thumbnail":"996\/en\/images\/1\/S\/menu.jpg","screenshot":"996\/en\/images\/1\/L\/menu.jpg","orientation":"P","device":"P"},"2":{"thumbnail":"996\/en\/images\/2\/S\/palm2.jpg","screenshot":"996\/en\/images\/2\/L\/palm2.jpg","orientation":"P","device":"P"},"3":{"thumbnail":"996\/en\/images\/3\/S\/palm3.jpg","screenshot":"996\/en\/images\/3\/L\/palm3.jpg","orientation":"P","device":"P"},"4":{"thumbnail":"996\/en\/images\/4\/S\/palm4-%283%29.jpg","screenshot":"996\/en\/images\/4\/L\/palm4-%283%29.jpg","orientation":"P","device":"P"}}}